{
  "backend/main.mo": "Main Motoko actor for the Inner Bloom app defining data types (Book, JournalEntry, UserProfile, MeditationSession, etc.) and importing authorization/storage mixins; includes a hardcoded list of meditation book recommendations.",
  "feature_evidence.json": "Feature evidence report confirming that the quiz score display on the Knowledge page was moved inline next to the category title (formatted as 'X/6' with a medal icon), with high confidence based on changes to KnowledgePage.tsx.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of each frontend source file, serving as a reference document for the app's component and page structure.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Step-by-step runbook for redeploying the Inner Bloom app without code changes, covering prerequisites and standard redeploy steps.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Structured troubleshooting template for diagnosing deployment failures across stages including dependency installation, backend/frontend deployment, Candid generation, and runtime errors.",
  "frontend/index.css": "Root CSS file defining OKLCH-based CSS custom properties for light and dark themes (colors, borders, sidebar, charts) using Tailwind's base layer.",
  "frontend/index.html": "HTML entry point for the Inner Bloom app that sets up the root div, favicon, a process.env compatibility shim, and global error/unhandled-rejection logging handlers.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all app routes (landing, dashboard, pre-meditation, progress, journal, books, knowledge) and wraps everything in AppErrorBoundary, ThemeProvider, and ThemedToaster.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel component for selecting ambient music with audio preview, mute toggle, volume slider, swipe gesture support, and automatic cleanup of audio on unmount or track change.",
  "frontend/src/components/AppErrorBoundary.tsx": "A React class-based error boundary that catches unhandled errors and displays a styled error screen with the error message, stack trace, component stack, and a reload button.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "A dismissible alert banner that displays cloud sync errors with customized titles and descriptions based on error type (authorization, readiness, network, or other), including a retry button.",
  "frontend/src/components/DurationRangeInput.tsx": "A labeled slider input component for selecting a duration in minutes, with configurable min/max bounds and a step of 5 minutes.",
  "frontend/src/components/FeatureCard.tsx": "Empty file with no content.",
  "frontend/src/components/FloatingNav.tsx": "A fixed left-side floating navigation bar with animated icon buttons for Journal, Progress, Books, and Knowledge routes, showing a tooltip label on hover.",
  "frontend/src/components/HamburgerMenu.tsx": "A mobile hamburger menu (Sheet) providing theme toggling, authentication status display, logout functionality, and navigation back to the start page.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "A journal filter panel with popover dropdowns for mood and energy selection, date range inputs, text search, and a favorites toggle, tracking the count of active filters.",
  "frontend/src/components/KnowledgeBookPager.tsx": "A paginated book-style content viewer supporting swipe gestures, keyboard arrow navigation, dot indicators, and smooth scroll-to-content on page change.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "A carousel component for selecting knowledge categories that supports touch swipe, keyboard arrow navigation, and circular navigation with center/adjacent card scaling animations.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "A dialog component that presents a shuffled multi-question quiz for a knowledge category, supports back/forward navigation between questions, and displays a results summary with retake option.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "A Three.js/R3F component that renders an animated 3D lotus flower with 8 petals, a stem, and a center glow, driven by a LotusGrowthState object controlling bloom, breathing, and vividness animations.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "A Three.js/R3F component that renders animated particles around the lotus, switching between chaotic Brownian motion and coherent orbital patterns based on the LotusGrowthState's particle coherence value.",
  "frontend/src/components/LotusCanvas.tsx": "A full-screen canvas component that renders an animated lotus flower with floating particles, supporting multiple visual variants and intensity levels with theme-aware visibility adjustments.",
  "frontend/src/components/MeditationCarousel.tsx": "A carousel component for selecting a meditation type from a predefined list, supporting touch swipe and button navigation with circular 3D-style card scaling transitions.",
  "frontend/src/components/MeditationGuideStepper.tsx": "A step-by-step guide component for meditation instructions that supports dot navigation, touch swipe, and directional slide animations, with special rendering for a 'Benefits' section.",
  "frontend/src/components/MeditationTimerRing.tsx": "A Canvas-based animated timer ring component that draws a circular progress arc with wave effects and a glowing edge indicator, supporting dark/light themes.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "A Canvas-based circular indicator that fills from bottom to top with an animated wave surface to represent meditation progress, supporting dark/light themes.",
  "frontend/src/components/MobileBackButton.tsx": "A mobile-only fixed back button that navigates to the dashboard, optionally calling a custom onBack handler before navigating.",
  "frontend/src/components/PageBackgroundShell.tsx": "A layout wrapper that renders a full-screen background with a LotusCanvas animation behind page children, supporting variant and intensity props.",
  "frontend/src/components/ProgressBowl.tsx": "A Canvas-based animated bowl component that fills with a liquid wave effect proportional to total meditation minutes, capped at 20,000 minutes.",
  "frontend/src/components/ProgressLotusR3F.tsx": "A Three.js/React Three Fiber component that renders a 3D lotus model with particles and auto-rotation, with growth state derived from total meditation minutes.",
  "frontend/src/components/ProgressLotusSVG.tsx": "An SVG lotus flower component with animated breathing, multi-layer petal opening, and color vividness that evolve based on total meditation minutes and current streak.",
  "frontend/src/components/QuizDialog.tsx": "A multi-step quiz dialog that presents 5 questions to determine a recommended meditation type (mindfulness, metta, visualization, or IFS) based on user answers.",
  "frontend/src/components/RitualSelectionModal.tsx": "A dialog modal that displays a user's saved meditation rituals (up to 5) using a carousel, with options to start or delete rituals. Shows an empty state message if no rituals exist.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "A swipeable/navigable carousel component for browsing saved meditation rituals, supporting touch gestures, keyboard-style prev/next navigation, and delete confirmation via an alert dialog.",
  "frontend/src/components/SessionIndicator.tsx": "A fixed UI indicator showing authentication status (guest or logged in) with buttons to return to the start page or log out, clearing relevant query caches on logout.",
  "frontend/src/components/StandardPageNav.tsx": "A reusable navigation bar component providing a back button, theme toggle, session indicator (desktop), and hamburger menu (mobile) for standard app pages.",
  "frontend/src/components/ThemedToaster.tsx": "A thin wrapper around the Sonner Toaster component that renders it with a close button inside a named div.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useCloudOperation.ts": "A composition hook that exposes a `runCloudWriteWithRetry` helper, wrapping cloud operations with readiness-aware retry logic using the current actor and identity via refs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient creation with ICP-specific configuration.",
  "frontend/src/hooks/useMeditationTimer.ts": "Custom React hook that implements a countdown meditation timer with start, pause, reset, seek, and duration-change controls, firing a callback on completion.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations (books, journal entries, meditation sessions, rituals, user profile), supporting both authenticated and guest (local storage) modes.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, imports Playfair Display font, defines OKLCH-based light/dark theme CSS variables, and declares custom utility animations (fade-in, breathe, glow, float, wave).",
  "frontend/src/lib/bookData.ts": "Static data file exporting a curated list of meditation and mindfulness book recommendations with titles, authors, descriptions, tags, and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Defines TypeScript interfaces and static content for meditation technique educational pages, including multi-page articles and quiz questions for techniques like mindfulness.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Renders the active meditation session UI with a wave-fill timer, play/pause button, volume slider, and time seek slider. Accepts all session state and callbacks as props.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays a carousel of book recommendations with swipe/touch support, circular navigation, and stacked card animations. Pulls book data from a static data source.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing a meditation type carousel, a daily quote, and buttons to begin a session, take a quiz, or start a saved ritual. Handles navigation to pre-meditation and manages ritual CRUD via React Query hooks.",
  "frontend/src/pages/JournalPage.tsx": "Journal page that lists meditation session entries with filtering, inline editing, favorite toggling, deletion, and import/export functionality. Uses React Query hooks for data and shows cloud sync error banners for authenticated users.",
  "frontend/src/pages/KnowledgePage.tsx": "Knowledge library page with a category carousel, paginated book-style content viewer, and a per-category quiz with score persistence. Supports deep-link scrolling and syncs quiz scores with the user's identity.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component that displays the app's hero section with login via Internet Identity and guest mode options, redirecting authenticated users to the dashboard. Includes a theme toggle and animated lotus canvas background.",
  "frontend/src/pages/PreMeditationPage.tsx": "Pre-meditation setup page where users select mood, energy level, meditation type, duration, ambient sound, and optionally write a journal entry before starting a session. Integrates guided stepper instructions per meditation type and handles session recording.",
  "frontend/src/pages/ProgressPage.tsx": "Progress tracking page that displays user meditation stats (total minutes, streak, rank) and supports exporting/importing progress data as a file with confirmation dialogs.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty file with no content.",
  "frontend/src/pages/StatsPage.tsx": "Empty file with no content.",
  "frontend/src/utils/ambientSounds.ts": "Defines the list of available ambient sounds (id, name, icon, audio path) and provides helper functions to look up a sound by ID or retrieve its audio path.",
  "frontend/src/utils/cloudSync.ts": "Provides standardized cloud sync error codes, user-friendly error messages, and a classifier function that maps raw backend/network errors to typed error categories.",
  "frontend/src/utils/cloudSyncRetry.ts": "Wraps cloud operations with automatic retry logic for readiness failures, and exports helper functions to distinguish authorization errors from transient readiness errors.",
  "frontend/src/utils/exportImport.ts": "Provides serialization and deserialization utilities for exporting and importing user meditation data (journal entries, sessions, progress stats, rituals) to/from a versioned JSON file format, with bigint-safe string conversion and enum validation helpers.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages localStorage persistence of knowledge quiz scores, keyed by user principal ID or a guest fallback key, and exposes a React hook for reading and saving scores tied to the current identity.",
  "frontend/src/utils/lotusGrowthModel.ts": "Calculates visual growth parameters for an animated lotus flower based on total meditation minutes (0–20,000), mapping progress through 24 phases to petal size, layer openness, vividness, particle behavior, and breathing amplitude.",
  "frontend/src/utils/meditationStorage.ts": "Provides localStorage CRUD utilities for guest (unauthenticated) users to persist journal entries, progress data, and rituals, including a one-time migration from legacy storage keys.",
  "frontend/src/utils/meditationType.ts": "Validates and normalizes a string into a supported MeditationType enum value, falling back to mindfulness for unknown inputs and treating 'meta' as an alias for 'metta'.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tier buckets (Droplet through Infinite Waters) aligned to a 0–20,000 minute scale and exports helper functions to retrieve the current rank, next rank, and minutes remaining until promotion.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL query parameters from both standard and hash-based routes, persisting them in sessionStorage, and cleaning sensitive parameters from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens (using oklch CSS variables), border radius, box shadows, and plugins including typography, container queries, and animate.",
  "project_state.json": "Project state metadata tracking a wellness/knowledge app feature request to display quiz scores inline with article category titles in 'X/6' format with a theme-colored medal icon on the Knowledge page."
}