{
  "backend/main.mo": "Main Motoko actor for the Inner Bloom app defining core data types (Book, JournalEntry, UserProfile, MeditationSession, etc.) and importing authorization/blob-storage mixins, with a hardcoded list of meditation book recommendations.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (UI fixes for ActiveMeditationPage play/pause button, volume/seek padding, back button visibility, and layout) to their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "A JSON-formatted reference document containing one-to-two sentence summaries of each frontend source file, describing their purpose, key behaviors, and notable implementation details.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Step-by-step runbook for redeploying the Inner Bloom app without code changes, listing prerequisites and standard redeploy steps.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Structured troubleshooting template for diagnosing deployment failures across stages (dependency install, backend deploy, Candid generation, frontend build/deploy, and runtime), with fields for recording error messages and failed components.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for the light and dark themes, covering background, foreground, card, sidebar, chart, and other UI token colors.",
  "frontend/index.html": "HTML entry point for the Inner Bloom app that sets up the root div, loads the React module, and includes early runtime shims for process.env and global error/unhandled-rejection logging.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (landing, dashboard, pre-meditation, progress, journal, books, knowledge) and wraps the app in AppErrorBoundary, ThemeProvider, and ThemedToaster.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "A carousel component for selecting and playing ambient background sounds, with volume control, mute toggle, and touch swipe support.",
  "frontend/src/components/AppErrorBoundary.tsx": "A React class-based error boundary that catches unhandled errors and displays error details (message, stack trace, component stack) with a reload button.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "An alert banner that displays cloud sync or data-loading errors with contextual messages based on error type and a retry button.",
  "frontend/src/components/DurationRangeInput.tsx": "A labeled slider input component for selecting a session duration in minutes, with configurable min/max bounds and step of 5.",
  "frontend/src/components/FeatureCard.tsx": "An empty file with no content or exports.",
  "frontend/src/components/FloatingNav.tsx": "A fixed left-side floating navigation bar with animated icon buttons linking to Journal, Progress, Books, and Knowledge routes.",
  "frontend/src/components/HamburgerMenu.tsx": "A mobile hamburger menu (Sheet) providing theme toggling, authentication status display, logout, and navigation back to the start page.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "A filter panel for journal entries supporting multi-select mood and energy filters, date range inputs, text search, and a favorites toggle with active filter count badges.",
  "frontend/src/components/KnowledgeBookPager.tsx": "A paginated book-style component for displaying knowledge content pages with swipe, keyboard, and dot navigation support. Handles slide animations, scroll-to-content behavior, and resets to the first page when the category changes.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "A circular carousel component for selecting knowledge categories, showing the selected item centered with adjacent items partially visible. Supports swipe gestures, keyboard arrow keys, and smooth CSS transitions.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "A modal dialog that presents a shuffled multiple-choice quiz for a knowledge category, tracking per-question answers and allowing back-navigation. Displays a results summary on completion and supports retaking the quiz.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "A React Three Fiber component that renders an animated 3D lotus flower with 8 petals, a stem, and a center glow, driven by a LotusGrowthState object for bloom, breathing, and opacity animations.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "A React Three Fiber component that renders animated particles around the lotus, switching between chaotic Brownian motion and coherent orbital patterns based on the LotusGrowthState's coherence and cap values.",
  "frontend/src/components/LotusCanvas.tsx": "A full-screen canvas component that renders an animated lotus flower with floating particles using requestAnimationFrame. Supports multiple visual variants and intensity levels, adjusting opacity based on the current theme (dark/light).",
  "frontend/src/components/MeditationCarousel.tsx": "A circular carousel for selecting a meditation type, displaying the selected card centered with adjacent cards partially visible. Supports touch swipe gestures and wraps around a fixed list of meditation options.",
  "frontend/src/components/MeditationGuideStepper.tsx": "A multi-step stepper component for displaying meditation guide steps with forward/backward navigation, dot indicators, touch swipe support, and optional 'Benefits' section rendering.",
  "frontend/src/components/MeditationTimerRing.tsx": "A canvas-based animated ring component that visualizes meditation timer progress with a wave effect, glowing edge, and theme-aware colors using requestAnimationFrame.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "A canvas-based circular indicator that fills from bottom to top with an animated wave surface to represent meditation session progress, supporting light and dark themes.",
  "frontend/src/components/MobileBackButton.tsx": "A mobile-only fixed back button that navigates to the dashboard, optionally calling a custom onBack handler before navigating.",
  "frontend/src/components/PageBackgroundShell.tsx": "A layout shell component that wraps page content with a themed background gradient and an animated LotusCanvas backdrop.",
  "frontend/src/components/ProgressBowl.tsx": "A canvas-based animated bowl visualization that fills with a liquid wave effect proportional to total meditation minutes, with glow effects and theme-aware colors.",
  "frontend/src/components/ProgressLotusR3F.tsx": "A React Three Fiber 3D scene rendering an animated lotus model and particles whose growth state is derived from total meditation minutes, with orbit controls and lighting.",
  "frontend/src/components/ProgressLotusSVG.tsx": "An SVG lotus flower component with layered petals that animate open, glow, and breathe based on total meditation minutes and current streak, using a growth model for visual state.",
  "frontend/src/components/QuizDialog.tsx": "A modal dialog component that presents a 5-question meditation quiz to users, calculates scores for four meditation types (mindfulness, metta, visualization, IFS), and returns a recommended type via the onComplete callback.",
  "frontend/src/components/RitualSelectionModal.tsx": "A dialog modal that displays up to 5 saved meditation rituals using a carousel component, allowing users to start or delete a ritual.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "A swipeable carousel component for browsing saved meditation rituals, supporting touch gestures, navigation arrows, and delete confirmation via an alert dialog.",
  "frontend/src/components/SessionIndicator.tsx": "A fixed UI indicator showing authentication status (guest or logged in) with buttons to return to the start page or log out, clearing relevant query caches on logout.",
  "frontend/src/components/StandardPageNav.tsx": "A reusable navigation bar component that renders a back button, theme toggle, session indicator (desktop), and hamburger menu (mobile) for standard app pages.",
  "frontend/src/components/ThemedToaster.tsx": "A thin wrapper component that renders the Sonner Toaster with a close button for displaying toast notifications.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCloudOperation.ts": "Composition hook that wraps cloud backend operations with readiness-aware retry logic, exposing a `runCloudWriteWithRetry` function that uses the latest actor and identity via refs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useMeditationTimer.ts": "Custom hook implementing a countdown meditation timer with support for pause/resume, seek, duration changes, and an `onComplete` callback when the timer reaches zero.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend data operations (books, quotes, journal entries, meditation sessions, rituals, user profiles), supporting both authenticated cloud storage and guest local storage modes.",
  "frontend/src/index.css": "Global stylesheet defining OKLCH-based CSS custom properties for light and dark themes, Tailwind directives, and custom utility animations (fade-in, breathe, glow-pulse, float, wave).",
  "frontend/src/lib/bookData.ts": "Static data file exporting a hardcoded list of meditation and mindfulness book recommendations with titles, authors, descriptions, Amazon links, and tags.",
  "frontend/src/lib/knowledgeContent.ts": "Defines TypeScript interfaces for quiz questions and technique content, and exports a TECHNIQUE_CONTENT array with detailed multi-page educational content and quizzes for meditation techniques like mindfulness.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "A meditation session page that displays a countdown timer with a wave fill indicator, controls ambient audio playback with volume adjustment, and supports pause/seek functionality before navigating to the dashboard on completion.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "A page that displays book recommendations in a swipeable/navigable carousel with touch support, showing adjacent cards at reduced opacity and supporting circular navigation through the book list.",
  "frontend/src/pages/DashboardPage.tsx": "The main dashboard page where users select a meditation type via a carousel, view a random daily quote, manage saved rituals, and navigate to pre-meditation setup or a quiz flow.",
  "frontend/src/pages/JournalPage.tsx": "A journal page that lists meditation journal entries with filtering by mood, energy, date, and favorites, and supports inline editing, deletion, favorite toggling, and import/export of data.",
  "frontend/src/pages/KnowledgePage.tsx": "Displays a meditation knowledge library with a category carousel, book-style pager, and quiz dialog. Manages category selection via URL search params, loads/saves quiz scores per user identity, and supports deep-link scrolling.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with Internet Identity login and guest mode options, featuring an animated lotus canvas background and theme toggle. Redirects authenticated users to the dashboard automatically.",
  "frontend/src/pages/PreMeditationPage.tsx": "Pre-meditation setup page where users configure mood, energy, duration, ambient sound, and meditation type before starting a session. Includes detailed step-by-step technique guides, a timer, journal entry creation, and ritual saving.",
  "frontend/src/pages/ProgressPage.tsx": "Displays user meditation progress stats (total minutes, streak, rank) with a visual bowl component. Supports exporting and importing progress data with confirmation dialogs and cloud sync error handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty file with no content.",
  "frontend/src/pages/StatsPage.tsx": "Empty file with no content.",
  "frontend/src/utils/ambientSounds.ts": "Defines a static list of ambient sound options (id, name, icon, audio path) and provides helper functions to look up a sound by ID or retrieve its audio path.",
  "frontend/src/utils/cloudSync.ts": "Provides standardized cloud sync error codes, user-friendly messages, and a classifier function that maps raw backend/network errors to typed error categories for consistent UI error handling.",
  "frontend/src/utils/cloudSyncRetry.ts": "Provides retry logic for cloud operations, wrapping them with readiness checks and distinguishing between authorization errors (no retry) and transient readiness errors (retryable).",
  "frontend/src/utils/exportImport.ts": "Handles serialization and deserialization of backend meditation data (journal entries, sessions, progress, rituals) to/from a safe JSON export file format with bigint-to-string conversion.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages localStorage persistence of knowledge quiz scores, keyed by user principal ID or a guest key, with a React hook for convenient access.",
  "frontend/src/utils/lotusGrowthModel.ts": "Calculates visual growth parameters for a lotus flower animation based on total meditation minutes (0–20,000), mapping progress to petal size, layer openness, vividness, and particle effects across 24 phases.",
  "frontend/src/utils/meditationStorage.ts": "Provides localStorage CRUD utilities for guest (unauthenticated) meditation data including journal entries, progress stats, and rituals, with one-time migration from legacy storage keys.",
  "frontend/src/utils/meditationType.ts": "Validates and normalizes a string to a supported MeditationType enum value, with a fallback to mindfulness and an alias mapping 'meta' to 'metta'.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tier buckets (Droplet through Infinite Waters) mapped to total meditation minutes (0–20,000+) and exports helper functions to get current rank, next rank, and minutes until promotion.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, custom color tokens (using oklch CSS variables), border radius, box shadows, and plugins including typography, container-queries, and animate.",
  "project_state.json": "Tracks the current project state (version 7) including completed and pending UI fix features for ActiveMeditationPage.tsx, covering play/pause button shape, control padding, back button visibility, and back button layout positioning."
}