{
  "kind": "build_request",
  "title": "Display quiz score inline with article title in X/6 format with theme-colored medal icon",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the Knowledge page, remove the existing quiz score display from on top of the 'Take Quiz' button. Instead, render the score inline on the same row as the article/category title, positioned close to the title (e.g., immediately to its right). The score must be formatted as 'X/6' (e.g., '0/6', '4/6'). Next to the score text, display a medal or award icon styled in the app's primary theme color. Only show the score display when a quiz score exists for that category.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1",
          "msg-recent-2"
        ],
        "quotes": [
          "The title I am reffering to, is in the same row visually as 'Take Quiz' btn. So for instance, Mindfulenss title would have to its right, close, score",
          "Want the same color icon, theme color"
        ]
      },
      "acceptanceCriteria": [
        "The quiz score no longer appears as a number badge/overlay on top of the 'Take Quiz' button.",
        "The score appears inline on the same visual row as the article/category title and the 'Take Quiz' button.",
        "The score is positioned close to and to the right of the title text.",
        "The score uses the format 'X/6' (e.g., '3/6', '6/6').",
        "A medal or award icon is displayed immediately next to the 'X/6' score text.",
        "The medal/award icon uses the app's primary theme color (CSS theme variable, not a hardcoded color).",
        "If no quiz score has been recorded for a category, the score and icon are not shown.",
        "Layout does not break on mobile screen sizes."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Use the existing CSS theme color variables (not hardcoded hex/rgb values) for the icon color."
  ],
  "nonGoals": [
    "Changing the quiz dialog or quiz logic.",
    "Changing the score storage mechanism in knowledgeQuizStorage.ts.",
    "Adding new medal tiers or color variations based on score value."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}