{
  "backend/main.mo": "Defines core backend actor types for books, journaling, meditation sessions, user profiles, rituals, and import/export data, plus initializes a static book list.",
  "feature_evidence.json": "Contains feature evidence entries mapping feature requirements to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists summarized descriptions of various frontend files for reference or tooling.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Provides step-by-step instructions for redeploying the frontend without code changes.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Provides a structured template for diagnosing and resolving deployment failures.",
  "frontend/index.css": "Defines global Tailwind base styles and color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting up root div, favicon, error handlers, and loading the main React module.",
  "frontend/src/App.tsx": "Main React app component configuring routes, theme provider, error boundary, and global toaster styling.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel for selecting ambient audio tracks with swipe, mute, and volume controls; manages audio playback via an internal Audio element.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays detailed error info and offers a reload option when the app crashes.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Destructive alert banner for sync or load errors with a retry button and loading state.",
  "frontend/src/components/ExportImportControls.tsx": "Floating buttons for exporting data to JSON and importing from a file, with loading indicators.",
  "frontend/src/components/FeatureCard.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/FloatingNav.tsx": "Floating vertical navigation menu with animated icons and hover labels that routes to main app sections.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile slide-out menu providing theme toggle, account actions, and navigation, integrated with Internet Identity.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Paged reader component with swipe, keyboard navigation, and auto-scroll to show sequential knowledge pages.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel for selecting knowledge categories with swipe, keyboard, and circular navigation plus dynamic card styling.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Modal quiz dialog that shuffles questions, tracks answers, navigates between them, and shows final results.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "R3F lotus mesh rendering dynamic petals, glow, and breathing animations based on growth state.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Particle system around lotus with chaotic or coherent motion driven by growth parameters.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas-based animated lotus and particles with theme- and variant-based visual adjustments and pulsing effects.",
  "frontend/src/components/MeditationCarousel.tsx": "Circular carousel of meditation types with swipe navigation and dynamic scaling for centered and adjacent cards.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Step-by-step meditation guide with swipe navigation, animated transitions, and parsed content including benefits.",
  "frontend/src/components/MeditationTimerRing.tsx": "Canvas-based circular meditation timer with animated wave fill, glow effects, and theme‑aware colors.",
  "frontend/src/components/MeditationTimerWaveFill.tsx": "Canvas component rendering a vertical wave-filled progress bar behind centered time text.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only button that navigates back to the dashboard using a styled icon button.",
  "frontend/src/components/PageBackgroundShell.tsx": "Layout wrapper applying a themed background and rendering an animated LotusCanvas behind children.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered bowl graphic showing total meditation minutes as animated liquid fill with glow effects.",
  "frontend/src/components/ProgressLotusR3F.tsx": "3D lotus growth visualization using react-three-fiber with lights, particles, and auto-rotating controls.",
  "frontend/src/components/ProgressLotusSVG.tsx": "Animated multi-layer SVG lotus that changes color, glow, and petal openness based on meditation progress and streak.",
  "frontend/src/components/QuizDialog.tsx": "Modal quiz presenting five questions and computing a recommended meditation type from selected answers.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal listing up to five saved rituals with a carousel interface and start/delete actions.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel for browsing, starting, and deleting saved rituals with swipe and dialog support.",
  "frontend/src/components/SessionIndicator.tsx": "Displays login state and provides guest return or logout actions, clearing related queries.",
  "frontend/src/components/StandardPageNav.tsx": "Page navigation bar with optional back button, theme toggle, session indicator, and mobile menu.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, logout, and identity persistence.",
  "frontend/src/hooks/useMeditationTimer.ts": "Implements a countdown meditation timer with pause, seek, progress, and completion callback support.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for meditation data, including types, quotes, and local/guest fallbacks.",
  "frontend/src/index.css": "Defines Tailwind setup, theme variables, and custom animations for the app's styling.",
  "frontend/src/lib/bookData.ts": "Exports a list of recommended meditation-related books with descriptions, tags, and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Contains structured educational content and quizzes for meditation techniques.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Renders a swipeable, theme-aware carousel UI for browsing book recommendations.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing quotes, meditation types, rituals, and navigation to sessions, quiz, and pre‑meditation flow.",
  "frontend/src/pages/JournalPage.tsx": "Displays and manages journal entries with filtering, editing, favoriting, deletion, import/export, and guest‑mode recovery.",
  "frontend/src/pages/KnowledgePage.tsx": "Shows meditation knowledge content with category navigation, scrolling, quizzes, and theme/session controls.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen handling login, guest mode, theme toggle, and redirecting authenticated users to the dashboard.",
  "frontend/src/pages/PreMeditationPage.tsx": "Handles meditation setup, timer, ambient sound selection, guides, reflections, and ritual saving/deletion before and after a session.",
  "frontend/src/pages/ProgressPage.tsx": "Renders the progress dashboard, showing meditation stats, streaks, rank info, session history, and import/export controls with error handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/StatsPage.tsx": "Empty file with no implementation.",
  "frontend/src/utils/cloudSync.ts": "Provides standardized cloud sync error mapping and readiness checks for backend operations.",
  "frontend/src/utils/exportImport.ts": "Handles serialization and deserialization of meditation data to a safe JSON format for export/import with validation.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages saving and retrieving quiz scores in localStorage, supporting both guest and authenticated users.",
  "frontend/src/utils/lotusGrowthModel.ts": "Computes lotus growth visualization parameters based on total meditation minutes using phased thresholds and smooth transitions.",
  "frontend/src/utils/meditationStorage.ts": "Implements localStorage-based persistence for guest journal entries, progress stats, and rituals with validation and update helpers.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers based on total meditation minutes and provides helpers to get current/next rank and minutes needed to advance.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and clear them from storage or the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, container settings, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Holds project metadata including feature requirements, known issues, architectural notes, and the current project state version."
}