{
  "backend/main.mo": "Defines core data types for books, journaling, meditation sessions, rituals, and import/export structures, and initializes a predefined book list.",
  "feature_evidence.json": "Lists feature evidence records describing required frontend fixes, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files including components, pages, hooks, and configuration.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Provides step‑by‑step instructions for redeploying the application without code changes.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template for diagnosing deployment failures across installation, backend, build, and runtime stages.",
  "frontend/index.css": "Defines base Tailwind layers and OKLCH color variables for light and dark themes along with global style rules.",
  "frontend/index.html": "HTML entry file setting up the app root, favicon, safety shims, and global error handlers before loading the main bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in an error boundary, theme provider, and toaster.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel for selecting and previewing ambient sounds with swipe navigation, mute, and volume controls.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a detailed fallback UI with error info and reload option.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Displays a retryable error banner for cloud sync failures with messages varying by error type.",
  "frontend/src/components/DurationRangeInput.tsx": "A slider-based duration input component allowing users to select a time range in minutes.",
  "frontend/src/components/FeatureCard.tsx": "Empty file with no implementation.",
  "frontend/src/components/FloatingNav.tsx": "Vertical floating navigation bar with icons that navigate to different app routes and show labels on hover.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile slide-out menu providing theme toggle, account actions, and navigation, integrated with identity and query management.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "Popover-based filter panel for journal entries with controls for favorites, mood, energy, date range, and text search.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Paginated book-style viewer supporting swipes, keyboard navigation, and animated transitions between content pages.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel component for selecting knowledge categories with swipe, keyboard, and button navigation plus dynamic card positioning.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Dialog-based quiz flow that shuffles questions, tracks answers, navigates between questions, and displays results.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus model that animates petals, stem, and center glow based on growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Three.js particle system around the lotus with coherent or chaotic motion depending on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas-based animated lotus visualization with particles, responsive sizing, and theme-based visibility adjustments.",
  "frontend/src/components/MeditationCarousel.tsx": "Meditation selector carousel featuring swipe navigation, circular indexing, and animated card scaling.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Stepper for meditation instructions supporting swipe navigation, step indicators, and content parsing for benefits.",
  "frontend/src/components/MeditationTimerRing.tsx": "Animated canvas ring showing progress with wave effects and theme-based colors.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Circular fill indicator using animated waves to represent progress inside a clipped region.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that navigates to the dashboard and optionally triggers a callback.",
  "frontend/src/components/PageBackgroundShell.tsx": "Layout wrapper that renders a themed LotusCanvas background behind page content.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-based bowl graphic showing liquid fill level with glow and wave animations based on total minutes.",
  "frontend/src/components/ProgressLotusR3F.tsx": "3D lotus progress visualization using react-three-fiber with growth state, lighting, particles, and controls.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG lotus that animates breathing, glow, and petal openness based on growth, streak, and theme.",
  "frontend/src/components/QuizDialog.tsx": "Multi-step quiz dialog that collects answers and computes a recommended meditation type.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal that displays up to five saved rituals and lets users start or delete one.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel UI for browsing, starting, and deleting saved rituals with swipe and confirmation handling.",
  "frontend/src/components/SessionIndicator.tsx": "Shows guest or logged‑in session state and provides navigation and logout actions.",
  "frontend/src/components/StandardPageNav.tsx": "Header navigation with back button, theme toggle, session indicator, and mobile menu controls.",
  "frontend/src/components/ThemedToaster.tsx": "Wrapper that renders the global toast component with a close button.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useCloudOperation.ts": "Hook providing a retry‑enabled cloud write helper using the current actor and identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, storing identities, and exposing login status helpers.",
  "frontend/src/hooks/useMeditationTimer.ts": "Implements a customizable meditation timer with pause/start/reset, progress tracking, and completion callbacks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating books, quotes, user profiles, journal entries, and guest/local fallback data.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, OKLCH color variables, themes, fonts, and animation utility classes.",
  "frontend/src/lib/bookData.ts": "Exports a curated list of book recommendations with metadata and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Provides structured educational content and quizzes for meditation techniques.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty or placeholder file for the Active Meditation page.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Interactive carousel page for cycling through book recommendations with swipe and button navigation.",
  "frontend/src/pages/DashboardPage.tsx": "Main user hub showing quotes, meditation options, and rituals with navigation to meditation flows.",
  "frontend/src/pages/JournalPage.tsx": "Journal management page supporting filtering, editing, favoriting, deleting, importing, and exporting entries.",
  "frontend/src/pages/KnowledgePage.tsx": "Knowledge library with technique categories, detailed content, quiz handling, and score persistence.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen providing login, guest mode, theme toggle, and redirect to dashboard when authenticated.",
  "frontend/src/pages/PreMeditationPage.tsx": "Complex setup page for configuring a meditation session, including type selection, duration, ambient sounds, guides, and recording preferences before starting the timer.",
  "frontend/src/pages/ProgressPage.tsx": "Displays user meditation progress with stats, rank visualization, and options to import/export progress data with cloud‑sync error handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty placeholder page for reflection features.",
  "frontend/src/pages/StatsPage.tsx": "Empty placeholder page for detailed stats features.",
  "frontend/src/utils/ambientSounds.ts": "Defines ambient sound metadata and helpers to fetch sound info or audio paths by ID.",
  "frontend/src/utils/cloudSync.ts": "Provides standardized cloud‑sync error types and logic to convert backend errors into user‑friendly messages.",
  "frontend/src/utils/cloudSyncRetry.ts": "Implements retry logic for cloud operations, detecting readiness and authorization errors.",
  "frontend/src/utils/exportImport.ts": "Handles serialization and validation for exporting and importing meditation data, including sessions, journals, stats, and rituals.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages local storage of quiz scores per user, with hooks for reading and updating scores.",
  "frontend/src/utils/lotusGrowthModel.ts": "Computes lotus growth visualization parameters over a 0–20,000 minute scale using phases, smooth interpolation, and layered petal opening.",
  "frontend/src/utils/meditationStorage.ts": "Manages guest-only meditation journal, progress, and ritual data in localStorage with migration and CRUD helpers.",
  "frontend/src/utils/meditationType.ts": "Validates and normalizes meditation type strings, mapping aliases and defaults to supported enum values.",
  "frontend/src/utils/progressRanks.ts": "Defines progress rank tiers by total minutes and provides helpers for retrieving current, next, and formatted ranks.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL/query/hash parameters and persisting them in sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, shadows, and plugins for typography, animations, and container queries.",
  "project_state.json": "Describes current project state, issues, and requirements, focusing on fixing authenticated ritual deletion and confirming recent UI fixes."
}