{
  "backend/main.mo": "Motoko canister defining core domain types (journals, meditation sessions, progress, users), static book recommendations, and imports for authorization and blob storage mixins to support a meditation app backend.",
  "feature_evidence.json": "Machine-readable feature evidence report describing a UI change to adjust vertical canvas rendering in ProgressBowl.tsx, including affected files, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Aggregated human-written summaries of major frontend files, outlining the purpose and behavior of pages, components, hooks, and styling for build planning.",
  "frontend/index.css": "Global Tailwind base stylesheet defining CSS variables for light and dark themes, OKLCH color tokens, chart colors, sidebar styles, and base body/border styling.",
  "frontend/index.html": "HTML entry point that sets metadata, favicon, page title, and mounts the React app via the root div and main.tsx module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router routes, React Query client, Internet Identity provider, theme handling, and global toaster notifications.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Interactive carousel for selecting and previewing looping ambient audio tracks with previous/next controls, mute toggle, and volume slider management.",
  "frontend/src/components/FeatureCard.tsx": "Reusable UI component intended to display a feature with icon, title, description, and visual effects; implementation details are not present in this file snapshot.",
  "frontend/src/components/FloatingNav.tsx": "Floating vertical navigation with animated icon buttons for Journal, Progress, and Books, including hover labels and router-based navigation.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile hamburger menu using a sheet overlay with theme toggle, authentication state, and navigation actions. Integrates Internet Identity, clears auth-related React Query caches on logout, and routes via TanStack Router.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js/react-three-fiber component that renders a 3D lotus model with petals, stem, and center glow animated according to a LotusGrowthState and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Three.js particle system that renders and animates ambient particles around the lotus, switching between chaotic and coherent motion based on growth state and theme.",
  "frontend/src/components/LotusCanvas.tsx": "Fullscreen animated canvas background rendering a glowing lotus and floating particles. Visual intensity adapts to theme, variant, and intensity props with continuous resize-aware animation.",
  "frontend/src/components/MeditationCarousel.tsx": "Circular carousel UI for selecting meditation types with animated center focus and left/right navigation. Manages selection state externally and visually emphasizes the active meditation card.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Step-by-step guided meditation component with animated transitions, dot and button navigation, and optional parsed benefits section. Handles responsive layout and directional slide animations between steps.",
  "frontend/src/components/MobileBackButton.tsx": "Fixed mobile-only back button that navigates users to the dashboard. Conditionally rendered based on a prop and styled for floating UI consistency.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-based animated progress visualization showing a glowing bowl filling with liquid based on total meditation minutes. Adjusts colors by theme and uses continuous animation with wave effects.",
  "frontend/src/components/ProgressLotusR3F.tsx": "Three.js (React Three Fiber) progress visualization rendering a 3D lotus and particles that grow based on total meditation minutes. Includes lighting, auto-rotating orbit controls, and theme-aware styling.",
  "frontend/src/components/ProgressLotusSVG.tsx": "React component that renders and animates an SVG lotus whose growth, glow, color vividness, and breathing/pulse effects are driven by total minutes, streak, theme, and a lotus growth model.",
  "frontend/src/components/QuizDialog.tsx": "Modal dialog that runs a multi-question meditation quiz, tracks answers across steps, scores them, and returns a recommended meditation type on completion.",
  "frontend/src/components/SessionIndicator.tsx": "Fixed UI indicator showing guest vs authenticated session state, with actions to return to start or log out while clearing cached authenticated queries.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor tied to the current Internet Identity, handling anonymous vs authenticated access and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context, provider, and hook to manage Internet Identity authentication using Dfinity AuthClient, including login/logout, identity persistence, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating app data (meditation types, daily quotes, sessions, progress, exports), branching behavior for authenticated users vs guests with local storage fallbacks.",
  "frontend/src/index.css": "Sets up Tailwind CSS with custom OKLCH-based light/dark theme variables, global styles, and a collection of reusable animation utilities.",
  "frontend/src/lib/bookData.ts": "Exports a static list of recommended meditation-related books with metadata and Amazon links, extending the backend Book type for frontend use.",
  "frontend/src/main.tsx": "Application entry point that initializes React, wraps the app with React Query and Internet Identity providers, and loads global styles.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Currently an empty page file, likely a placeholder for an active meditation experience.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Implements a themed, animated carousel-style UI for browsing book recommendations with navigation controls, theme toggling, and responsive desktop/mobile elements.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing a daily inspirational quote, meditation selection carousel, and navigation; handles theme toggling, session indicators, quiz flow, and routing into meditation sessions.",
  "frontend/src/pages/JournalPage.tsx": "Journal management page that lists meditation reflections with search, filters, edit/delete, favorites, mood/energy indicators, and supports import/export of meditation data.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with branding, theme toggle, and authentication entry points; redirects authenticated users to the dashboard or allows guest mode access.",
  "frontend/src/pages/PreMeditationPage.tsx": "Pre-meditation setup flow where users choose mood, energy, music, and duration, view guided steps for the selected meditation type, and record session and journal data.",
  "frontend/src/pages/ProgressPage.tsx": "Progress tracking page displaying total minutes, streaks, ranks, and visual progress, with support for exporting and importing meditation data.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty placeholder file for a reflection page; no implementation present.",
  "frontend/src/pages/StatsPage.tsx": "Empty placeholder file for a stats page; no implementation present.",
  "frontend/src/utils/lotusGrowthModel.ts": "Implements a time-based lotus growth model mapping 0–20,000 meditation minutes to detailed visual parameters (phases, petal layers, particles, glow) using smoothstep curves. Exposes a calculateLotusGrowth function returning a comprehensive LotusGrowthState for driving animations.",
  "frontend/src/utils/meditationStorage.ts": "Provides guest-only localStorage utilities for persisting meditation journal entries and progress, including legacy key migration. Includes helpers to read/write data, clear storage, and update progress metrics like streaks and total minutes after a session.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers aligned to a 0–20,000 totalMinutes scale and helper functions to derive the current rank, next rank, minutes to next rank, and formatted display strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading parameters from query strings or hash-based URLs, persisting them in sessionStorage, and clearing them when needed. Used primarily for handling sensitive or stateful parameters without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, dark mode, container settings, plugins, and an extensive OKLCH-based design token system for colors, radii, shadows, and animations.",
  "project_state.json": "High-level machine-readable snapshot of the project describing architecture, core features, and existing capabilities of the Inner Bloom meditation app. Serves as a canonical reference for build planning and feature context."
}