{
  "backend/main.mo": "Defines the canister’s core data models for books, journal entries, sessions, progress, rituals, and user profiles, plus a preset book list and migration integration.",
  "backend/migration.mo": "Contains type definitions mirroring the actor’s state and a no-op migration function that returns the existing data unchanged.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries for numerous frontend files describing their roles and behavior.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the app’s router, React Query client, theming, identity provider, and top-level page routes.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Interactive carousel for selecting ambient music with swipe navigation, volume control, and audio playback management.",
  "frontend/src/components/FeatureCard.tsx": "Empty stub; no implementation provided.",
  "frontend/src/components/FloatingNav.tsx": "Floating side navigation with animated icons, hover labels, and route navigation.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile menu sheet providing theme toggle, account actions, and navigation, with auth‑aware logout handling.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Defines the 3D lotus model with petal geometry, animated growth, breathing, and glow effects based on the lotus growth state.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Renders animated particle effects around a lotus using three.js, switching between chaotic and coherent motion based on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas-based animated lotus and particle effect responsive to theme, variant, and intensity.",
  "frontend/src/components/MeditationCarousel.tsx": "Swipeable meditation selector carousel with circular navigation and animated card positioning.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Step-by-step meditation guide with swipe navigation, transitions, and parsed content sections.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that routes to the dashboard.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered bowl visualization showing meditation minutes as an animated liquid fill, styled per theme.",
  "frontend/src/components/ProgressLotusR3F.tsx": "Renders a 3D lotus visualization using React Three Fiber, with lighting, particle effects, and growth state–driven animation.",
  "frontend/src/components/ProgressLotusSVG.tsx": "Draws an animated SVG lotus whose colors, glow, and petal motion respond to growth metrics, streaks, and breathing animations.",
  "frontend/src/components/QuizDialog.tsx": "Implements a multi‑step quiz dialog that records answers, navigates between questions, and computes a recommended meditation type.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Displays saved rituals in a swipeable or clickable carousel with support for starting or deleting rituals and confirmation dialogs.",
  "frontend/src/components/SessionIndicator.tsx": "Shows login or guest status with actions to log out or return home, clearing cached queries on logout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, handling login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useLocalStorageState.ts": "Hook for persisting a boolean state to localStorage with SSR-safe initialization.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching meditation data, handling sessions, quotes, and guest-mode fallbacks.",
  "frontend/src/index.css": "Global Tailwind-based stylesheet defining light/dark theme variables and animation utilities.",
  "frontend/src/lib/bookData.ts": "Exports static meditation book recommendations with metadata and Amazon links.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty or missing file content.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays a swipeable, circular carousel of book recommendations with theme toggle, navigation, and animated card positioning.",
  "frontend/src/pages/DashboardPage.tsx": "Shows daily quotes, meditation options, saved rituals, and navigation with theme toggling and quiz-driven recommendations.",
  "frontend/src/pages/JournalPage.tsx": "Provides journal entry browsing, filtering, editing, favoriting, deleting, and import/export of meditation data.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen with theme toggle, login via Internet Identity, guest mode, and redirect to the dashboard if authenticated.",
  "frontend/src/pages/PreMeditationPage.tsx": "Pre-meditation setup page with mood/energy inputs, ambient sound selection, detailed guides, and session/ritual saving.",
  "frontend/src/pages/ProgressPage.tsx": "React page showing meditation progress with stats, rank info, data import/export, and UI components.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty page placeholder with no implemented content.",
  "frontend/src/pages/StatsPage.tsx": "Empty page placeholder with no implemented content.",
  "frontend/src/utils/lotusGrowthModel.ts": "Implements a lotus growth visualization model mapping total meditation minutes to layered petal, glow, and particle parameters.",
  "frontend/src/utils/meditationStorage.ts": "Handles guest-mode localStorage for journal entries, progress data, rituals, and migration from legacy keys.",
  "frontend/src/utils/progressRanks.ts": "Defines meditation rank tiers and helper functions to compute current, next, and remaining minutes for ranks.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, shadows, animations, and layout with custom design tokens.",
  "project_state.json": "Tracks the project’s versioned state, describing the app’s full feature set including authentication, actor handling, secure URL‑secret flow, RBAC, blob‑storage maintenance, routing, and theming. Serves as a canonical inventory of implemented features across frontend and Motoko backend."
}