{
  "backend/main.mo": "Defines core data types for books, meditation entries, user profiles, rituals, and progress tracking in the backend canister.",
  "feature_evidence.json": "Lists feature evidence reports describing required UI changes to JournalFiltersDropdown.tsx with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of various frontend files including components, pages, hooks, styles, and config.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Runbook with step-by-step instructions for redeploying the app using DFX and pnpm.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template for diagnosing deployment failures across backend, frontend, and runtime stages.",
  "frontend/index.css": "Base Tailwind CSS setup defining light/dark theme CSS variables and global styling rules.",
  "frontend/index.html": "App HTML entrypoint with environment shims, global error handlers, and script loader for main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, error boundary, and toaster for the main app.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Interactive ambient music selector with swipe gestures, looping audio playback, volume control, and mute behavior.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches rendering errors and displays detailed error, stack trace, and a reload button.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Destructive alert banner for cloud sync issues with dynamic messages and a retry button.",
  "frontend/src/components/DurationRangeInput.tsx": "Slider-based duration selector showing current value and min/max labels.",
  "frontend/src/components/FeatureCard.tsx": "Empty file with no implementation.",
  "frontend/src/components/FloatingNav.tsx": "Floating vertical navigation menu with animated icons and hover labels using router navigation.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile sidebar menu providing theme toggle, authentication controls, and navigation using various hooks.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "Filter UI for journal entries allowing selection of moods, energy levels, dates, favorites, and text search.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Paginated content viewer with keyboard, touch swipe, and animated page transitions.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel for knowledge categories with swipe, keyboard, and circular navigation plus animated card positioning.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Modal quiz dialog that shuffles questions, tracks answers, navigates between them, and displays results.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Renders and animates a 3D lotus model whose petals, glow, and stem respond to a growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Generates and animates particle effects around the lotus, switching between chaotic and coherent motion based on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas-based animated lotus and particle background with theme- and variant-based visual intensity.",
  "frontend/src/components/MeditationCarousel.tsx": "Carousel for selecting meditation types with swipe gestures and animated card positioning.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Step-by-step meditation guide with swipe navigation, animated transitions, and optional benefits parsing.",
  "frontend/src/components/MeditationTimerRing.tsx": "Canvas-based circular meditation timer with animated wave fill, glow effects, and theme-aware colors.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Circular wave-style progress fill indicator using a canvas with animated water-like motion and theme-based coloring.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that navigates to the dashboard and optionally triggers a custom callback.",
  "frontend/src/components/PageBackgroundShell.tsx": "Layout wrapper rendering a themed LotusCanvas background behind page content.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered bowl that fills with animated liquid based on total meditation minutes and theme styling.",
  "frontend/src/components/ProgressLotusR3F.tsx": "3D lotus growth visualization using react-three-fiber with lights, particles, and growth state from total minutes.",
  "frontend/src/components/ProgressLotusSVG.tsx": "Animated SVG lotus whose petals, glow, and colors evolve from growth state, streak, theme, and subtle breathing motion.",
  "frontend/src/components/QuizDialog.tsx": "Multi-step quiz dialog that collects answers, computes a recommended meditation type, and displays results.",
  "frontend/src/components/RitualSelectionModal.tsx": "Displays a modal for selecting up to five saved rituals, handling empty states and passing actions to a carousel component.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Provides a swipeable carousel for browsing, starting, and deleting rituals with confirmation dialogs and icon mappings.",
  "frontend/src/components/SessionIndicator.tsx": "Shows login or guest status and handles logout by clearing queries and navigating to the start page.",
  "frontend/src/components/StandardPageNav.tsx": "Renders navigation controls including theme toggle, session indicator, and back buttons for desktop and mobile.",
  "frontend/src/components/ThemedToaster.tsx": "Wraps a themed toast component with a close button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCloudOperation.ts": "Provides a wrapper for cloud write operations with retry logic using the current actor and identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useMeditationTimer.ts": "Implements a customizable meditation timer hook with pause, start, reset, progress tracking, and completion callbacks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data, including books, quotes, user profiles, journal entries, and guest-mode local storage fallbacks.",
  "frontend/src/index.css": "Configures global styles, OKLCH theme variables, Tailwind layers, animations, and dark mode color definitions.",
  "frontend/src/lib/bookData.ts": "Exports a list of meditation‑related book recommendations with metadata and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Provides structured educational content for meditation techniques, including pages and quiz questions.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays swipeable book recommendation cards with theme toggle and navigation controls.",
  "frontend/src/pages/DashboardPage.tsx": "Shows daily quotes, meditation selection, and saved rituals with navigation to meditation or quiz flows.",
  "frontend/src/pages/JournalPage.tsx": "Manages journal entries with filtering, editing, favoriting, importing, and exporting features.",
  "frontend/src/pages/KnowledgePage.tsx": "Presents meditation technique content with category navigation and quiz tracking per user.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen enabling login or guest mode, auto‑redirecting authenticated users to the dashboard.",
  "frontend/src/pages/PreMeditationPage.tsx": "Large pre-meditation setup page handling timer config, ambient sound selection, mood/energy inputs, and detailed meditation guides before starting a session.",
  "frontend/src/pages/ProgressPage.tsx": "Displays user progress stats with export/import features, cloud sync error handling, and a visual progress bowl component.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/StatsPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/utils/ambientSounds.ts": "Defines ambient sound metadata and helpers to look up sound details and audio paths by ID.",
  "frontend/src/utils/cloudSync.ts": "Centralized cloud sync error definitions and logic to classify and map backend errors to user-friendly messages.",
  "frontend/src/utils/cloudSyncRetry.ts": "Provides retry logic for cloud operations, detecting readiness and authorization errors with configurable retry behavior.",
  "frontend/src/utils/exportImport.ts": "Handles serialization and validation for exporting and importing meditation data, including sessions, stats, profiles, and rituals.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages local storage of knowledge quiz scores per user or guest, with hooks for reading and saving scores.",
  "frontend/src/utils/lotusGrowthModel.ts": "Implements a multi-phase lotus growth model mapping meditation minutes to visual bloom parameters and particle effects.",
  "frontend/src/utils/meditationStorage.ts": "Provides guest-only localStorage utilities for journal entries, progress data, and rituals with legacy migration handling.",
  "frontend/src/utils/meditationType.ts": "Validates and normalizes meditation type strings, coercing invalid or alias values to supported types.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers based on total meditation minutes and helpers to get current, next, and display-ready ranks.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, shadows, radii, and enabling plugins for typography, animations, and container queries.",
  "project_state.json": "Describes current project state and requirements for fixing Journal filter layout responsiveness and overflow issues."
}