{
  "backend/main.mo": "Defines core data types and initial book list for the meditation app backend actor.",
  "feature_evidence.json": "Lists feature evidence entries mapping requested UI changes to affected files and components.",
  "frontend-file-summaries.txt": "Provides short summaries of key frontend files and recent UI/behavior updates.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Outlines step-by-step instructions for redeploying the app.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template for diagnosing and resolving deployment failures.",
  "frontend/index.css": "Defines global CSS variables and base styles including light/dark theme tokens.",
  "frontend/index.html": "HTML entry point with environment shims, global error handlers, and React mount point.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with theme and error boundary providers.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Interactive carousel for selecting ambient sounds with swipe, volume, and mute controls.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary component that catches rendering errors and displays a detailed error UI with reload option.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Banner for cloud sync/load failures that adjusts messaging by error type and provides a retry button.",
  "frontend/src/components/DurationRangeInput.tsx": "Duration slider input component for selecting a time range in minutes with live display.",
  "frontend/src/components/FeatureCard.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/FloatingNav.tsx": "Floating vertical navigation menu with animated icons and hover labels for navigating between app sections.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile slide-out menu providing theme toggle, account status, login/logout actions, and navigation.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "Filter UI for journal entries, including moods, energy, dates, favorites, and notes text with popover controls.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Page viewer for knowledge content supporting swipe, keyboard navigation, and smooth scrolling between pages.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "A swipeable and keyboard-navigable carousel that highlights a selected knowledge category with dynamic scaling and visibility logic.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "A dialog-based quiz flow with shuffled questions, progress tracking, answer persistence, and result computation.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus model that animates petals, stem, and glow based on growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Animated particle system around the lotus that changes motion patterns based on growth state and theme.",
  "frontend/src/components/LotusCanvas.tsx": "A full-screen animated canvas rendering lotus petals and particles with theme- and variant-based visibility effects.",
  "frontend/src/components/MeditationCarousel.tsx": "A swipeable carousel for selecting meditation types, using circular index logic and animated scaling for adjacent items.",
  "frontend/src/components/MeditationGuideStepper.tsx": "A step-by-step meditation guide with swipe navigation, animated transitions, and automatic parsing of benefits sections.",
  "frontend/src/components/MeditationTimerRing.tsx": "Canvas-based circular meditation timer with animated wave progress and theme-reactive colors.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Circular fill indicator using animated waves to visualize progress with theme-aware styling.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that navigates to the dashboard or triggers a custom callback.",
  "frontend/src/components/PageBackgroundShell.tsx": "Page wrapper rendering a LotusCanvas background behind provided children.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered progress bowl showing liquid fill level with wave animation and theme-based colors.",
  "frontend/src/components/ProgressLotusR3F.tsx": "Three.js lotus visualization showing growth state, lighting, particles, and auto-rotating camera.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG lotus visualization with layered petals, glow, breathing animation, and streak-based effects.",
  "frontend/src/components/QuizDialog.tsx": "Multi-step quiz dialog collecting answers and computing a recommended meditation type.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal that displays up to five saved rituals, allowing users to start or delete one, with an empty-state message when none exist.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel for browsing, starting, and deleting rituals with swipe, navigation, and confirmation dialog support.",
  "frontend/src/components/SessionIndicator.tsx": "Displays login state and provides guest return or logout actions while clearing cached user queries.",
  "frontend/src/components/StandardPageNav.tsx": "Navigation bar with session indicator, theme toggle, and optional back button for both desktop and mobile.",
  "frontend/src/components/ThemedToaster.tsx": "Wraps the Sonner toaster component with a container element for themed notifications.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useCloudOperation.ts": "Hook providing retry-enabled cloud write operations using the current actor and identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, session state, and AuthClient setup.",
  "frontend/src/hooks/useMeditationTimer.ts": "Implements a customizable meditation timer with pause, reset, progress tracking, and completion callbacks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating books, profiles, journals, and guest/local storage data.",
  "frontend/src/index.css": "Sets global styles, themes, and Tailwind utilities including animations and OKLCH color variables.",
  "frontend/src/lib/bookData.ts": "Exports a list of meditation-related book recommendations with Amazon links and metadata.",
  "frontend/src/lib/knowledgeContent.ts": "Provides structured educational content for meditation techniques, including pages and quiz questions.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty or placeholder page file for the active meditation screen.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays book recommendations with swipe and button navigation, cycling through cards and handling theme and empty states.",
  "frontend/src/pages/DashboardPage.tsx": "Shows the main dashboard with quotes, meditation selection, rituals, and navigation to pre‑meditation or quizzes.",
  "frontend/src/pages/JournalPage.tsx": "Manages viewing, filtering, editing, favoriting, importing, and exporting journal entries with authenticated and guest modes.",
  "frontend/src/pages/KnowledgePage.tsx": "Renders a knowledge library with technique categories, book content, quiz handling, and deep‑link scrolling.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen handling login, guest mode, theme toggle, and redirecting authenticated users to the dashboard.",
  "frontend/src/pages/PreMeditationPage.tsx": "A complex pre-meditation setup page allowing users to configure meditation type, duration, ambient sound, and mood before starting a session, with detailed guide steps and cloud-sync interactions.",
  "frontend/src/pages/ProgressPage.tsx": "Displays meditation progress stats with import/export functionality, cloud sync error handling, and visual progress components.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty file placeholder for the reflection page.",
  "frontend/src/pages/StatsPage.tsx": "Empty file placeholder for the stats page.",
  "frontend/src/utils/ambientSounds.ts": "Defines ambient sound metadata and provides helpers to fetch sound info and audio paths by ID.",
  "frontend/src/utils/cloudSync.ts": "Maps backend cloud-sync errors to user-friendly messages and classifies various error types.",
  "frontend/src/utils/cloudSyncRetry.ts": "Provides retry logic for cloud operations, detecting readiness and authorization errors.",
  "frontend/src/utils/exportImport.ts": "Handles serialization, validation, and normalization of meditation-related data for export/import JSON files.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages quiz score storage per user using localStorage with utilities to get and save scores.",
  "frontend/src/utils/lotusGrowthModel.ts": "Computes lotus growth visuals over 0–20,000 minutes, determining phase, progress, and multiple visual parameters for rendering.",
  "frontend/src/utils/meditationStorage.ts": "Handles guest-only localStorage for journal entries, progress data, rituals, and legacy key migration.",
  "frontend/src/utils/meditationType.ts": "Validates and normalizes meditation type strings, mapping aliases and defaults to supported enum values.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers based on total meditated minutes and provides helpers to get current, next, and formatted ranks.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, layout, shadows, and enabling plugins like typography and container queries.",
  "project_state.json": "Tracks project state, features, and pending UI polish requests for pre‑meditation and in‑session views."
}