{
  "backend/main.mo": "Defines the backend actor with data models for books, meditation sessions, journal entries, user profiles, rituals, and progress tracking, plus static book data.",
  "feature_evidence.json": "Contains feature evidence metadata listing feature IDs, descriptions, affected files, components, and test IDs for UI modifications.",
  "frontend-file-summaries.txt": "Provides short summaries of key frontend files describing their roles, behaviors, and recent updates.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Runbook with step-by-step instructions for redeploying the app using DFX and pnpm.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template for diagnosing deployment failures across install, backend, build, and runtime stages.",
  "frontend/index.css": "Tailwind base/theme configuration defining OKLCH color variables, dark mode variants, and global styling.",
  "frontend/index.html": "App HTML entry point with environment shims, global error handlers, and the root mount element.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, theme provider, error boundary, and global toaster.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel for choosing ambient sound options with swipe/arrow navigation and audio playback with mute and volume control.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays a detailed error screen with message, stack trace, and a reload button.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Destructive alert banner showing cloud sync/load failures with a retry button and loading state.",
  "frontend/src/components/FeatureCard.tsx": "Empty placeholder component file.",
  "frontend/src/components/FloatingNav.tsx": "Floating vertical navigation bar with animated icons that navigate to journal, progress, books, and knowledge pages.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile slide‑out menu providing theme toggle, account controls, navigation actions, and logout behavior integrated with Internet Identity.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Paged book-like viewer supporting swipe, keyboard navigation, and automatic scrolling between text pages.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel for selecting knowledge categories with swipe and key navigation and animated center-focused item display.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "A dialog-based quiz component that shuffles questions, tracks answers and navigation, and displays results with score reporting.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "R3F lotus model that animates petals, stem, and glow based on growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "R3F particle system orbiting or drifting around the lotus depending on growth state coherence.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas animation rendering lotus petals and particles with theme- and variant-based visibility adjustments and breathing effects.",
  "frontend/src/components/MeditationCarousel.tsx": "Swipeable and button-controlled carousel showing meditation types with centered scaling and visibility logic.",
  "frontend/src/components/MeditationGuideStepper.tsx": "A step-by-step meditation guide with swipe navigation, dot indicators, and parsed content including optional benefits.",
  "frontend/src/components/MeditationTimerRing.tsx": "Canvas-based animated timer ring that visualizes progress with themed colors, wave effects, and a glowing edge.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Canvas component rendering an animated circular water-fill indicator with easing based on progress and theme colors.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only button that navigates back to the dashboard when visible.",
  "frontend/src/components/PageBackgroundShell.tsx": "Wrapper providing a full-page background with a LotusCanvas effect and optional variants.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered bowl graphic that fills with animated liquid based on total meditation minutes and theme.",
  "frontend/src/components/ProgressLotusR3F.tsx": "Three.js lotus visualization showing growth state with lighting, particles, and auto-rotating controls.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG lotus visualization with animated breathing, glow, and layer openness derived from growth state and streak.",
  "frontend/src/components/QuizDialog.tsx": "Multi-step quiz dialog capturing user answers and computing a recommended meditation type.",
  "frontend/src/components/RitualSelectionModal.tsx": "Dialog listing up to five saved rituals with options to start or delete via a carousel interface.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel for navigating, starting, and deleting saved rituals with swipe and dialog support.",
  "frontend/src/components/SessionIndicator.tsx": "Displays login state and provides navigation and logout actions, clearing related queries on logout.",
  "frontend/src/components/StandardPageNav.tsx": "Navigation bar offering theme toggle, back buttons, session indicator, and mobile menu integration.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for Internet Identity authentication, loading stored identities and handling login/logout.",
  "frontend/src/hooks/useMeditationTimer.ts": "Provides a meditation timer hook with pause, seek, progress tracking, and completion handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for meditation types, daily quotes, and guest data with mock fallbacks and local storage utilities.",
  "frontend/src/index.css": "Configures global Tailwind styles, theme variables, and animation utilities for light and dark modes.",
  "frontend/src/lib/bookData.ts": "Exports an extended book type and a static list of recommended meditation-related books with Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Contains structured educational content for meditation techniques, including pages and quiz questions.",
  "frontend/src/main.tsx": "Initializes the app with React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Implements a swipeable, theme-aware carousel UI for browsing meditation book recommendations.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with quotes, rituals, quiz flow, theme toggle, and navigation into pre‑meditation sessions. Manages ritual actions, quote selection, and UI modals.",
  "frontend/src/pages/JournalPage.tsx": "Provides a searchable, filterable journal with editing, deleting, favoriting, import/export, and cloud‑synced entry mutations. Handles inline editing and confirmation dialogs.",
  "frontend/src/pages/KnowledgePage.tsx": "Displays meditation knowledge content with category navigation, scroll handling, and quiz scoring tied to user identity. Loads and persists quiz results per technique.",
  "frontend/src/pages/LandingPage.tsx": "Shows the public landing screen with theme toggle, animated background, and login or guest navigation. Redirects authenticated users to the dashboard.",
  "frontend/src/pages/PreMeditationPage.tsx": "Configures a meditation session with timers, mood/energy inputs, music selection, guides, and journal/ritual creation. Manages session state and navigation into the meditation flow.",
  "frontend/src/pages/ProgressPage.tsx": "Renders the progress page showing stats, rank, and a bowl visualization, with import/export handlers and cloud sync error handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty placeholder file for the reflection page.",
  "frontend/src/pages/StatsPage.tsx": "Empty placeholder file for the stats page.",
  "frontend/src/utils/cloudSync.ts": "Provides cloud sync error mappings, helper functions to derive user-friendly messages, and readiness checks for actor and identity.",
  "frontend/src/utils/exportImport.ts": "Defines export/import JSON formats and functions to serialize backend data and validate/deserialize imported files.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages quiz score storage per principal ID with localStorage and exposes a hook for reading and saving scores.",
  "frontend/src/utils/lotusGrowthModel.ts": "Computes lotus growth visualization parameters based on total meditation minutes using phased thresholds and smooth interpolation.",
  "frontend/src/utils/meditationStorage.ts": "Handles guest-only localStorage for journal entries, progress data, and rituals, including legacy migration and CRUD operations.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers for meditation minutes and provides helpers to determine current rank, next rank, and minutes until rank up.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), store/retrieve them in sessionStorage, and sync or clear them as needed.",
  "frontend/tailwind.config.js": "TailwindCSS config extending colors, container settings, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines current project state, including feature requirements for compacting and centering meditation UI controls."
}