{
  "backend/main.mo": "Defines data models and initial book list for meditation, journaling, progress tracking, and user profiles within the main backend actor.",
  "feature_evidence.json": "Lists implemented features with associated files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Provides short descriptions of key frontend files and their roles in the app’s UI, routing, and logic.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Explains required tools and steps for redeploying the frontend and backend without code changes.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template for diagnosing deployment issues across install, build, deploy, and runtime stages.",
  "frontend/index.css": "Defines root theme variables, dark mode overrides, and Tailwind base styles for app theming.",
  "frontend/index.html": "HTML entry point with a shim for process.env and global error handlers before loading the React bundle.",
  "frontend/src/App.tsx": "Sets up app-wide providers and TanStack Router routes for all main pages.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel component offering ambient sound selection with audio playback, swipe navigation, and volume control.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that captures exceptions, logs details, and displays a full‑screen error UI with reload option.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Destructive alert banner showing sync/load errors with a retry button and loading state.",
  "frontend/src/components/FeatureCard.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/FloatingNav.tsx": "Floating vertical nav bar with hover labels and navigation to core app sections.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile sidebar menu providing theme toggle, auth state handling, navigation, and logout logic.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Paginated book-style content viewer with swipe, keyboard navigation, animated transitions, and auto-scroll.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Circular carousel for selecting knowledge categories with swipe and keyboard navigation.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Quiz dialog presenting shuffled questions with progress, back/next navigation, scoring, and results display.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus flower model that animates petals, glow, and stem based on growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Three.js particle system that animates chaotic or coherent particle motion around the lotus depending on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas-based particle and lotus animation that adapts visibility and glow effects based on theme, variant, and intensity.",
  "frontend/src/components/MeditationCarousel.tsx": "Swipeable carousel for selecting meditation types with centered scaling, circular navigation, and touch controls.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Step-by-step meditation guide with swipe navigation, animated transitions, and optional benefits parsing.",
  "frontend/src/components/MeditationTimerRing.tsx": "Animated circular progress ring using canvas with wave effects, glow, and theme‑adaptive colors.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Canvas-based vertical fill indicator with animated waves and smooth progress interpolation.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that navigates to the dashboard.",
  "frontend/src/components/PageBackgroundShell.tsx": "Page wrapper that renders a themed LotusCanvas background behind its children.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-based animated bowl visual that fills proportionally to totalMinutes with theme-based colors and glow effects.",
  "frontend/src/components/ProgressLotusR3F.tsx": "Three.js lotus visualization that adjusts model and particles based on growthState and supports orbit rotation.",
  "frontend/src/components/ProgressLotusSVG.tsx": "Animated SVG lotus whose petals, glow, and colors react to totalMinutes, streak, and theme using a growth model.",
  "frontend/src/components/QuizDialog.tsx": "Five‑question quiz dialog that collects user answers and computes a recommended meditation type.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal listing up to five saved rituals with a carousel for starting or deleting them.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Swipeable carousel for browsing, launching, and deleting saved rituals with icons and confirm dialogs.",
  "frontend/src/components/SessionIndicator.tsx": "UI indicator showing guest or authenticated state with actions to return home or log out.",
  "frontend/src/components/StandardPageNav.tsx": "Navigation component providing theme toggle, back button, session indicator, and mobile menu elements with mount-aware rendering.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hook for managing Internet Identity authentication, loading stored identity, login, logout, and status tracking.",
  "frontend/src/hooks/useMeditationTimer.ts": "Timer hook for meditation sessions handling countdown, pause, seeking, and completion callbacks.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for meditation data, supporting guest storage, backend calls, and mock fallbacks.",
  "frontend/src/index.css": "Defines global Tailwind layers, light/dark OKLCH color variables, base styles, and custom animation utilities.",
  "frontend/src/lib/bookData.ts": "Exports a typed list of book recommendations with titles, descriptions, tags, icons, and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Defines interfaces and structured content for meditation techniques, including pages of text and quiz questions.",
  "frontend/src/main.tsx": "Initializes React app root with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty page placeholder with no implementation.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays a swipeable carousel of book recommendations with theme toggling and navigation controls.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with quotes, meditation selection, rituals, quiz dialog, and theme controls.",
  "frontend/src/pages/JournalPage.tsx": "Renders the journal list with search, filtering, editing, deletion, favorite toggling, and import/export actions using query hooks.",
  "frontend/src/pages/KnowledgePage.tsx": "Displays meditation knowledge content with category navigation, deep-link scrolling, theme toggle, and quiz functionality.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen with theme toggle, login flow via Internet Identity, guest mode, and redirect logic for authenticated users.",
  "frontend/src/pages/PreMeditationPage.tsx": "Pre-meditation setup page for selecting mood, energy, guidance, music, and recording meditation sessions and journal entries.",
  "frontend/src/pages/ProgressPage.tsx": "Shows user progress, ranks, streaks, and stats with a progress bowl visualization plus data import/export handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/StatsPage.tsx": "Empty file with no implemented content.",
  "frontend/src/utils/cloudSync.ts": "Defines standardized cloud sync error codes and maps backend errors to user-friendly messages, plus readiness checks for actor and identity.",
  "frontend/src/utils/exportImport.ts": "Handles serialization and deserialization of backend data to a safe JSON export/import format, including version checks and bigint-safe conversions.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages quiz score storage in localStorage per principal, with hooks for retrieving and saving scores.",
  "frontend/src/utils/lotusGrowthModel.ts": "Computes lotus growth visualization parameters based on total meditation minutes using phased thresholds and smooth interpolation.",
  "frontend/src/utils/meditationStorage.ts": "Provides guest-only localStorage handling for journal entries, progress data, and rituals with legacy key migration.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers mapped to total meditation minutes and utilities for retrieving current, next, and display-ready rank info.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning sensitive params from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom color palette using OKLCH variables, extended shadows, radii, and plugin setup. It defines content paths, container settings, and extensive theme extensions.",
  "project_state.json": "Stores project metadata for a meditation app, including features, new requests, and project state versioning. Tracks requirements for a back button and an animated wave-style timer indicator."
}