{
  "backend/main.mo": "Motoko canister defining core domain models (users, journals, meditation sessions, progress, books) and initializing static book recommendations, with imports for authorization and blob storage mixins.",
  "feature_evidence.json": "Machine-readable report listing verified frontend features, affected files, dependencies, test IDs, and confidence for recent UI fixes on the active meditation timer screen.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of major frontend source files and components, used as reference documentation for build and feature planning.",
  "frontend/index.css": "Global Tailwind base styles and CSS variables defining light/dark theme color tokens, layout primitives, and default background/foreground styling.",
  "frontend/index.html": "HTML entry point that sets metadata, favicon, viewport, and mounts the React app at the root div.",
  "frontend/src/App.tsx": "Main React application bootstrap configuring TanStack Router routes, React Query client, Internet Identity provider, theme handling, and global toaster notifications.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Interactive carousel component for selecting looping ambient audio tracks with previous/next navigation, mute toggle, and volume control synced to an Audio element.",
  "frontend/src/components/FeatureCard.tsx": "Reusable UI card component for displaying a feature’s icon, title, and description with animation and hover styling.",
  "frontend/src/components/FloatingNav.tsx": "Fixed floating navigation with animated icon buttons for Journal, Progress, and Books pages, showing labels on hover and routing via TanStack Router.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile-only slide-out hamburger menu that provides theme toggling, account status, navigation, and login/logout actions, integrating Internet Identity, routing, and React Query cache cleanup.",
  "frontend/src/components/LotusCanvas.tsx": "Full-screen animated canvas background that renders a breathing lotus and floating particles, adapting visibility and glow based on theme and a \"default\" or \"enhanced\" variant.",
  "frontend/src/components/MeditationCarousel.tsx": "Circular carousel UI for selecting meditation types, showing one centered card with adjacent previews and navigation controls to cycle through predefined meditation options.",
  "frontend/src/components/MobileBackButton.tsx": "Conditional mobile-only floating back button that navigates the user back to the dashboard route when visible.",
  "frontend/src/components/QuizDialog.tsx": "Multi-step modal quiz that asks users meditation-related questions, tracks answers, calculates a recommended meditation type, and returns the result via a callback.",
  "frontend/src/components/SessionIndicator.tsx": "Fixed session status badge showing whether the user is logged in or exploring as a guest, with actions to return to start or log out and clear authenticated query data.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor using React Query based on the current Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context, provider, and hook for Internet Identity authentication, managing login/logout, identity persistence, and login status using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating meditation-related data, branching between authenticated backend calls and guest local storage, with mock data where backend APIs are missing.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light and dark theme variables, custom color tokens, fonts, and base styles for the application.",
  "frontend/src/lib/bookData.ts": "Exports a static list of meditation and mindfulness book recommendations with metadata and Amazon links, extending the backend Book type.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and InternetIdentity providers and importing global styles.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty placeholder file for the Active Meditation page with no implementation yet.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Implements a themed, animated book recommendation carousel page with navigation, theme toggling, and UI controls using static book data.",
  "frontend/src/pages/DashboardPage.tsx": "Main user dashboard that displays a daily inspirational quote, meditation selection carousel, and navigation elements. Handles theme toggling, quiz-based recommendations, and routing into pre-meditation flows.",
  "frontend/src/pages/JournalPage.tsx": "Journal management page for viewing, filtering, editing, favoriting, deleting, and importing/exporting meditation reflections. Includes mood and energy indicators, search and filters, and full CRUD interactions via query hooks.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page that introduces the app and handles authentication or guest entry. Redirects authenticated users to the dashboard and supports theme toggling.",
  "frontend/src/pages/PreMeditationPage.tsx": "Pre-session setup page that guides users through meditation instructions, mood and energy selection, ambient music, and session controls. Records meditation sessions and optionally saves journal reflections.",
  "frontend/src/pages/ProgressPage.tsx": "Progress tracking page showing meditation statistics, streaks, ranks, and achievements. Supports importing/exporting meditation data and displays rank progression based on total minutes.",
  "frontend/src/pages/ReflectionPage.tsx": "File is present but contains no implementation, indicating a placeholder or unfinished reflection page.",
  "frontend/src/pages/StatsPage.tsx": "File is present but empty, suggesting a planned statistics page that has not yet been implemented.",
  "frontend/src/utils/meditationStorage.ts": "Provides guest-only localStorage utilities for storing meditation journal entries and progress, including legacy key migration, CRUD helpers, and streak/minute updates after sessions.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read URL parameters from query strings or hash routing, persist them in sessionStorage, and safely clear stored or hash parameters for session-level state like tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, dark mode strategy, plugins, and an extensive theme extension with OKLCH-based color tokens, layout settings, shadows, animations, and design tokens.",
  "project_state.json": "Project metadata describing the current SPA scope, architecture, and feature set, including authentication, guest mode, dashboards, meditation flows, theming, and versioned feature definitions."
}