{
  "backend/main.mo": "Defines meditation app backend actor with data types for books, journal entries, sessions, rituals, user profiles, and progress tracking plus initial book list.",
  "feature_evidence.json": "Lists two theming-related features, their affected files, components, tests, and confidence metadata for build verification.",
  "frontend-file-summaries.txt": "Contains a map of frontend file paths to brief functional summaries for reference during development.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Provides step‑by‑step instructions for redeploying the frontend and backend without code changes.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template for diagnosing deployment failures across install, backend, build, and runtime stages.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH theme variables for light and dark modes plus global resets.",
  "frontend/index.html": "HTML entry file setting up the root app container, favicon, env shim, and global error handlers.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with theme provider, error boundary, and toaster.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Audio carousel component allowing selection, preview, mute, volume control, and swipe navigation for ambient sounds.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and renders a detailed fallback UI with error info and reload button.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Displays an error banner for cloud sync issues with dynamic messaging and a retry button.",
  "frontend/src/components/DurationRangeInput.tsx": "Slider-based input for selecting a duration in minutes with min/max limits.",
  "frontend/src/components/FeatureCard.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/FloatingNav.tsx": "Floating vertical navigation bar with animated icons and hover labels that routes between app sections.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile sidebar menu providing theme toggle, account actions, and navigation, integrated with authentication state.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "Popover-based filter UI for journal entries allowing mood, energy, date, favorites, and text filtering.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Paginated reader component supporting swipe, keyboard navigation, and smooth scrolling between content pages.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel component for selecting knowledge categories with swipe, keyboard, and button navigation and dynamic positioning of items.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Modal dialog presenting a shuffled multiple‑choice quiz with progress tracking, navigation, scoring, and retake functionality.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus model that animates petals, glow, and stem based on growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Animated particle system around the lotus that shifts between chaotic and coherent motion depending on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas-based animated lotus and particle effect responsive to theme, variant, and intensity settings.",
  "frontend/src/components/MeditationCarousel.tsx": "Carousel for choosing meditation types with swipe navigation and center‑focused scaling transitions.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Stepper UI for guided meditation steps with swipe navigation, dot indicators, and optional benefits parsing.",
  "frontend/src/components/MeditationTimerRing.tsx": "Canvas-based circular timer ring with animated wave fill, glow effects, and theme-aware colors.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Canvas indicator showing vertical wave-based fill animation inside a clipped circle, reacting to progress and theme.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that triggers an optional callback and navigates to the dashboard.",
  "frontend/src/components/PageBackgroundShell.tsx": "Page wrapper that renders a LotusCanvas background behind provided children with variant and intensity options.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered bowl showing liquid fill level with glow and wave animation based on total meditation minutes and theme.",
  "frontend/src/components/ProgressLotusR3F.tsx": "Three.js/React-Fiber lotus visualization with lights, particles, and auto-rotating camera driven by growth state.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG lotus with animated breathing, glow, and layered petals whose appearance is based on growth state and streak.",
  "frontend/src/components/QuizDialog.tsx": "Multi-step quiz dialog that collects answers, scores meditation types, and returns a recommended type.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal that displays up to five saved rituals and allows starting or deleting them, showing an empty state when none exist.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel UI for browsing, starting, and deleting rituals with swipe navigation, confirmation dialogs, and dynamic icons.",
  "frontend/src/components/SessionIndicator.tsx": "Displays guest or logged‑in session status and provides logout or return‑to‑start actions with query cleanup.",
  "frontend/src/components/StandardPageNav.tsx": "Navigation bar with theme toggle, session indicator, optional back button, and mobile menu integration.",
  "frontend/src/components/ThemedToaster.tsx": "Wrapper that renders a themed Toaster component with a close button.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCloudOperation.ts": "Hook providing a retry‑aware wrapper for cloud write operations using the current actor and identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing login state and identity helpers.",
  "frontend/src/hooks/useMeditationTimer.ts": "Implements a configurable meditation timer hook with start, pause, reset, progress tracking, and completion callbacks.",
  "frontend/src/hooks/useQueries.ts": "Wraps React Query hooks for fetching and mutating backend data, supporting authenticated and guest modes with local storage fallbacks.",
  "frontend/src/index.css": "Defines global styles, theme variables, Tailwind layers, and custom animations for the frontend UI.",
  "frontend/src/lib/bookData.ts": "Exports a list of meditation‑related book recommendations with metadata and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Provides structured educational content and quizzes for meditation techniques.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty or placeholder file for the Active Meditation page.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Carousel page displaying book recommendations with swipe navigation and theme controls.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing quotes, meditation selection, rituals, and navigation to meditation flows.",
  "frontend/src/pages/JournalPage.tsx": "Journal management page handling filtering, editing, favoriting, import/export, and cloud sync states.",
  "frontend/src/pages/KnowledgePage.tsx": "Knowledge library with technique categories, content display, and quiz scoring tied to identity.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen with login, guest mode, theme toggle, and redirect logic for authenticated users.",
  "frontend/src/pages/PreMeditationPage.tsx": "Page component for configuring a meditation session, selecting type, duration, ambient sound, mood, and saving rituals before starting the timer.",
  "frontend/src/pages/ProgressPage.tsx": "Displays meditation progress stats, bowl visualization, rank, and supports data import/export with cloud sync error handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty placeholder page for reflections.",
  "frontend/src/pages/StatsPage.tsx": "Empty placeholder page for stats.",
  "frontend/src/utils/ambientSounds.ts": "Defines ambient sound metadata and helpers to retrieve sound info or paths by ID.",
  "frontend/src/utils/cloudSync.ts": "Provides cloud sync error definitions and a function to map backend errors to user-friendly messages.",
  "frontend/src/utils/cloudSyncRetry.ts": "Implements retry logic for cloud operations, classifying authorization vs readiness errors.",
  "frontend/src/utils/exportImport.ts": "Handles serialization and validation for exporting and importing meditation data in a safe JSON format.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages quiz score storage per user, with localStorage persistence and identity-aware retrieval.",
  "frontend/src/utils/lotusGrowthModel.ts": "Computes lotus growth state parameters over a 0–20,000 minute timeline with phased progression and smooth visual transitions.",
  "frontend/src/utils/meditationStorage.ts": "Manages guest-only meditation data in localStorage, including journals, progress, rituals, and legacy migration.",
  "frontend/src/utils/meditationType.ts": "Validates and normalizes meditation type strings to supported enum values with fallback handling.",
  "frontend/src/utils/progressRanks.ts": "Defines progress rank tiers and utility functions for determining current, next, and displayable rank data based on total minutes.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, radii, and plugins using OKLCH-based theme variables.",
  "project_state.json": "Describes project state and requirements for restoring global OKLCH theme variables in light and dark modes."
}