{
  "backend/main.mo": "Defines data types and initial book list for a meditation app backend actor, including journal entries, profiles, sessions, progress, and rituals.",
  "feature_evidence.json": "Contains feature evidence records mapping feature requests to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, pages, hooks, and config files.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Step‑by‑step instructions for redeploying the app, listing prerequisites and standard deployment steps.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Troubleshooting template for diagnosing deployment failures across install, backend, build, and runtime stages.",
  "frontend/index.css": "Defines global Tailwind-based CSS variables, themes, and base styling for light and dark modes.",
  "frontend/index.html": "Base HTML file setting up favicon, error handlers, environment shims, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all main pages and wraps the app in theme and error boundary providers.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Interactive carousel for selecting ambient audio with swipe navigation, volume control, and preview playback logic.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches UI errors and displays a detailed error screen with message, stack trace, and reload button.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Destructive alert banner for cloud sync/load errors with retry button and optional loading state.",
  "frontend/src/components/FeatureCard.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/FloatingNav.tsx": "Floating vertical nav bar with animated icons that navigate to journal, progress, books, and knowledge pages.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile slide-out menu offering theme toggling, authentication actions, and navigation, integrated with Internet Identity.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Paginated reader for knowledge pages with swipe, arrow key, and button navigation plus automatic scrolling.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel selector for knowledge categories with touch, keyboard, and circular navigation plus animated scaling.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Quiz dialog that shuffles questions, tracks answers, shows progress, and displays results with retake option.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus model that animates petals, glow, and bloom behavior based on a growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Three.js particle system that animates particles around the lotus with coherent or chaotic motion based on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Draws animated lotus petals and particles on a canvas with theme- and variant-based visibility effects.",
  "frontend/src/components/MeditationCarousel.tsx": "Carousel UI for selecting meditation types with swipe, button navigation, and centered card scaling.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Step-by-step meditation guide with swipe navigation, animations, and parsed content sections.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that navigates users to the dashboard.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered bowl showing meditation progress as animated liquid fill with glow effects.",
  "frontend/src/components/ProgressLotusR3F.tsx": "3D lotus visualization using React Three Fiber, with lighting, particles, and growth-state animation.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG-based animated lotus showing growth, glow, and breathing effects driven by total minutes and streak.",
  "frontend/src/components/QuizDialog.tsx": "Interactive multi-question quiz dialog that collects user answers and computes a recommended meditation type.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal that displays up to five saved rituals and allows users to start or delete them.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel UI for browsing, starting, and deleting saved meditation rituals with swipe and delete confirmation handling.",
  "frontend/src/components/SessionIndicator.tsx": "Session status indicator that shows guest or logged-in state and provides navigation and logout actions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to the current identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for meditation data, daily quotes, session recording, and guest vs authenticated branching, including mock meditation types and cloud-sync handling.",
  "frontend/src/index.css": "Configures Tailwind base styles, OKLCH color themes for light and dark modes, and custom animation utility classes.",
  "frontend/src/lib/bookData.ts": "Exports a list of recommended meditation-related books with metadata and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Provides structured multimedia content for meditation techniques, including descriptions, pages, and quizzes.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty or missing implementation.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays swipeable book recommendation cards with theme toggle and navigation, handling circular indexing and touch gestures.",
  "frontend/src/pages/DashboardPage.tsx": "Shows daily quotes, meditation options, rituals, and session UI with theme toggling and CRUD actions for rituals.",
  "frontend/src/pages/JournalPage.tsx": "Manages journal entries with search, filters, editing, mood/energy icons, and import/export plus cloud sync actions.",
  "frontend/src/pages/KnowledgePage.tsx": "Renders meditation knowledge categories, book content, quizzes, and deep-link scrolling with category state handling.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen with theme toggle, login via Internet Identity, guest mode, and automatic redirect for authenticated users.",
  "frontend/src/pages/PreMeditationPage.tsx": "Page for configuring a meditation session with guides, mood/energy inputs, ambient audio, and journal/ritual saving.",
  "frontend/src/pages/ProgressPage.tsx": "Displays meditation progress stats, rank info, and supports data export/import with cloud sync handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty page placeholder for reflection features.",
  "frontend/src/pages/StatsPage.tsx": "Empty page placeholder for statistics features.",
  "frontend/src/utils/cloudSync.ts": "Utility for checking cloud sync readiness, waiting with retries, and mapping backend errors to user-friendly messages.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Local storage handlers for saving and retrieving quiz scores, with identity-aware keying and a React hook wrapper.",
  "frontend/src/utils/lotusGrowthModel.ts": "Calculates lotus growth visualization parameters based on total meditation minutes across multiple phases.",
  "frontend/src/utils/meditationStorage.ts": "Manages guest-only local storage for journal entries, progress data, rituals, and migrates legacy keys.",
  "frontend/src/utils/progressRanks.ts": "Defines meditation rank tiers and helpers for determining current/next rank and minutes until advancement.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL params (including hash), storing them in sessionStorage, and managing persistence and cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, shadows, radii, and enabling plugins for typography, animations, and container queries.",
  "project_state.json": "Project metadata describing issues and features related to routing the Pre-Meditation page’s “More details” button to the correct Knowledge category."
}