{
  "backend/main.mo": "Defines backend actor types for books, meditation data, journal entries, user profiles, and rituals, and initializes a static list of book recommendations.",
  "feature_evidence.json": "Lists feature evidence records mapping feature IDs to affected frontend files, components, and test IDs for build planning.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of many frontend source files describing their purpose and recent changes.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Runbook outlining prerequisites and step-by-step commands for redeploying the frontend and backend.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template-based guide for diagnosing deployment failures across build and deploy stages.",
  "frontend/index.css": "Global Tailwind and theme variable definitions for light and dark modes using OKLCH color values.",
  "frontend/index.html": "Base HTML template initializing global error handlers and loading the React app entry point.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app in theme and error boundary providers.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel UI for selecting ambient sounds with audio preview, swipe gestures, and volume/mute controls.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a detailed fallback UI with error info and a reload button.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Displays an error banner for cloud sync issues with context‑aware messages and a retry button.",
  "frontend/src/components/DurationRangeInput.tsx": "A slider-based input for selecting a duration in minutes with configurable bounds.",
  "frontend/src/components/FeatureCard.tsx": "Empty placeholder component file.",
  "frontend/src/components/FloatingNav.tsx": "Floating sidebar navigation with animated icons that route to different app sections.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile slide‑out menu providing theme toggle, authentication controls, and navigation actions.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "Popover UI allowing filtering journal entries by favorites, mood, energy, dates, and text.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Swipeable paginated viewer for knowledge pages with keyboard, touch, and animated transitions.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel for knowledge categories with swipe, keyboard, and circular navigation, showing center, adjacent, and hidden items with dynamic transforms.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Quiz dialog that shuffles questions, tracks answers, supports navigation, and computes results before calling onComplete.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus model that animates petals, stem, and center glow based on a growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Particle system around the lotus that animates chaotic or coherent motion depending on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas-based animated lotus with particles, glow, and theme-dependent visibility, updating on resize and running a continuous render loop.",
  "frontend/src/components/MeditationCarousel.tsx": "Meditation selector carousel with swipe and circular navigation, rendering centered, adjacent, and hidden cards.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Stepper for meditation steps with swipe navigation, dot controls, and parsing of content into main text and benefits.",
  "frontend/src/components/MeditationTimerRing.tsx": "Canvas-based circular timer ring with animated wave progress and theme-aware colors.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Canvas component showing a circular filling animation with dynamic waves based on progress and theme.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that navigates to the dashboard and supports a custom back handler.",
  "frontend/src/components/PageBackgroundShell.tsx": "Wrapper that renders a full-page background using LotusCanvas behind page content.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered bowl visualization that fills and animates based on total meditation minutes and theme.",
  "frontend/src/components/ProgressLotusR3F.tsx": "Three.js canvas rendering a 3D lotus model and particles whose growth depends on total meditation minutes.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG lotus that animates growth, breathing, and glow effects based on total minutes, streak, and theme.",
  "frontend/src/components/QuizDialog.tsx": "Modal quiz flow with five questions that computes and returns a recommended meditation type.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal that displays a carousel of saved rituals and lets the user select or delete a ritual.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel UI for browsing, selecting, and deleting saved rituals with confirmation handling and animated transitions.",
  "frontend/src/components/SessionIndicator.tsx": "Shows login/guest status and provides logout or return-to-start actions, clearing cached queries on logout.",
  "frontend/src/components/StandardPageNav.tsx": "Navigation bar with session indicator, theme toggle, back button, and mobile menu integration.",
  "frontend/src/components/ThemedToaster.tsx": "Wrapper component rendering a themed toast notification container.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useCloudOperation.ts": "Hook providing a retry-enabled cloud write operation using the current actor and identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, storing identity state, and exposing login status helpers.",
  "frontend/src/hooks/useMeditationTimer.ts": "Implements a customizable countdown meditation timer with pause, reset, progress tracking, and completion callbacks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as books, quotes, user profiles, and journal entries with guest-mode fallbacks.",
  "frontend/src/index.css": "Configures global Tailwind styles, theme variables, custom animations, and typography for the app.",
  "frontend/src/lib/bookData.ts": "Exports a list of recommended meditation-related books with descriptions and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Contains structured educational content and quizzes for various meditation techniques.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty or placeholder file for the Active Meditation page component.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays book recommendations with swipe and button navigation, handling dynamic positioning of cards and empty states.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard for selecting meditation types, launching sessions, managing rituals, and accessing quiz-based recommendations.",
  "frontend/src/pages/JournalPage.tsx": "Provides journal entry management with filtering, editing, favoriting, importing/exporting, and cloud‑sync handling.",
  "frontend/src/pages/KnowledgePage.tsx": "Shows meditation knowledge content with category navigation, deep‑link scrolling, and quiz score persistence per user.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen handling login, guest mode, theme switching, and redirecting authenticated users to the dashboard.",
  "frontend/src/pages/PreMeditationPage.tsx": "Page handling pre-meditation setup including mood/energy selection, duration, ambient sound, and starting sessions with detailed guide steps.",
  "frontend/src/pages/ProgressPage.tsx": "Displays user progress stats and handles exporting/importing data with cloud sync error handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty placeholder page for reflection content.",
  "frontend/src/pages/StatsPage.tsx": "Empty placeholder page for stats content.",
  "frontend/src/utils/ambientSounds.ts": "Defines ambient sound metadata and utilities to retrieve sound info and paths by ID.",
  "frontend/src/utils/cloudSync.ts": "Classifies cloud sync errors, provides user-friendly messages, and includes readiness polling logic.",
  "frontend/src/utils/cloudSyncRetry.ts": "Implements retry logic for cloud operations with readiness and authorization checks.",
  "frontend/src/utils/exportImport.ts": "Handles serialization, validation, and normalization for exporting and importing meditation-related data.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages saving and retrieving quiz scores in localStorage with identity-based scoping.",
  "frontend/src/utils/lotusGrowthModel.ts": "Defines a lotus growth model mapping total meditation minutes to multi-layer visual bloom parameters and particle effects.",
  "frontend/src/utils/meditationStorage.ts": "Implements guest-only localStorage handling for journal entries, progress data, and rituals including legacy data migration.",
  "frontend/src/utils/meditationType.ts": "Validates and normalizes meditation type strings, mapping aliases like 'meta' to supported MeditationType values.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers based on total meditation minutes and provides helpers to get current, next, and displayable ranks.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, persist, and clear URL parameters using query strings, hash fragments, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, shadows, and container settings with custom design tokens and plugins.",
  "project_state.json": "Describes project metadata, existing features, and pending requests related to ritual tag icons and quiz-based meditation routing."
}