{
  "backend/main.mo": "Defines the main canister actor with data types for books, meditation, journaling, user profiles, progress, rituals, and supporting storage/authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing theme-token and UI-token audit requirements with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of multiple frontend files including routing, global styling, hooks, pages, and UI components.",
  "frontend/index.css": "Empty stylesheet placeholder with no content provided.",
  "frontend/index.html": "HTML entry point defining the root mount node and loading the main frontend script.",
  "frontend/src/App.tsx": "Sets up TanStack Router, React Query, theme provider, Internet Identity provider, and mounts core routes and toaster.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel for selecting ambient sounds with swipe navigation, mute toggle, and dynamically managed looping audio playback.",
  "frontend/src/components/FeatureCard.tsx": "Empty file with no content provided.",
  "frontend/src/components/FloatingNav.tsx": "Animated floating navigation bar linking to Journal, Progress, and Books pages with hover labels.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile slide-out menu supporting theme switching, authentication actions, and navigation with cached-query cleanup on logout.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "A 3D lotus model with animated petals, stem, and glow that react to growth state parameters and theme colors.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "A particle system around the lotus that animates between chaotic and coherent motion based on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas-based animated lotus with particles, glow, and theme/variant-based visibility effects.",
  "frontend/src/components/MeditationCarousel.tsx": "Swipeable meditation selector carousel with circular navigation and animated card positioning.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Step-by-step meditation guide with swipe navigation, dot controls, and animated transitions.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that navigates to the dashboard.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered glowing bowl that fills based on total meditation minutes with animated liquid waves.",
  "frontend/src/components/ProgressLotusR3F.tsx": "3D lotus visualization using react-three-fiber, particles, and growth calculations based on total minutes.",
  "frontend/src/components/ProgressLotusSVG.tsx": "Animated SVG lotus whose layers, glow, and breathing scale depend on growth state and streak.",
  "frontend/src/components/QuizDialog.tsx": "A multi-step quiz dialog that collects user answers and computes a recommended meditation type based on scored options.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "A swipeable carousel for browsing, starting, and deleting saved meditation rituals with touch and button navigation.",
  "frontend/src/components/SessionIndicator.tsx": "Displays login status and provides guest-return and logout actions while clearing relevant cached queries.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to the user’s identity and refreshes dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useLocalStorageState.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching meditation data, quotes, sessions, and guest/local fallbacks, integrating actor and identity state.",
  "frontend/src/index.css": "Sets global Tailwind-based styles, themes, colors, and animation utilities for the frontend.",
  "frontend/src/lib/bookData.ts": "Exports an extended Book type and a list of book recommendation objects with metadata and Amazon links.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty file with no implemented component.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Implements a swipeable, theme-aware carousel UI for browsing book recommendations with navigation and decorative components.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard with theme toggle, daily quote selection, meditation start logic, ritual management, and various UI components.",
  "frontend/src/pages/JournalPage.tsx": "Journal interface with search, filtering, editing, mood/energy icons, favorites, import/export, and CRUD actions on journal entries.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with theme toggle, animated intro, login via Internet Identity, and guest mode navigation to dashboard.",
  "frontend/src/pages/PreMeditationPage.tsx": "Pre-meditation setup page providing mood/energy selection, ambient sound options, guided steps, and session/ritual saving.",
  "frontend/src/pages/ProgressPage.tsx": "Progress tracking page showing minutes, streaks, ranks, and supports data import/export with confirmation dialogs.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/StatsPage.tsx": "Empty file with no implementation.",
  "frontend/src/utils/lotusGrowthModel.ts": "Computes lotus visual growth state from total minutes using phased thresholds and smooth interpolation for geometry, vividness, and layer openness.",
  "frontend/src/utils/meditationStorage.ts": "Manages guest-only meditation data in localStorage, including migration, journal entries, progress tracking, and rituals.",
  "frontend/src/utils/progressRanks.ts": "Defines meditation rank tiers by total minutes and provides helpers to get current/next rank and minutes until advancement.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters (including hash), persisting them in sessionStorage, and clearing them safely from the address bar.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, shadows, animations, and layout settings with custom OKLCH-based theme vars.",
  "project_state.json": "Metadata describing project version, app features, and system capabilities for the meditation app."
}