{
  "backend/main.mo": "Defines core data types for books, meditation sessions, journaling, user profile, rituals, and progress, and initializes a static list of recommended books.",
  "feature_evidence.json": "Lists feature‑tracking metadata including feature descriptions, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend files describing their purpose and behavior for build planning.",
  "frontend/index.css": "Defines global OKLCH theme color tokens, light/dark variables, and base Tailwind resets for consistent styling.",
  "frontend/index.html": "Basic HTML entry point with root mount element and script loading the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, React Query client, theme provider, Internet Identity provider, and global Toaster before rendering the app.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Component providing a swipeable ambient‑music selector with looping audio playback, mute/volume control, and carousel navigation.",
  "frontend/src/components/FeatureCard.tsx": "Empty file placeholder with no implementation provided.",
  "frontend/src/components/FloatingNav.tsx": "Floating side navigation with animated icons and hover labels linking to Journal, Progress, and Books pages.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile menu component with theme toggle, authentication-aware actions, and logout handling that clears cached queries.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus model that animates petals, glow, and breathing based on growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Three.js particle system that switches between chaotic and coherent motion patterns depending on lotus growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas animation rendering particles and a pulsing lotus with theme- and variant-based visual intensity.",
  "frontend/src/components/MeditationCarousel.tsx": "Swipeable carousel for selecting meditation types with circular navigation and centered scaling effects.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Step-by-step meditation guide with swipe navigation, animated transitions, and optional benefits parsing.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that navigates users to the dashboard.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-based progress visualization drawing a glowing bowl with animated liquid fill based on total minutes.",
  "frontend/src/components/ProgressLotusR3F.tsx": "3D lotus progress visualization using React Three Fiber, with lights, particle effects, and growth state rendering.",
  "frontend/src/components/ProgressLotusSVG.tsx": "Animated SVG lotus that reacts to growth state, streak, and theme with breathing, pulsing glow, and layered petals.",
  "frontend/src/components/QuizDialog.tsx": "Interactive multi‑step quiz dialog that scores answers to recommend a meditation type and returns the result on completion.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel UI for browsing, starting, and deleting saved rituals with swipe support and delete confirmation.",
  "frontend/src/components/SessionIndicator.tsx": "Displays login or guest status and provides logout or return‑to‑start actions while clearing cached queries on logout.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for meditation data, quotes, sessions, and guest-mode storage using the backend actor when available.",
  "frontend/src/index.css": "Sets global Tailwind styles, color variables, themes, and custom animations for the app.",
  "frontend/src/lib/bookData.ts": "Exports a list of recommended meditation books with metadata and Amazon links.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Renders an interactive swipeable book carousel with theming, navigation, and decorative UI elements.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard with theme toggle, daily quotes, meditation selection, rituals management, and navigation to pre‑meditation flow.",
  "frontend/src/pages/JournalPage.tsx": "Journal interface supporting search, filtering, editing, favorites, deletion, and data import/export.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen with login, guest mode, theme toggle, and redirect logic for authenticated users.",
  "frontend/src/pages/PreMeditationPage.tsx": "Pre‑session setup page offering meditation guides, mood/energy inputs, ambient sound options, and ritual saving.",
  "frontend/src/pages/ProgressPage.tsx": "Progress tracking UI showing streaks, minutes, ranks, and options to export or import meditation data.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/StatsPage.tsx": "Empty placeholder file.",
  "frontend/src/utils/lotusGrowthModel.ts": "Computes lotus growth parameters based on total meditation minutes, mapping phases and smooth interpolations to visual states for a multi‑layer bloom model.",
  "frontend/src/utils/meditationStorage.ts": "Manages guest‑mode meditation data in localStorage, including journals, progress tracking, rituals, and legacy key migration.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers for total meditation minutes and provides helpers to get current/next rank and minutes until advancing.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters (including hash‑based), persisting them in sessionStorage, and clearing sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, shadows, animations, and container settings with OKLCH‑based custom design tokens.",
  "project_state.json": "Stores the project’s feature inventory and metadata summarizing app functionality, authentication, storage, UI, and backend capabilities."
}