{
  "backend/main.mo": "Defines core actor types and initial data for books, journals, user profiles, sessions, and rituals.",
  "feature_evidence.json": "Lists feature evidence records mapping feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files and components used in the project.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Provides step-by-step instructions for redeploying the app without code changes.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template for diagnosing deployment failures with structured triage steps.",
  "frontend/index.css": "Defines global Tailwind base styles, theme variables, and dark mode tokens.",
  "frontend/index.html": "HTML entrypoint setting up root container, favicon, environment shim, and global error handlers.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with theme provider, error boundary, and toaster.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel component for selecting ambient sounds with swipe navigation, audio playback, and volume control.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches runtime errors, logs them, and displays a detailed error screen with reload option.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Destructive alert banner showing cloud sync or loading errors with retry behavior tailored to error type.",
  "frontend/src/components/DurationRangeInput.tsx": "Slider-based duration input component allowing users to select a time range in minutes.",
  "frontend/src/components/FeatureCard.tsx": "Empty file with no implemented content.",
  "frontend/src/components/FloatingNav.tsx": "Floating vertical navigation bar with animated icons and hover labels that routes to main app sections.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile slide‑out menu providing theme switching, authentication status, and navigation options.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "Dropdown filter UI for journal entries supporting mood, energy, date range, favorites, and text filtering.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Swipeable and keyboard-navigable pager for knowledge book content with animated transitions and auto-scroll.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel for selecting knowledge categories with swipe, keyboard, and animated card positioning.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Quiz dialog that shuffles questions, tracks answers, navigates between them, and displays results.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus model that animates petals, stem, and center glow based on growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Three.js particle system that animates chaotic or coherent particle motion depending on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Animated lotus canvas with particle effects and theme‑adjusted glow and pulse visuals.",
  "frontend/src/components/MeditationCarousel.tsx": "Carousel showing meditation types with swipe and circular navigation plus animated card positioning.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Step‑by‑step meditation guide with swipe navigation, animated transitions, and parsed benefits section.",
  "frontend/src/components/MeditationTimerRing.tsx": "Canvas-based circular timer ring with animated wave effects, theme‑based colors, and glow at the progress edge.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Canvas component showing vertical wave‑animated fill inside a circular clipping region based on progress and theme.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile‑only back button that navigates to the dashboard and optionally calls a custom handler.",
  "frontend/src/components/PageBackgroundShell.tsx": "Wrapper that renders a full‑screen background with a LotusCanvas effect behind page content.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas‑drawn bowl graphic that fills with animated liquid based on total meditation minutes and theme.",
  "frontend/src/components/ProgressLotusR3F.tsx": "Three.js lotus model and particle system whose growth and animation depend on total meditation minutes.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG lotus with animated breathing, glow, and petal openness driven by growth model, streak, and theme.",
  "frontend/src/components/QuizDialog.tsx": "Multi‑step quiz dialog that collects user answers and computes a recommended meditation type.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal that shows up to five saved rituals and lets users start or delete one, with a fallback message when none exist.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel for browsing, starting, or deleting rituals with swipe, navigation, and confirmation dialog support.",
  "frontend/src/components/SessionIndicator.tsx": "Displays user session state and provides guest return or authenticated logout functionality.",
  "frontend/src/components/StandardPageNav.tsx": "Navigation bar with session indicator, theme toggle, back button, and mobile menu integration.",
  "frontend/src/components/ThemedToaster.tsx": "Wrapper rendering a themed Toaster component with a close button.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useCloudOperation.ts": "Hook providing retryable cloud write operations using current actor and identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity initialization states.",
  "frontend/src/hooks/useMeditationTimer.ts": "Implements a customizable meditation timer hook with start, pause, reset, seek, and completion handling.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls and local guest fallbacks in React Query hooks for books, profiles, journal entries, and other app data.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, color variables, themes, animations, and typography for the frontend.",
  "frontend/src/lib/bookData.ts": "Exports a list of recommended meditation books with metadata and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Provides structured educational content and quiz data for different meditation techniques.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty file with no content.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Interactive book recommendation viewer with swipe navigation and dynamic card positioning.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing quotes, meditation carousel, and ritual management with navigation to sessions.",
  "frontend/src/pages/JournalPage.tsx": "Journal interface for filtering, editing, favoriting, importing, and exporting meditation reflections.",
  "frontend/src/pages/KnowledgePage.tsx": "Knowledge library with category selection, scroll handling, and per-technique quiz tracking.",
  "frontend/src/pages/LandingPage.tsx": "Landing page handling authentication, theming, and entry into guest or authenticated dashboard flow.",
  "frontend/src/pages/PreMeditationPage.tsx": "Page for configuring a meditation session with timers, ambient sounds, guides, mood/energy inputs, and session saving.",
  "frontend/src/pages/ProgressPage.tsx": "Displays progress stats and handles import/export of user data with cloud sync error handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty placeholder page for reflection content.",
  "frontend/src/pages/StatsPage.tsx": "Empty placeholder page for stats content.",
  "frontend/src/utils/ambientSounds.ts": "Defines ambient sound metadata and helpers to fetch sounds by ID or path.",
  "frontend/src/utils/cloudSync.ts": "Maps backend cloud sync errors to user-friendly messages and classifies error types.",
  "frontend/src/utils/cloudSyncRetry.ts": "Provides retry logic for cloud operations with readiness and authorization checks.",
  "frontend/src/utils/exportImport.ts": "Serializes and validates meditation-related data for safe JSON export/import handling.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages storing and retrieving quiz scores per user or guest using localStorage.",
  "frontend/src/utils/lotusGrowthModel.ts": "Computes lotus growth visuals over 0–20,000 minutes using phased thresholds and smooth interpolation to produce petal, layer, and particle parameters.",
  "frontend/src/utils/meditationStorage.ts": "Provides localStorage-based guest journaling and progress management with legacy migration and CRUD helpers.",
  "frontend/src/utils/meditationType.ts": "Validates and normalizes meditation type strings, mapping aliases and defaults to supported enum values.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers based on total meditation minutes and utilities for determining current, next, and display-ready ranks.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, shadows, radii, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata containing current issues, implemented features, and configuration for the Meditation App."
}