{
  "backend/main.mo": "Defines core data types and holds static book data for the meditation app’s backend actor.",
  "feature_evidence.json": "Lists feature evidence records mapping UI requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides short human-written summaries of key frontend files and their functionality.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Deployment guide describing prerequisites and steps for redeploying the frontend without code changes.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template-based troubleshooting guide for diagnosing deployment errors across build and deploy stages.",
  "frontend/index.css": "Global Tailwind-based theme variables and base styling, including dark mode and CSS resets.",
  "frontend/index.html": "HTML entry point setting up root container, polyfills, and global error logging before loading React.",
  "frontend/src/App.tsx": "Main React app configuring routing, theme provider, error boundary, and top-level UI providers.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Audio carousel component allowing music selection, swiping, playback control, and volume adjustments.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a detailed fallback UI with stack traces and reload option.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "A configurable error banner for cloud sync issues that adjusts messaging by error type and provides a retry button.",
  "frontend/src/components/DurationRangeInput.tsx": "A duration slider component with manual thumb positioning correction and min/max labels.",
  "frontend/src/components/FeatureCard.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/FloatingNav.tsx": "A floating vertical navigation menu with hover labels and animated icons that navigates between main app sections.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile slide-out menu with theme toggle, account status, login/logout handling, and navigation actions.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "Dropdown filter panel for journal entries supporting mood, energy, date, favorites, and text filters with active count display.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Interactive page viewer with swipe, keyboard navigation, and auto-scroll for browsing knowledge book content.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel for knowledge categories with touch, keyboard, and circular navigation plus dynamic card styling.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Quiz dialog that shuffles questions, tracks answers, navigates between them, and displays results.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Renders and animates a 3D lotus model whose petals, stem, and glow respond to growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Generates and animates particles around the lotus using chaotic or coherent motion based on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas animation rendering lotus petals and particles with theme- and variant-based visual behavior.",
  "frontend/src/components/MeditationCarousel.tsx": "Meditation type carousel with swipe navigation and circular card positioning.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Stepper for meditation guidance with swipe navigation, step transitions, and optional benefits parsing.",
  "frontend/src/components/MeditationTimerRing.tsx": "Canvas-based circular meditation timer with animated wave fill, glow effects, and theme-aware colors.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Circular fill indicator using animated waves and eased progress interpolation with theme-based styling.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that navigates to the dashboard when pressed.",
  "frontend/src/components/PageBackgroundShell.tsx": "Page wrapper that renders a LotusCanvas background and children content with selectable visual variants.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered bowl that fills with animated liquid based on total meditation minutes and theme.",
  "frontend/src/components/ProgressLotusR3F.tsx": "3D lotus visualization using React Three Fiber with lighting, particles, and growth state animation.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG lotus that animates petals, glow, and breathing effects based on meditation progress and streaks.",
  "frontend/src/components/QuizDialog.tsx": "Multi-step quiz dialog that collects user answers and computes a recommended meditation type.",
  "frontend/src/components/RitualSelectionModal.tsx": "Displays a modal showing up to five saved rituals and uses a carousel for selecting, starting, or deleting a ritual.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Provides a swipeable carousel UI to view, start, or delete rituals with confirmation dialogs and icon mappings.",
  "frontend/src/components/SessionIndicator.tsx": "Shows login or guest status and provides actions for returning home or logging out while clearing cached queries.",
  "frontend/src/components/StandardPageNav.tsx": "Renders navigation controls including theme toggle, back buttons, session indicator, and mobile menu handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and invalidates dependent queries on changes.",
  "frontend/src/hooks/useCloudOperation.ts": "Provides a hook for running cloud write operations with retry logic using the current actor and identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, storing identity state, and exposing login status flags.",
  "frontend/src/hooks/useMeditationTimer.ts": "Implements a customizable meditation timer hook with pause, start, reset, seeking, and completion callbacks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching meditation-related data, combining backend calls with guest-mode local storage fallbacks.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles, theme variables for light and dark modes, and custom animation utilities.",
  "frontend/src/lib/bookData.ts": "Exports a list of meditation-related book recommendations with descriptions, tags, and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Contains structured educational content and quizzes for meditation techniques.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Renders a swipeable book recommendation carousel with theme toggle and navigation controls, handling touch gestures and dynamic card positioning.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the main dashboard with quotes, meditation selection, rituals, and navigation, including logic for starting sessions and managing rituals.",
  "frontend/src/pages/JournalPage.tsx": "Provides journal entry listing, filtering, editing, favoriting, deleting, and import/export functionality with cloud sync handling.",
  "frontend/src/pages/KnowledgePage.tsx": "Shows meditation knowledge content with category carousel, quiz tracking, deep-link scrolling, and identity-based quiz score storage.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen with theme toggle, animated background, and login/guest flow that redirects authenticated users to the dashboard.",
  "frontend/src/pages/PreMeditationPage.tsx": "Renders a pre‑meditation setup page with guides, ambient sound selection, duration input, and session start logic using various hooks. Includes detailed meditation guide steps and handles saving rituals, journaling, and session recording.",
  "frontend/src/pages/ProgressPage.tsx": "Shows user progress stats, streaks, rank, and a visualization bowl, with options to import/export data and handle cloud sync errors.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/StatsPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/utils/ambientSounds.ts": "Defines ambient sound metadata and helpers for retrieving sound objects or audio paths by ID.",
  "frontend/src/utils/cloudSync.ts": "Provides standardized cloud‑sync error types and utilities to classify and map backend errors to user‑friendly messages.",
  "frontend/src/utils/cloudSyncRetry.ts": "Implements retry logic for cloud operations, detecting authorization vs readiness errors and providing helper checks.",
  "frontend/src/utils/exportImport.ts": "Handles serialization and deserialization of meditation data for safe JSON export/import with bigint conversions and validation.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages storing and retrieving quiz scores in localStorage, supporting guest and authenticated users, with a React hook wrapper.",
  "frontend/src/utils/lotusGrowthModel.ts": "Computes lotus visual growth state over 0–20,000 minutes using phased thresholds, smooth interpolation, and multiple visual parameters.",
  "frontend/src/utils/meditationStorage.ts": "Provides guest‑only localStorage handling for journal entries, progress data, and rituals with legacy‑key migration.",
  "frontend/src/utils/meditationType.ts": "Validates a string into a supported MeditationType, defaulting to mindfulness for invalid inputs.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers based on total meditation minutes and helpers to get current, next, and formatted rank info.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and persisting URL/query parameters across navigation, including sessionStorage handling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, shadows, container settings, and enabling typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current state, issues, and feature requests related to adjusting pre‑meditation page buttons."
}