{
  "backend/main.mo": "Main Motoko actor defining types (Book, JournalEntry, UserProfile, MeditationSession, ProgressStats, Ritual, etc.) and a static list of meditation book recommendations with metadata (title, author, description, Goodreads links, tags, icons).",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: reduced button height on PreMeditationPage and dynamic meditation guide titles corresponding to selected meditation type.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including pages, components, hooks, and configuration, detailing routing, styling, state management, and UI behavior.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Step-by-step deployment instructions for redeploying the Inner Bloom app without code changes, including prerequisites and standard redeploy steps.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Structured troubleshooting template for diagnosing deployment failures across dependency installation, backend/frontend deployment, Candid generation, build, and runtime stages.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system for light/dark themes, custom colors (accent-cyan, accent-lavender, etc.), Playfair Display font, animations, scrollbar styling, and themed button styles.",
  "frontend/index.html": "HTML entry point with favicon, early-runtime process.env shim for compatibility, and global error handlers to capture deployment/runtime failures for debugging.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with seven routes (landing, dashboard, pre-meditation, progress, journal, books, knowledge), wrapped in ThemeProvider, AppErrorBoundary, and ThemedToaster.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel component for selecting ambient sounds with audio playback, volume control, mute toggle, navigation buttons, and touch swipe gesture support for mobile.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary component that catches and displays application errors with detailed error messages, stack traces, and a reload button.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Alert banner component that displays cloud sync errors with customizable messages based on error type (authorization, readiness, network, other) and includes a retry button.",
  "frontend/src/components/DurationRangeInput.tsx": "Slider input component for selecting duration in minutes with configurable min/max values and 5-minute step increments.",
  "frontend/src/components/FeatureCard.tsx": "Empty file with no content.",
  "frontend/src/components/FloatingNav.tsx": "Fixed-position vertical navigation menu with animated floating icons for Journal, Progress, Books, and Knowledge sections, featuring hover tooltips.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile hamburger menu component with theme toggle, authentication status display, and logout functionality that clears query cache on logout.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "Comprehensive filter component for journal entries with dropdowns for moods, energy levels, date ranges, notes text search, and favorites toggle with active filter count badge.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Paginated book reader component with swipe gestures, keyboard navigation, dot indicators, and smooth scrolling between pages of knowledge content.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "A carousel component for displaying knowledge categories with touch/keyboard navigation, showing a centered selected card with adjacent cards partially visible on sides. Implements circular positioning logic with smooth transitions and swipe gestures.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "A dialog component for displaying quiz questions with navigation, answer selection, progress tracking, and results display. Shuffles questions on open, allows back navigation, and shows score with retry option on completion.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "React Three Fiber component rendering an animated 3D lotus flower with 8 petals that grow, open, breathe, and glow based on growth state parameters and theme colors.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "React Three Fiber component rendering animated particles around the lotus that transition between chaotic brownian motion and coherent orbital patterns based on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "A canvas component that renders an animated lotus flower with breathing petals and floating particles. Supports multiple variants (default, enhanced, premed) with theme-aware visibility multipliers and intensity scaling.",
  "frontend/src/components/MeditationCarousel.tsx": "A carousel component for meditation type selection displaying cards in a circular layout with center focus. Includes touch swipe support, navigation buttons, and shows 5 meditation types (mindfulness, metta, visualization, IFS, quiz).",
  "frontend/src/components/MeditationGuideStepper.tsx": "A stepper component for meditation guide steps with dot indicators, swipe navigation, and animated transitions. Parses content to separate main text from benefits section and displays them with distinct styling.",
  "frontend/src/components/MeditationTimerRing.tsx": "Animated canvas-based circular progress ring for meditation timer with wave effects, glow, and theme-aware colors that animates continuously using requestAnimationFrame.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Canvas component rendering a circular container with animated wave fill that rises from bottom to top based on progress, with theme-aware colors and continuous wave animation.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button component that navigates to dashboard, positioned fixed in top-left with optional custom onBack handler.",
  "frontend/src/components/PageBackgroundShell.tsx": "Layout wrapper component that renders LotusCanvas background with configurable variant and intensity, plus gradient background for dark theme.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-based animated bowl visualization that fills with liquid based on total meditation minutes (capped at 20,000), featuring wave effects and glow.",
  "frontend/src/components/ProgressLotusR3F.tsx": "React Three Fiber 3D lotus visualization with orbit controls, lighting, particles, and growth state calculated from total meditation minutes.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG-based lotus flower visualization with multi-layer petals that grow, open, and pulse based on meditation minutes and streak, with theme-aware colors and breathing animation.",
  "frontend/src/components/QuizDialog.tsx": "Multi-step quiz dialog with 5 questions that recommends a meditation type (mindfulness, metta, visualization, or IFS) based on user answers, with navigation and result display.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal dialog component that displays saved meditation rituals in a carousel (limited to 5), allowing users to select and start a ritual or showing an empty state if no rituals exist.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel component for browsing saved meditation rituals with navigation controls, touch/swipe support, and delete functionality with confirmation dialog. Displays ritual details including meditation type, duration, and ambient sound with corresponding icons.",
  "frontend/src/components/SessionIndicator.tsx": "Fixed-position component showing authentication status (guest vs logged-in) with appropriate actions (return to start or logout), clearing query cache on logout.",
  "frontend/src/components/StandardPageNav.tsx": "Navigation component providing desktop back button, theme toggle, session indicator, and mobile hamburger menu with conditional rendering based on mount state and props.",
  "frontend/src/components/ThemedToaster.tsx": "Wrapper component that renders the Sonner toast notification system with close button enabled.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCloudOperation.ts": "Composition hook providing a retry-aware wrapper for cloud write operations using the current actor and identity refs without causing unnecessary re-renders.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with support for delegation validation and idle handling.",
  "frontend/src/hooks/useMeditationTimer.ts": "Custom React hook that manages a countdown meditation timer with play/pause, reset, seek, and duration controls, calculating progress and triggering completion callbacks.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data (books, quotes, journal entries, meditation sessions, progress stats, rituals) with guest mode fallback to local storage and cloud sync error handling.",
  "frontend/src/index.css": "Defines global styles using Tailwind CSS with OKLCH color system for light/dark themes, custom CSS animations (fade-in, breathe, glow-pulse, float, wave), and Playfair Display font import.",
  "frontend/src/lib/bookData.ts": "Exports a curated list of meditation and mindfulness book recommendations with titles, authors, descriptions, Amazon links, tags, and icons.",
  "frontend/src/lib/knowledgeContent.ts": "Defines structured educational content for meditation techniques (mindfulness, etc.) including multi-page lessons and quiz questions for knowledge assessment.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Page component for active meditation sessions (content truncated in provided input).",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays a carousel of book recommendations with swipe/navigation controls, theme toggle, and session indicator. Fetches book data from BOOK_RECOMMENDATIONS and renders cards with positioning logic for center/adjacent/hidden states.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page featuring a meditation carousel, daily quotes, and ritual management. Handles meditation type selection, quiz dialog, ritual modal, and navigation to pre-meditation with optional auto-start for saved rituals.",
  "frontend/src/pages/JournalPage.tsx": "Journal entries page with filtering (favorites, mood, energy, date, text), inline editing, delete confirmation, and import/export functionality. Supports both authenticated and guest modes with row-level loading states for favorites.",
  "frontend/src/pages/KnowledgePage.tsx": "Knowledge library page displaying meditation technique content via category carousel and book pager. Includes quiz functionality with score tracking and supports deep-link scrolling from pre-meditation page.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with Internet Identity login, guest mode option, and theme toggle. Features animated lotus canvas background and automatically redirects authenticated users to dashboard.",
  "frontend/src/pages/PreMeditationPage.tsx": "Main pre-meditation setup page that allows users to configure meditation sessions (type, duration, ambient sound, mood/energy state), includes detailed meditation guides, and handles session recording, journal entry creation, and ritual saving with cloud sync error handling.",
  "frontend/src/pages/ProgressPage.tsx": "Progress tracking page displaying user meditation statistics (total minutes, streak, rank) via ProgressBowl component, with import/export functionality for user data and cloud sync error handling with retry logic.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty file with no content.",
  "frontend/src/pages/StatsPage.tsx": "Empty file with no content.",
  "frontend/src/utils/ambientSounds.ts": "Defines ambient sound data structure and provides a centralized list of available ambient sounds (temple bells, singing bowl, rain, ocean, etc.) with helper functions to retrieve sound metadata and audio paths by ID.",
  "frontend/src/utils/cloudSync.ts": "Provides standardized cloud sync error handling with predefined error codes and user-friendly messages, including classification logic for authorization, readiness, network, validation, and backend-specific errors (duplicate rituals, ritual limits, etc.).",
  "frontend/src/utils/cloudSyncRetry.ts": "Frontend utility for wrapping cloud operations with automatic retry logic on readiness failures, distinguishing between retryable readiness errors and non-retryable authorization errors.",
  "frontend/src/utils/exportImport.ts": "Handles serialization and deserialization of user data (journal entries, sessions, progress stats, rituals) to/from JSON export format with safe bigint handling and validation/normalization of meditation types, mood states, and energy states.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages local storage of knowledge quiz scores per user (or guest), providing functions to save and retrieve quiz results with principal-based storage keys and a React hook for convenient access.",
  "frontend/src/utils/lotusGrowthModel.ts": "Defines the lotus growth model that maps meditation minutes (0-20,000) to visual parameters across 25 exponential phases, controlling petal layers, openness, glow, particles, and breathing effects.",
  "frontend/src/utils/meditationStorage.ts": "Provides localStorage utilities for guest-only meditation data (journal entries, progress, rituals) with legacy data migration from non-prefixed keys.",
  "frontend/src/utils/meditationType.ts": "Validates and coerces meditation type strings to the MeditationType enum, handling aliases like 'meta' for 'metta' and defaulting to mindfulness.",
  "frontend/src/utils/progressRanks.ts": "Defines six rank tiers (Droplet to Infinite Waters) based on total meditation minutes (0-20,000+) and provides functions to calculate current rank, next rank, and progress.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup functions for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH, container settings, border radius variables, custom shadows including glow effects, and plugin integrations.",
  "project_state.json": "Project state tracking two completed features (button sizing, dynamic guide title) and three pending requests for meditation page UI refinements (play/pause styling, control heights, time slider direction fix)."
}