{
  "backend/main.mo": "Defines the main canister actor with all app data types, book list, and imports for storage, authorization, and migration.",
  "backend/migration.mo": "Contains type definitions mirroring backend state and a no-op migration run function returning the existing actor state.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files and components for reference.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Runbook outlining prerequisites and step-by-step instructions for redeploying the app.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template for diagnosing deployment issues across install, backend, build, and runtime phases.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color tokens, theme variables, and base styles for light and dark modes.",
  "frontend/index.html": "Root HTML document setting meta tags, favicon, error handlers, and loading the React app entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, error boundary, and root application structure.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Interactive carousel for ambient sound selection with audio preview, swipe handling, volume control, and cleanup logic.",
  "frontend/src/components/AppErrorBoundary.tsx": "Provides a React error boundary that catches rendering errors and displays a detailed error screen with reload option.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Displays an error alert for cloud sync issues with contextual messaging and a retry button.",
  "frontend/src/components/DurationRangeInput.tsx": "Renders a slider-based duration selector with labeled min/max values and live value display.",
  "frontend/src/components/FeatureCard.tsx": "Empty file with no implementation.",
  "frontend/src/components/FloatingNav.tsx": "Implements a floating sidebar navigation with icons, hover labels, and route navigation.",
  "frontend/src/components/HamburgerMenu.tsx": "Creates a mobile hamburger menu with theme toggle, authentication state display, and logout handling.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "Provides a dropdown UI for filtering journal entries by favorites, mood, energy, date, and text content.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Implements a swipeable and keyboard-navigable page viewer with animated transitions for knowledge content.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel component for selecting knowledge categories with swipe, keyboard, and button navigation and dynamic card positioning.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Quiz dialog that shuffles questions, tracks answers, navigates between them, and displays results upon completion.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus model that animates petals, stem, and center glow based on a growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Animated particle system around the lotus that switches between chaotic and coherent motion based on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas animation rendering particles and a pulsing lotus graphic whose appearance varies by theme and variant.",
  "frontend/src/components/MeditationCarousel.tsx": "Carousel for navigating predefined meditation types using swipe or buttons with circular index logic and card scaling.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Stepper UI for meditation steps with swipe navigation, animated transitions, and parsing of content into main text and benefits.",
  "frontend/src/components/MeditationTimerRing.tsx": "Canvas-based circular meditation timer with animated wave progress, glow effects, and theme-aware colors.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Canvas component showing a circular fill-level indicator with animated waves and theme-based styling.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that navigates to the dashboard and supports an optional callback.",
  "frontend/src/components/PageBackgroundShell.tsx": "Page wrapper that renders a LotusCanvas background and places children above it.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered bowl that fills with animated liquid based on total meditation minutes, with glow and wave effects.",
  "frontend/src/components/ProgressLotusR3F.tsx": "Three.js lotus visualization that grows with meditation progress and includes lighting, particles, and orbit controls.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG lotus that animates growth, glow, and breathing effects based on total minutes, streak, and theme.",
  "frontend/src/components/QuizDialog.tsx": "Multi-step quiz dialog that collects answers and outputs a recommended meditation type based on scoring.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal that displays up to five saved rituals and allows starting or deleting one through a carousel component.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel UI for browsing, starting, and deleting saved rituals with swipe and button navigation and a delete confirmation dialog.",
  "frontend/src/components/SessionIndicator.tsx": "Shows login status, guest mode, and provides logout or return-to-start actions while clearing cached queries on logout.",
  "frontend/src/components/StandardPageNav.tsx": "Provides top navigation with theme toggle, back button, session indicator, and mobile menu integration.",
  "frontend/src/components/ThemedToaster.tsx": "Simple wrapper that renders a toaster component with a close button.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor tied to the current identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useCloudOperation.ts": "Hook providing a retry-enabled wrapper for cloud write operations using the current actor and identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, loading stored identities, and exposing login state and actions.",
  "frontend/src/hooks/useMeditationTimer.ts": "Implements a customizable countdown meditation timer with pause, seek, reset, duration updates, and completion callbacks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend actor calls and guest-mode fallbacks, covering books, quotes, user profiles, journals, and rituals.",
  "frontend/src/index.css": "Configures Tailwind layers, OKLCH color themes, fonts, and custom animation utilities for the app's global styling.",
  "frontend/src/lib/bookData.ts": "Exports a list of recommended meditation-related books enriched with Amazon links and metadata.",
  "frontend/src/lib/knowledgeContent.ts": "Provides structured content and quizzes for meditation techniques, including descriptions and multi-page learning material.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting it with React Query and Internet Identity providers.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays a swipeable carousel of book recommendations with theme toggle and navigation controls.",
  "frontend/src/pages/DashboardPage.tsx": "Shows the main dashboard with quotes, meditation selection, rituals, and navigation to meditation flows.",
  "frontend/src/pages/JournalPage.tsx": "Manages journal entries with filtering, editing, favoriting, deletion, and import/export features.",
  "frontend/src/pages/KnowledgePage.tsx": "Presents meditation knowledge categories, detailed technique content, and quizzes with score tracking.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen handling login, guest mode, theme toggle, and redirecting authenticated users to the dashboard.",
  "frontend/src/pages/PreMeditationPage.tsx": "Page for configuring a meditation session with type, duration, ambient sound, mood, and guides, then starting a timer and optionally saving a ritual or journal entry.",
  "frontend/src/pages/ProgressPage.tsx": "Displays user progress stats, rank, and visualizations with options to import/export data and handle cloud sync errors.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty page placeholder for future reflection features.",
  "frontend/src/pages/StatsPage.tsx": "Empty stats page placeholder.",
  "frontend/src/utils/ambientSounds.ts": "Defines ambient sound metadata and utilities for retrieving sound objects and audio paths by ID.",
  "frontend/src/utils/cloudSync.ts": "Provides standardized cloud sync error definitions and functions to map backend errors to user-friendly messages.",
  "frontend/src/utils/cloudSyncRetry.ts": "Implements retry logic for cloud operations with checks for readiness and authorization errors.",
  "frontend/src/utils/exportImport.ts": "Handles serialization, validation, and normalization of export/import data for sessions, journals, progress, and rituals.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Stores and retrieves quiz scores in localStorage, supporting both guest and authenticated users.",
  "frontend/src/utils/lotusGrowthModel.ts": "Implements a multi-phase lotus growth model mapping minutes to visual parameters and petal-layer openness. Provides smoothstep-based calculations for bloom geometry, particles, and maturity states.",
  "frontend/src/utils/meditationStorage.ts": "Handles guest-mode meditation data in localStorage, including journal entries, progress, rituals, and legacy data migration. Provides CRUD utilities for guest-only storage.",
  "frontend/src/utils/meditationType.ts": "Validates and normalizes a string into a supported MeditationType, defaulting to mindfulness and treating 'meta' as 'metta'.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers for meditation progress and utilities to get current, next, and displayable rank info based on total minutes.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routes.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, container settings, animations, and extended utilities for the frontend.",
  "project_state.json": "Describes the project state and requirements for fixing backend authenticated ritual deletion using field-matching without frontend changes."
}