{
  "backend/main.mo": "Defines core types and data structures for books, meditation sessions, journals, profiles, rituals, and progress, plus a static book list.",
  "feature_evidence.json": "Contains feature evidence metadata for removing a duplicate volume input in PreMeditationPage.",
  "frontend-file-summaries.txt": "Lists short summaries for all frontend files including routing, pages, components, hooks, and styles.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Provides step‑by‑step instructions for redeploying the app without code changes.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template for diagnosing deployment failures across build and deploy stages.",
  "frontend/index.css": "Defines OKLCH-based theme variables for light/dark modes and applies global Tailwind styles.",
  "frontend/index.html": "HTML entry point with runtime shims, global error handlers, and script bootstrap.",
  "frontend/src/App.tsx": "Sets up routing, theme provider, error boundary, and root React app structure.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel for ambient sounds with audio preview, swipe navigation, mute/volume handling, and cleanup logic.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a detailed fallback UI with error, stack, component trace, and a reload button.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Destructive alert banner for sync/load errors with retry button and optional custom title and description.",
  "frontend/src/components/FeatureCard.tsx": "Empty file with no implemented component.",
  "frontend/src/components/FloatingNav.tsx": "Floating vertical nav with animated icon buttons that navigate to different app sections and show labels on hover.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile slide-out menu providing theme toggle, account status, login/logout navigation, and authenticated query clearing.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Paginated reader for knowledge pages with swipe, keyboard navigation, animated transitions, and auto-scrolling to content.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel that highlights one category at a time with swipe, keyboard navigation, and dynamic scaling/opacity for surrounding items.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Dialog presenting a shuffled multi-question quiz with tracked answers, navigation, scoring, result view, and retake/reset logic.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus model that animates petals, stem, and glow based on a growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Three.js particle system around the lotus that animates in chaotic or coherent patterns depending on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "A full-screen canvas effect rendering animated lotus petals and particles with theme- and variant-based visibility scaling.",
  "frontend/src/components/MeditationCarousel.tsx": "A swipeable, cyclic carousel for selecting meditation types with animated card positioning.",
  "frontend/src/components/MeditationGuideStepper.tsx": "A step-by-step meditation guide with swipe navigation, animated transitions, and optional benefits parsing.",
  "frontend/src/components/MobileBackButton.tsx": "A mobile-only floating back button that navigates users to the dashboard.",
  "frontend/src/components/PageBackgroundShell.tsx": "A layout wrapper that applies page-wide background styling and renders the LotusCanvas behind child content.",
  "frontend/src/components/ProgressBowl.tsx": "A canvas-based animated bowl visualization showing meditation minutes as rising liquid with glow effects.",
  "frontend/src/components/ProgressLotusR3F.tsx": "A 3D lotus growth visualization using React Three Fiber with lights, particles, and an auto-rotating camera.",
  "frontend/src/components/ProgressLotusSVG.tsx": "An SVG lotus that animates breathing, glow, and multi-layer petal growth based on total minutes and streak.",
  "frontend/src/components/QuizDialog.tsx": "Interactive quiz dialog that asks five meditation-related questions, tracks answers, navigates between questions, and computes a recommended meditation type.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal that displays up to five saved rituals and lets the user start or delete them, with empty-state handling.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel component for browsing, starting, and deleting saved rituals with swipe, navigation, and confirmation dialog support.",
  "frontend/src/components/SessionIndicator.tsx": "Displays login or guest status and provides logout or return-to-start actions, clearing cached queries on logout.",
  "frontend/src/components/StandardPageNav.tsx": "Page navigation bar with theme toggle, back buttons, and session indicator for both desktop and mobile layouts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout methods, and initializes AuthClient with stored or new identities.",
  "frontend/src/hooks/useMeditationTimer.ts": "Implements a countdown meditation timer with pause, seek, progress tracking, and completion callback.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for meditation data, including mock meditation types, daily quotes, and session recording with guest fallbacks.",
  "frontend/src/index.css": "Configures Tailwind styles, OKLCH color themes for light/dark modes, and custom animation utilities.",
  "frontend/src/lib/bookData.ts": "Exports a list of recommended meditation-related books enriched with Amazon links and metadata.",
  "frontend/src/lib/knowledgeContent.ts": "Defines interfaces for quiz and technique content and exports detailed mindfulness technique data including pages and quiz questions.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty page placeholder with no implemented content.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays swipeable book recommendation cards with theme toggle, navigation, and gesture handling.",
  "frontend/src/pages/DashboardPage.tsx": "Main user dashboard showing quotes, meditation options, rituals, theme toggle, and quiz handling.",
  "frontend/src/pages/JournalPage.tsx": "Provides journal entry listing, filtering, editing, import/export, and favorite toggling.",
  "frontend/src/pages/KnowledgePage.tsx": "Shows meditation technique content with category switching, scrolling, and quiz functionality.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with theme toggle, login flow, guest mode, animated UI, and auto-redirect for authenticated users.",
  "frontend/src/pages/PreMeditationPage.tsx": "Pre-meditation setup page featuring mood/energy selection, guides, ambient sound picker, timers, and cloud-synced session preparation.",
  "frontend/src/pages/ProgressPage.tsx": "Displays user meditation progress, ranks, streaks, and supports cloud export/import with error handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty placeholder file for a reflection page.",
  "frontend/src/pages/StatsPage.tsx": "Empty placeholder file for a stats page.",
  "frontend/src/utils/cloudSync.ts": "Utilities for cloud sync readiness checks and mapping backend errors to user-friendly messages.",
  "frontend/src/utils/exportImport.ts": "Handles serialization and deserialization of meditation data for safe JSON export/import, including validation and bigint handling.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Local storage management for knowledge quiz scores, supporting guest and authenticated users.",
  "frontend/src/utils/lotusGrowthModel.ts": "Computes lotus growth visualization parameters over a 0–20,000 minute scale using phases, smooth transitions, and layered bloom states.",
  "frontend/src/utils/meditationStorage.ts": "Manages guest‑mode meditation data in localStorage, including journal entries, progress tracking, and legacy data migration.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers based on total meditation minutes and provides helpers to get current/next rank and minutes until upgrade.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL/query parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, shadows, radii, and container settings with theme‑driven design tokens.",
  "project_state.json": "Project metadata outlining current issues, feature requests, and state for UI fixes across meditation‑related pages."
}