{
  "backend/main.mo": "Defines actor data types for books, meditation sessions, journals, user profiles, rituals, and progress tracking along with initial book data.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their purpose and functionality.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Runbook outlining prerequisites and step-by-step instructions for redeploying the frontend and backend.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template for diagnosing deployment failures with checklists for each deployment phase.",
  "frontend/index.css": "Defines Tailwind base styles and theme variables for light and dark modes with OKLCH color values.",
  "frontend/index.html": "HTML entry point setting up error handlers, environment shims, and loading the React app root.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, global theme provider, error boundary, and toast system for the app.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel for selecting ambient audio tracks with swipe, volume, and mute controls, managing playback via an Audio element.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays a detailed error screen with stack traces and reload option.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Destructive alert banner for cloud sync errors with a retry button and loading state.",
  "frontend/src/components/DashboardBackButton.tsx": "Provides fixed-position back buttons for navigating to the dashboard on mobile and desktop.",
  "frontend/src/components/ExportImportControls.tsx": "Floating UI controls for exporting and importing JSON data with loading indicators.",
  "frontend/src/components/FeatureCard.tsx": "Empty component file with no implementation.",
  "frontend/src/components/FloatingNav.tsx": "Vertical floating navigation bar with hover labels and animated icons linking to main app sections.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile slide-out menu providing theme toggle, authentication actions, and navigation, integrated with Internet Identity.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Paged content viewer with keyboard, swipe navigation, and auto-scrolling between pages.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel component for category selection with swipe, keyboard, and animated card positioning.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Quiz dialog that shuffles questions, tracks answers, navigates between them, and shows results.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus model that animates petals, stem, and center glow based on growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Three.js particle system around the lotus that animates in coherent or chaotic patterns depending on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas-based animated lotus and particle effect with theme- and variant-based visual intensity.",
  "frontend/src/components/MeditationCarousel.tsx": "Meditation selector carousel with swipe navigation and animated centered card display.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Stepper component for meditation guide steps with swipe navigation, animations, and parsed content.",
  "frontend/src/components/MeditationTimerRing.tsx": "Canvas-based circular timer with animated wave edge, glow effect, and theme-aware styling.",
  "frontend/src/components/MeditationTimerWaveFill.tsx": "Canvas wave-fill animation showing vertical progress with dynamic wave motion and centered time text.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that navigates to the dashboard when tapped.",
  "frontend/src/components/PageBackgroundShell.tsx": "Page wrapper that applies a themed background and renders an animated LotusCanvas behind children.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered bowl that fills with animated liquid based on total meditation minutes and theme colors.",
  "frontend/src/components/ProgressLotusR3F.tsx": "3D lotus visualization using React Three Fiber that grows and animates based on total meditation minutes.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG-based animated lotus whose petals, glow, and breathing effects respond to growth state and streak.",
  "frontend/src/components/QuizDialog.tsx": "Multi-step quiz dialog that collects answers and computes a recommended meditation type.",
  "frontend/src/components/RitualSelectionModal.tsx": "Displays a modal listing up to five saved rituals and allows starting or deleting one, with an empty state when none exist.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Renders a swipeable carousel of saved rituals with start and delete actions, including confirmation handling and swipe navigation.",
  "frontend/src/components/SessionIndicator.tsx": "Shows login state and provides logout or return-to-start actions based on Internet Identity authentication.",
  "frontend/src/components/StandardPageNav.tsx": "Provides standard page navigation with optional back button, theme toggle, session indicator, and mobile hamburger menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for managing Internet Identity auth, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useMeditationTimer.ts": "Implements a countdown meditation timer with pause, seek, progress calculation, and completion callback.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching meditation types, quotes, and other app data with fallbacks and guest storage handling.",
  "frontend/src/index.css": "Sets global Tailwind layers, themes, OKLCH color tokens, and custom animations for styling.",
  "frontend/src/lib/bookData.ts": "Exports a list of recommended meditation-related books with metadata and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Contains structured educational content and quizzes for various meditation techniques.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty or placeholder file for an active meditation page.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Page showing swipeable book recommendations with theme toggle, navigation, and animated card transitions.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying quotes, meditation options, rituals, and navigation with quiz and ritual modals.",
  "frontend/src/pages/JournalPage.tsx": "Journal management page supporting search, filtering, editing, favoriting, deleting, and importing/exporting entries.",
  "frontend/src/pages/KnowledgePage.tsx": "Knowledge base page with category carousel, technique content, quiz tracking, and deep-link scrolling.",
  "frontend/src/pages/LandingPage.tsx": "Landing page handling login, guest mode, theme toggle, and redirecting authenticated users to the dashboard.",
  "frontend/src/pages/PreMeditationPage.tsx": "Page handling meditation setup, active session, and reflection workflow with timers, rituals, guides, and mood/energy logging.",
  "frontend/src/pages/ProgressPage.tsx": "Displays user meditation stats, streaks, and progress visuals with import/export and cloud sync error handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty page placeholder for future reflection content.",
  "frontend/src/pages/StatsPage.tsx": "Empty page placeholder for future stats display.",
  "frontend/src/utils/cloudSync.ts": "Provides standardized cloud‑sync error mapping, readiness checks, and utility helpers for backend communication.",
  "frontend/src/utils/exportImport.ts": "Implements JSON serialization and deserialization for exporting and importing meditation data with validation and bigint handling.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages storing and retrieving quiz scores in localStorage with user identity support.",
  "frontend/src/utils/lotusGrowthModel.ts": "Calculates lotus growth visualization parameters from total meditation minutes using multi‑phase progression logic.",
  "frontend/src/utils/meditationStorage.ts": "Provides localStorage helpers for guest journal entries, progress data, and rituals with validation and CRUD utilities.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers based on total meditation minutes and utilities to compute current, next, and formatted rank info.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters for routing and state management.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, radii, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Project state JSON describing current meditation app features, requirements, and UI/UX update summaries."
}