{
  "backend/main.mo": "Defines core backend types for books, meditation sessions, journal entries, rituals, user profiles, and progress, plus initial book data.",
  "feature_evidence.json": "Lists feature evidence entries linking feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides short descriptions of key frontend files, summarizing their roles and recent UI/logic updates.",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Instructions for redeploying the app, including prerequisites and standard build/deploy steps.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Template for diagnosing deployment issues across install, backend, build, and runtime phases.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Base HTML entry with environment shims, global error handlers, and bootstrapping of the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all app routes and wraps the app in theme and error boundary providers.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel component for selecting ambient audio tracks with swipe navigation, mute control, and volume-adjusted playback.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and displays diagnostic info with a reload option.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Error banner showing cloud sync issues with contextual messaging and a retry button.",
  "frontend/src/components/DurationRangeInput.tsx": "Slider-based input for selecting a duration value within a configurable minute range.",
  "frontend/src/components/FeatureCard.tsx": "Empty file with no implementation.",
  "frontend/src/components/FloatingNav.tsx": "Floating vertical navigation menu with animated icons and hover labels for major app sections.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile sidebar menu providing theme toggle, account state handling, navigation, and logout actions.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "Filter panel for journals offering mood, energy, date, text, and favorites filtering via dropdown controls.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Interactive pager that displays category pages with swipe, keyboard, and animated transitions, resetting on category change.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "Carousel for selecting knowledge categories with circular navigation, keyboard and swipe support, and styled card positioning.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "Quiz dialog that shuffles questions, tracks answers, shows progress and results, and supports retaking.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "Three.js lotus flower model that animates petals, glow, and growth based on a LotusGrowthState.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "Renders animated particle effects around the lotus, switching between chaotic and coherent modes based on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "Canvas-based animated lotus with particles and theme‑dependent visual intensity.",
  "frontend/src/components/MeditationCarousel.tsx": "Carousel for choosing meditation types with swipe, looping navigation, and scaled centered cards.",
  "frontend/src/components/MeditationGuideStepper.tsx": "Interactive stepper with swipe, dot navigation, and content parsing for main text and benefits.",
  "frontend/src/components/MeditationTimerRing.tsx": "Canvas-based animated circular timer with wave effects and theme‑responsive colors.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Canvas fill indicator showing animated waves inside a circular clip, reflecting progress.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button that optionally triggers a callback and navigates to the dashboard.",
  "frontend/src/components/PageBackgroundShell.tsx": "Wrapper providing page background and rendering a LotusCanvas behind children.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-rendered glowing bowl that fills with animated liquid based on total minutes.",
  "frontend/src/components/ProgressLotusR3F.tsx": "3D React Three Fiber lotus visualization with lights, particles, and auto-rotation based on growth state.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG lotus with animated breathing, glow, and multi-layer petals driven by growth state and streak.",
  "frontend/src/components/QuizDialog.tsx": "Implements a multi-step quiz dialog that collects user answers and computes a recommended meditation type based on scoring logic.",
  "frontend/src/components/RitualSelectionModal.tsx": "Displays a modal listing up to five saved rituals and allows users to start or delete them.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Provides a swipeable carousel for browsing, starting, and deleting saved rituals with confirmation handling.",
  "frontend/src/components/SessionIndicator.tsx": "Shows login or guest status and provides logout or return-to-start actions with query cleanup.",
  "frontend/src/components/StandardPageNav.tsx": "Renders page navigation with theme toggle, back button, session indicator, and mobile menu support.",
  "frontend/src/components/ThemedToaster.tsx": "Wraps a themed toaster component enabling toast notifications with a close button.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCloudOperation.ts": "Provides a wrapper for cloud write operations with retry logic using the current actor and identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication state and actions.",
  "frontend/src/hooks/useMeditationTimer.ts": "A customizable meditation timer hook supporting pause, reset, progress tracking, and completion callbacks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend data such as books, quotes, profiles, journal entries, and guest-mode fallbacks.",
  "frontend/src/index.css": "Global styles using Tailwind, custom OKLCH themes, animations, and typography settings.",
  "frontend/src/lib/bookData.ts": "Exports static meditation book recommendations with metadata and Amazon links.",
  "frontend/src/lib/knowledgeContent.ts": "Defines interfaces for quiz questions and technique content and exports a data array of meditation techniques with pages and quizzes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays a swipeable carousel of book recommendations with theme handling and navigation controls.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with quotes, meditation selection, ritual management, and quiz routing.",
  "frontend/src/pages/JournalPage.tsx": "Implements a full journal interface with filtering, editing, favoriting, and import/export of entries.",
  "frontend/src/pages/KnowledgePage.tsx": "Shows meditation knowledge content with category selection, scrolling behavior, and quiz score tracking.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that handles theme toggling, Internet Identity login, guest mode, and redirects authenticated users to the dashboard.",
  "frontend/src/pages/PreMeditationPage.tsx": "Pre-meditation setup page with mood inputs, duration settings, ambient sound selection, detailed guides, and session start logic.",
  "frontend/src/pages/ProgressPage.tsx": "Progress dashboard showing stats, rank, streaks, and supports cloud import/export with error handling.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty placeholder page for reflections.",
  "frontend/src/pages/StatsPage.tsx": "Empty placeholder page for stats.",
  "frontend/src/utils/ambientSounds.ts": "Defines available ambient sounds and helper functions to fetch sound metadata and paths.",
  "frontend/src/utils/cloudSync.ts": "Maps backend/cloud-sync errors to user-friendly messages and classifies error types.",
  "frontend/src/utils/cloudSyncRetry.ts": "Provides retry logic for cloud operations with readiness and authorization checks.",
  "frontend/src/utils/exportImport.ts": "Converts backend meditation data into a JSON-safe export format with bigint handling and includes validators for meditation, mood, and energy types.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages storing and retrieving user or guest knowledge quiz scores in localStorage with hooks for React.",
  "frontend/src/utils/lotusGrowthModel.ts": "Calculates lotus growth visualization parameters based on total meditation minutes using phased thresholds and smooth interpolation.",
  "frontend/src/utils/meditationStorage.ts": "Provides guest-only localStorage management for journal entries, progress data, and rituals with legacy key migration.",
  "frontend/src/utils/meditationType.ts": "Validates and normalizes meditation type strings, including alias handling, defaulting to mindfulness.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers for progress based on total minutes and helpers to query current, next, and displayable rank info.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, scanning project files, and extending theme with custom OKLCH color tokens, shadows, and radius settings.",
  "project_state.json": "Project state metadata describing UI refinement tasks, feature requirements, and a known issue with the meditation time slider."
}