{
  "backend/main.mo": "Main Motoko actor defining types (Book, JournalEntry, UserProfile, MeditationSession, ProgressStats, Ritual, etc.) and a static list of meditation books with metadata, integrating AccessControl, Storage, and authorization/storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting two UI features: restoring the back button visibility in the meditation page and matching button dimensions in the pre-meditation page, both targeting PreMeditationPage.tsx with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including App.tsx (router setup), pages (Landing, Dashboard, PreMeditation), components (LotusCanvas, FeatureCard, MeditationCarousel, FloatingNav), hooks (useQueries), and configuration files (index.css with OKLCH colors, tailwind.config.js).",
  "frontend/DEPLOYMENT_RUNBOOK.md": "Step-by-step deployment instructions for redeploying the Inner Bloom app without code changes, covering prerequisites and standard redeploy steps starting with cleaning the build environment.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Structured troubleshooting template for diagnosing deployment failures across stages: dependency installation, backend/frontend deployment, Candid generation, build, and runtime errors.",
  "frontend/index.css": "Global Tailwind styles with OKLCH color system for light/dark themes, custom CSS variables for UI tokens, and base layer configurations for consistent theming across the app.",
  "frontend/index.html": "HTML entry point with favicon, early-runtime process.env shim for compatibility, and global error handlers to capture deployment/runtime failures for debugging.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes (landing, dashboard, pre-meditation, progress, journal, books, knowledge), wrapped in ThemeProvider, AppErrorBoundary, and ThemedToaster.",
  "frontend/src/components/AmbientMusicCarousel.tsx": "Carousel component for selecting ambient sounds with prev/next navigation, touch swipe support, audio playback with volume control, mute toggle, and automatic audio cleanup on unmount or selection change.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary component that catches and displays application errors with stack traces, component stacks, and a reload button.",
  "frontend/src/components/CloudSyncErrorBanner.tsx": "Alert banner component that displays cloud sync errors with customizable messages for different error types (authorization, readiness, network) and a retry button.",
  "frontend/src/components/DurationRangeInput.tsx": "Slider input component for selecting duration in minutes with configurable min/max values and 5-minute step increments.",
  "frontend/src/components/FeatureCard.tsx": "Empty file with no content.",
  "frontend/src/components/FloatingNav.tsx": "Fixed-position vertical navigation menu with animated floating icons for Journal, Progress, Books, and Knowledge sections, featuring hover tooltips.",
  "frontend/src/components/HamburgerMenu.tsx": "Mobile hamburger menu sheet component with theme toggle, authentication status display, and logout functionality that clears query cache.",
  "frontend/src/components/JournalFiltersDropdown.tsx": "Comprehensive filter component for journal entries with dropdowns for moods, energy levels, date ranges, favorites, and text search with active filter count badge.",
  "frontend/src/components/KnowledgeBookPager.tsx": "Paginated book reader component with swipe gestures, keyboard navigation, dot indicators, and smooth scrolling between pages with slide animations.",
  "frontend/src/components/KnowledgeCategoryCarousel.tsx": "A carousel component for displaying knowledge categories with touch/keyboard navigation, showing a centered selected card with adjacent cards partially visible on either side. Implements circular positioning logic with smooth transitions and swipe gestures.",
  "frontend/src/components/KnowledgeQuizDialog.tsx": "A modal dialog component for displaying quiz questions with multiple choice answers, progress tracking, navigation between questions, and results display. Shuffles questions on open and allows retaking the quiz.",
  "frontend/src/components/lotus-r3f/LotusModel.tsx": "React Three Fiber component rendering an animated 3D lotus flower with petals, stem, and center glow that responds to growth state and theme.",
  "frontend/src/components/lotus-r3f/LotusParticles.tsx": "React Three Fiber component rendering animated particles around the lotus that transition between chaotic brownian motion and coherent orbital patterns based on growth state.",
  "frontend/src/components/LotusCanvas.tsx": "A canvas-based animated background component that renders a breathing lotus flower with petals and floating particles. Supports multiple variants (default, enhanced, premed) with theme-aware visibility adjustments and configurable intensity.",
  "frontend/src/components/MeditationCarousel.tsx": "A carousel component for selecting meditation types (mindfulness, metta, visualization, IFS, quiz) with circular navigation and touch swipe support. Displays cards with icons and taglines, showing center card prominently with adjacent cards partially visible.",
  "frontend/src/components/MeditationGuideStepper.tsx": "A step-by-step guide component with dot indicators, navigation buttons, and touch swipe support. Parses and displays step content with optional benefits section highlighted in a styled callout box.",
  "frontend/src/components/MeditationTimerRing.tsx": "Animated canvas-based circular progress ring for meditation timer with wave effects, glow, and theme-aware colors that animates continuously using requestAnimationFrame.",
  "frontend/src/components/MeditationWaveFillIndicator.tsx": "Canvas component rendering a circular container with animated wave fill that rises from bottom to top based on progress, with theme-aware colors and continuous wave animation.",
  "frontend/src/components/MobileBackButton.tsx": "Mobile-only back button component that navigates to dashboard, positioned fixed in top-left with icon and optional custom onBack handler.",
  "frontend/src/components/PageBackgroundShell.tsx": "Layout wrapper component that renders LotusCanvas background with configurable variant and intensity, plus gradient background for dark theme.",
  "frontend/src/components/ProgressBowl.tsx": "Canvas-based animated bowl visualization that fills with liquid based on total meditation minutes (capped at 20000), featuring wave effects and theme-aware glow.",
  "frontend/src/components/ProgressLotusR3F.tsx": "React Three Fiber 3D lotus visualization with orbit controls, lighting, particles, and growth state calculated from total meditation minutes.",
  "frontend/src/components/ProgressLotusSVG.tsx": "SVG-based lotus flower visualization with multi-layer petals that grow, open, and glow based on meditation minutes and streak, featuring breathing animation and theme-aware colors.",
  "frontend/src/components/QuizDialog.tsx": "Multi-step quiz dialog with 5 questions to recommend meditation type (mindfulness, metta, visualization, or IFS) based on user's emotional state and goals.",
  "frontend/src/components/RitualSelectionModal.tsx": "Modal dialog component that displays saved meditation rituals in a carousel, allowing users to select and start a ritual or showing an empty state if no rituals exist.",
  "frontend/src/components/SavedRitualsCarousel.tsx": "Carousel component for browsing saved meditation rituals with navigation controls, touch/swipe support, and delete functionality with confirmation dialog.",
  "frontend/src/components/SessionIndicator.tsx": "Fixed-position UI component showing authentication status (guest or logged in) with logout/return-to-start buttons and query cache cleanup on logout.",
  "frontend/src/components/StandardPageNav.tsx": "Navigation component providing back button, theme toggle, session indicator, and hamburger menu with responsive desktop/mobile layouts.",
  "frontend/src/components/ThemedToaster.tsx": "Wrapper component that renders the Sonner toast notification system with close button enabled.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCloudOperation.ts": "Composition hook providing a retry-aware wrapper for cloud write operations using the current actor and identity refs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMeditationTimer.ts": "Custom React hook that manages meditation timer state with play/pause, reset, seek, and duration controls, calculating progress and formatting time display.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data (books, quotes, journal entries, meditation sessions, progress stats, rituals) with guest mode fallback to local storage and cloud sync error handling.",
  "frontend/src/index.css": "Global styles with Tailwind CSS, OKLCH color system for light/dark themes, custom CSS animations (fade-in, breathe, glow-pulse, float, wave), and Playfair Display font import.",
  "frontend/src/lib/bookData.ts": "Static data array of meditation book recommendations with titles, authors, descriptions, Amazon links, tags, and icons.",
  "frontend/src/lib/knowledgeContent.ts": "Defines structured content for meditation technique guides including mindfulness descriptions, multi-page educational content, and quiz questions (content appears truncated).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/ActiveMeditationPage.tsx": "File content is empty or missing.",
  "frontend/src/pages/BookRecommendationsPage.tsx": "Displays a carousel of book recommendations with swipe/navigation controls, theme toggle, and session indicator. Fetches book data from BOOK_RECOMMENDATIONS and supports circular navigation with touch gestures.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing meditation carousel, daily quotes, and ritual selection. Handles navigation to pre-meditation page with quiz dialog, ritual modal, and supports starting meditations with saved ritual configurations.",
  "frontend/src/pages/JournalPage.tsx": "Journal entries page with filtering, editing, favoriting, and delete functionality. Supports data import/export, cloud sync error handling, and displays entries with mood/energy icons and reflection text.",
  "frontend/src/pages/KnowledgePage.tsx": "Knowledge library page displaying meditation technique content with category carousel, book pager, and quiz dialog. Manages quiz scores, supports deep-linking to content, and syncs category selection with URL search params.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with Internet Identity login, guest mode option, and theme toggle. Automatically redirects authenticated users to dashboard and displays animated hero content with lotus canvas background.",
  "frontend/src/pages/PreMeditationPage.tsx": "Main meditation setup page with timer controls, mood/energy tracking, ambient sound selection, meditation type guides, and ritual saving. Handles session recording, journal entry creation, and ritual management with cloud sync error handling.",
  "frontend/src/pages/ProgressPage.tsx": "Progress tracking page displaying meditation stats (total minutes, streak, rank) with data import/export functionality. Includes cloud sync error handling and confirmation dialogs for data operations.",
  "frontend/src/pages/ReflectionPage.tsx": "Empty file with no content.",
  "frontend/src/pages/StatsPage.tsx": "Empty file with no content.",
  "frontend/src/utils/ambientSounds.ts": "Defines ambient sound data structure and provides lookup functions for meditation audio tracks (temple bells, singing bowl, rain, ocean, etc.).",
  "frontend/src/utils/cloudSync.ts": "Centralized cloud sync error handling with standardized error codes and user-friendly messages for actor readiness, authentication, network, validation, and ritual-specific errors.",
  "frontend/src/utils/cloudSyncRetry.ts": "Provides retry logic wrapper for cloud operations with automatic readiness checks, distinguishing between retryable readiness errors and non-retryable authorization errors.",
  "frontend/src/utils/exportImport.ts": "Handles serialization and deserialization of meditation data (journal entries, sessions, stats, rituals) for export/import with bigint-safe JSON format and type validation.",
  "frontend/src/utils/knowledgeQuizStorage.ts": "Manages local storage of quiz scores per user/guest with principal-based storage keys and provides React hook for accessing and saving quiz scores.",
  "frontend/src/utils/lotusGrowthModel.ts": "Defines the lotus growth model that maps totalMinutes (0-20,000) to visual parameters including phase progression, petal layers, geometric maturity, vividness, particle effects, and breathing animations.",
  "frontend/src/utils/meditationStorage.ts": "Provides localStorage utilities for guest-only meditation data including journal entries, progress tracking, and rituals, with legacy data migration support.",
  "frontend/src/utils/meditationType.ts": "Validates and coerces meditation type strings to the MeditationType enum, handling aliases like 'meta' for 'metta' and defaulting to mindfulness.",
  "frontend/src/utils/progressRanks.ts": "Defines rank tiers (Droplet to Infinite Waters) based on total meditation minutes (0-20,000+) and provides functions to calculate current rank, next rank, and progress.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and parameter cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, container settings, border radius variables, custom shadows including glow effects, and plugin integrations.",
  "project_state.json": "Project state tracking three known issues: reversed time slider behavior, missing back button in meditation page, and mismatched button dimensions in pre-meditation page."
}