{
  "kind": "build_request",
  "title": "Fix Pre-Meditation page button label overflow and active meditation controls UI",
  "projectName": "Meditation App",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the Pre-Meditation page, change the \"More Details\" button label text to exactly \"More Details\" (English) to prevent overflow on small screens, while keeping the same link destination/behavior as before.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "In pre-med page, the more-details button, should just say \"More Details\", because now it says \"More Details in Knowledge Base\", and it overflows on lower screens .",
          "1. Yes, still link the same"
        ]
      },
      "acceptanceCriteria": [
        "In the Pre-Meditation page UI, the button text reads exactly \"More Details\".",
        "Clicking the button navigates to the same destination as before (Knowledge page deep link behavior remains unchanged).",
        "On small/mobile widths, the button label no longer overflows its container."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the active meditation session view, update the Play/Pause control to render as a circular (round) icon button rather than a square button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "meditation session page, has a play/pause button that is squared shape, it should be round/circle instead."
        ]
      },
      "acceptanceCriteria": [
        "The Play/Pause button is visually circular (equal width/height with fully rounded corners).",
        "The Play/Pause icon remains centered within the circular button across responsive breakpoints."
      ]
    },
    {
      "id": "REQ-3",
      "text": "On the active meditation session view, left-align the labels for the Volume control and the Adjusting Time control so each label sits above-left and is aligned to the left edge of its corresponding control container.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "the labels above control inputs, are above, but they are not quite above left, they are not alligned with left side of containers at all. Fix that.",
          "2. The labels that are for control input volume, and the control input adjusting time."
        ]
      },
      "acceptanceCriteria": [
        "The Volume label is positioned above its control container and its left edge aligns with the container's left edge.",
        "The Adjusting Time label is positioned above its control container and its left edge aligns with the container's left edge.",
        "Label alignment remains correct on small screens and larger screens (no drift/misalignment)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Fix the Adjusting Time slider in the active meditation session view so the thumb position and track fill respond visually in the expected left-to-right direction (dragging left shows the thumb on the left; dragging right shows the thumb on the right; left corresponds to less time and right to more time).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "make adjusting time control input, respond properly visually thumb, as I control it, the visual control is reversed. For instance, if I drag to left side, the visual thumb appears on the right side and vice versa.",
          "3. Yes, left = less time etc."
        ]
      },
      "acceptanceCriteria": [
        "Dragging the Adjusting Time slider thumb to the left moves the thumb visually left and results in a smaller time value.",
        "Dragging the Adjusting Time slider thumb to the right moves the thumb visually right and results in a larger time value.",
        "No inverted/RTL visual behavior remains (thumb position and filled track correspond to the selected value)."
      ]
    }
  ],
  "constraints": [
    "Do not change the navigation destination/behavior of the Pre-Meditation \"More Details\" button; only change its displayed label text.",
    "Use English for any user-facing text changes."
  ],
  "nonGoals": [
    "No backend/Motoko changes.",
    "No changes to unrelated UI elements outside the specified button/controls."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}