{
  "kind": "build_request",
  "title": "Place “More details” button at bottom of the guide container on Pre‑Meditation page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Pre‑Meditation page layout so the “More details” button with id '1dl1fqs' is positioned at the bottom of the guide container within the parent container '1j6s3jt' (the selected element at XPath `/html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[3]`). The button should remain at the bottom of that container regardless of guide content height (i.e., guide content above, button pinned to the bottom).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "'1dl1fqs' (More details btn) should be place at the bottom of guide container as mentioned in point 1(1. \"1j6s3jt\" parent container that holds guide, including more details btn)"
        ]
      },
      "acceptanceCriteria": [
        "On the Pre‑Meditation page, within the guide parent container '1j6s3jt', the '1dl1fqs' “More details” button renders at the bottom edge of that container (visually below the guide content).",
        "When the guide content height changes (short vs. long text), the '1dl1fqs' button remains at the bottom of the container and does not float mid-container.",
        "The button continues to perform its existing navigation behavior (redirect to Knowledge page) without introducing regressions."
      ]
    }
  ],
  "constraints": [
    "Apply changes only to the selected element scope (/html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[3]) for this prompt; do not modify unrelated elements/features."
  ],
  "nonGoals": [
    "Do not change the notification element 't4f3jw' styling in this build.",
    "Do not change the timer canvas waveform behavior for '1iwj49n' in this build.",
    "Do not change the duration range input 'bpmktq' behavior in this build.",
    "Do not change the “Begin meditation” button 'cigrx0' padding in this build."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}