{
  "kind": "build_request",
  "title": "Pre-meditation UI polish: move More Details button, enlarge sliders, and restyle play/pause",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "On the pre-meditation setup view (PreMeditationPage when phase is \"setup\"), move the \"More Details\" button so it is centered at the bottom of the meditation guide container (not positioned at the top-right).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In pre-meditation page, \"More Details\" button. Should be at the bottom of guide container, instead how it is now at the top right.",
          "1. Centered at the bottom of the guide container, yes"
        ]
      },
      "acceptanceCriteria": [
        "When viewing the pre-meditation page in setup phase, the \"More Details\" button is visually located at the bottom edge of the guide container.",
        "The \"More Details\" button is horizontally centered within the guide container.",
        "The \"More Details\" button still triggers the existing navigation behavior (to the Knowledge page with the current meditation type)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "On the in-session meditation view (PreMeditationPage when phase is \"active\"), increase the size of the two standard slider control containers (volume and time/seek) so they are easier to use (e.g., larger container height and/or padding) while keeping them as standard slider inputs and preserving their current behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In meditation page(when user meditates/in a session), 2 inputs, one for volume controlling, and other time controlling, should have a little bigger containers, they are too small as of now, increase maybe padding?",
          "Remain standard input sliders"
        ]
      },
      "acceptanceCriteria": [
        "In active phase, both the volume and seek/time slider areas have noticeably larger hit/visual area than before (increased padding and/or container sizing).",
        "Both controls remain standard slider inputs (no knob/dial replacement).",
        "Changing the volume slider still updates ambient audio volume as before.",
        "Changing the seek/time slider still adjusts the session time as before."
      ]
    },
    {
      "id": "REQ-8",
      "text": "On the in-session meditation view (PreMeditationPage when phase is \"active\"), restyle the play/pause button so it better matches the app’s existing theme and also adjust its sizing/shape (not just colors).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "3. Yes, as well as play/pause btn",
          "1. Both, visual and sizing/shape."
        ]
      },
      "acceptanceCriteria": [
        "In active phase, the play/pause control has updated visual styling consistent with the app’s existing meditation theme (typography/colors/shadows consistent with other themed elements on the page).",
        "The play/pause control’s size and/or shape is changed (e.g., larger touch target and updated proportions), not just a color tweak.",
        "The button continues to toggle pause/resume exactly as before, including correctly switching the Play vs Pause icon."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose existing UI components instead).",
    "Do not change the control type for the in-session inputs: keep them as standard slider inputs.",
    "Keep all changes scoped to UI/layout/styling; no backend changes are required for these requests."
  ],
  "nonGoals": [
    "Do not introduce alternative control paradigms (e.g., circular knobs) for volume or time controls.",
    "Do not add new backend endpoints or data models as part of these UI adjustments.",
    "Do not change the meditation timer logic, audio selection logic, or navigation destinations beyond repositioning/restyling UI elements."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}