{
  "kind": "build_request",
  "title": "Add back button on meditation view and replace timer with bottom-to-top wave fill indicator",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a back button to the active meditation view (the in-session screen) that navigates back to the pre-meditation page route (`/pre-meditation`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "I want you to add back button also in meditation page.",
          "1. pre-meditation page yes"
        ]
      },
      "acceptanceCriteria": [
        "When the user is in the active meditation view, a visible back button is present.",
        "Clicking/tapping the back button navigates to `/pre-meditation` using TanStack Router navigation.",
        "The back button has an accessible label in English (e.g., \"Back to setup\")."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the current meditation timer visual on the active meditation view with an animated, calm wave fill indicator that fills from bottom to top as time progresses (start empty at session start; half full at halfway point; fully filled when time remaining reaches 0).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "change timer, to be animated/filled from bottom to top with wave pattern that animates with loop smoothly and gets filled relative to total minutes left of meditation. 0 = fully filled",
          "Fill up as time progressed. let's say user has picked 15 minutes meditation. It will start empty, 7.5min left, would be half full,  0min left would be full."
        ]
      },
      "acceptanceCriteria": [
        "The indicator fill level is driven by the meditation session progress (0.0 at start, 1.0 at completion / 0 seconds remaining).",
        "The wave surface animates in a smooth, continuous loop (calm motion; no jitter or stutter under normal use).",
        "At 15 minutes chosen: session start renders empty; at 7:30 remaining renders ~50% filled; at 0:00 remaining renders 100% filled.",
        "The old ring-style timer visualization is no longer shown on the active meditation view."
      ]
    },
    {
      "id": "REQ-3",
      "text": "When the meditation duration or remaining time is adjusted (e.g., via seeking/setting controls), animate the fill level to the new target using an ease-in-out transition rather than jumping immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "just calm wave that fills based on time with ease-in-out if user adjusts the time"
        ]
      },
      "acceptanceCriteria": [
        "If the user adjusts the time (seek), the fill level transitions smoothly to the new level using an ease-in-out feel.",
        "The wave animation continues seamlessly during and after the fill-level transition."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not edit immutable hook files listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`).",
    "Keep all backend logic unchanged; this change is visual/navigation-only on the frontend."
  ],
  "nonGoals": [
    "Do not add new authentication methods or change Internet Identity behavior.",
    "Do not change meditation timer business logic (countdown/completion rules) beyond what is needed to drive the new visualization.",
    "Do not add new pages or routes beyond using the existing `/pre-meditation` route."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}