{
  "kind": "build_request",
  "title": "Ritual navigation controls + fix ritual duplicate toast + persist journal & progress correctly",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Add explicit left/right ritual navigation controls (arrow buttons/icons) that work on all screen sizes, and provide a user-controlled option to show/hide these ritual navigation buttons while keeping swipe navigation available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Now add buttons/icons/arrows left & right for ritual navigations, user should have an option for that too."
        ]
      },
      "acceptanceCriteria": [
        "On mobile and desktop, when the user has 2+ saved rituals, the UI provides visible left/right arrow controls that move to the previous/next ritual and stay in sync with swipe navigation and dot indicators.",
        "A user-facing toggle exists to enable/disable showing the ritual left/right arrow controls (default behavior must be defined and consistent).",
        "When the toggle is off, swipe navigation still works and the carousel remains usable.",
        "When the user has 0 or 1 ritual, navigation controls do not appear (or appear disabled) and do not cause layout glitches."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Fix the incorrect ritual-save error toast that shows \"This ritual already exists in your collection.\" when the user has no visible rituals, and ensure ritual duplicate detection/handling is consistent between guest (localStorage) and authenticated (backend) modes without cross-contamination.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "even I do not have any rituals, I get an notification error that \"This ritual already exists in your collection.\" Perhaps it has something to do with localstorage contradicting online data?"
        ]
      },
      "acceptanceCriteria": [
        "When a user has no rituals in the active mode (guest vs authenticated), saving a new ritual succeeds and shows a success toast (no duplicate toast).",
        "The duplicate toast \"This ritual already exists in your collection.\" is only shown when an exact duplicate ritual already exists in the active store for the current mode.",
        "Authenticated ritual save/list/delete operations never read from or write to guest localStorage keys, and guest ritual operations never call backend ritual endpoints.",
        "If a backend call fails for reasons other than a duplicate, the UI shows a generic failure toast (not the duplicate toast) and logs the underlying error to the console."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Implement authenticated journal persistence end-to-end so that completed meditation reflections are saved to the backend for logged-in users and reliably appear on the Journal page (including edit/delete/favorite toggle actions).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "my meditations, and their feedbacks, do not save in the journal page"
        ]
      },
      "acceptanceCriteria": [
        "When authenticated, saving a post-session reflection persists to the canister and the new entry appears on the Journal page after navigation/refresh.",
        "When authenticated, editing a journal entry reflection persists to the canister and is reflected after reload.",
        "When authenticated, deleting a journal entry removes it from the canister and the Journal page after reload.",
        "When authenticated, toggling favorite persists to the canister and the Journal page reflects the change after reload.",
        "Guest mode behavior remains localStorage-based and unchanged except for any necessary bug fixes requested in this build."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Fix authenticated progress persistence so that total minutes, streak, and monthly minutes update correctly after each session and reliably appear on the Progress page (and in exported backend data).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and progress page. Fix that too please"
        ]
      },
      "acceptanceCriteria": [
        "When authenticated, completing a meditation session increases the backend-stored lifetime total minutes by the session duration (does not overwrite lifetime totals with monthly minutes).",
        "When authenticated, the Progress page reflects updated total minutes and streak after completing a session and revisiting the Progress page.",
        "Monthly minutes represent minutes in the last 30 days (or the existing app definition) and do not incorrectly replace lifetime totals.",
        "Exporting data while authenticated includes the up-to-date backend progress stats and session records."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Do not add new authentication providers beyond Internet Identity.",
    "Do not add external databases or third-party storage.",
    "Do not introduce new pages/features unrelated to ritual navigation and persistence bugs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}