{
  "kind": "build_request",
  "title": "Update meditation setup/active/reflection UX and standardize nav controls",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the Pre-Meditation page, remove the meditation type carousel UI from the setup flow so users are not presented with the carousel-based meditation-type selector.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remove meditation carousel type from pre-meditation page."
        ]
      },
      "acceptanceCriteria": [
        "PreMeditationPage no longer renders the MeditationCarousel component in the setup UI.",
        "Meditation setup remains usable (user can still proceed into a meditation session without the type carousel being shown)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Re-introduce the step-by-step meditation guide UI in the Pre-Meditation setup flow, and add a clearly placed \"More details\" control that reveals additional guide content in an appropriate way (e.g., opening an in-page expanded view/dialog/drawer) without re-adding the meditation type carousel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And re-add in the step guides, more details btn in appropriate way."
        ]
      },
      "acceptanceCriteria": [
        "PreMeditationPage setup includes a step guide UI (using the existing MeditationGuideStepper) for the currently selected meditation type.",
        "A \"More details\" button is present near the step guide and, when activated, shows expanded guide information (not just a tooltip) and is dismissible.",
        "The step guide and \"More details\" feature work on both mobile and desktop layouts."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Standardize the Back button and Light/Dark theme toggle on the following pages by removing any page-specific back/theme controls (including DashboardBackButton and inline Moon/Sun buttons) and replacing them with the same navigation UI used on the Book and Knowledge pages (StandardPageNav): PreMeditationPage (setup/active/reflection views), Journal page (\"journey\"), and Progress page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also remove those light/dark theme and back buttons from pre-med, med, journey, progress pages. They should be replaced with the light and dark theme btn like they are in the book and knowledge pages, as well as back btn too!"
        ]
      },
      "acceptanceCriteria": [
        "PreMeditationPage uses StandardPageNav and does not render DashboardBackButton or its own theme toggle button.",
        "JournalPage uses StandardPageNav and does not render DashboardBackButton or its own theme toggle button.",
        "ProgressPage uses StandardPageNav and does not render DashboardBackButton or its own theme toggle button.",
        "Back navigation goes to /dashboard (matching StandardPageNav behavior) and theme toggle behavior matches StandardPageNav.",
        "No duplicate back/theme controls appear on any of the affected pages in either mobile or desktop breakpoints."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the active meditation experience so the meditation timer is circular rather than square by replacing the current square timer UI with the existing circular timer component (MeditationTimerRing) during the active meditation view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And meditation page, should have circular timer, instead of currently square."
        ]
      },
      "acceptanceCriteria": [
        "During active meditation, the timer display is circular (ring) rather than square/wave-fill.",
        "The timer continues to reflect the countdown correctly (time remaining and progress) and responds to pause/resume as before."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Change the post-meditation reflection flow so prompts are incremental and sequential: (1) prompt the user to select mood/icon state, then (2) prompt the user to select energy state icon, then (3) prompt the user to optionally write a note, optionally mark the session as favorite, and then save. Ensure validation only blocks progression where required (mood and energy required; note optional).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also after meditation is done, user should be prompted incrementely, first with selecting icon state, then energy state icon, and then only write note(optionally), mark it as favorite and save."
        ]
      },
      "acceptanceCriteria": [
        "After the meditation completes, the UI shows a step-based reflection flow where mood selection is shown first, energy selection second, and note/favorite/save last.",
        "User cannot advance past mood selection without selecting at least one mood.",
        "User cannot advance past energy selection without selecting an energy level.",
        "The note field is optional and can be left empty while still allowing save.",
        "Favorite can be toggled during the final step before saving.",
        "Saving creates the journal entry using the existing create flow and navigates to /dashboard on success (maintaining existing behavior), with errors surfaced via existing toast/error handling."
      ]
    }
  ],
  "constraints": [
    "Frontend paths listed as immutable in SYSTEM_CONTEXT must not be edited (compose existing UI components instead).",
    "Backend must remain single-actor; only introduce a migration if a persisted state/schema change is required."
  ],
  "nonGoals": [
    "Adding new authentication methods beyond Internet Identity.",
    "Introducing new backend services or external databases.",
    "Changing the backend journal entry schema unless strictly required for the new reflection step UI (the change requested can be implemented as a frontend flow)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}