{
  "kind": "build_request",
  "title": "Meditation UI refinements: stronger dashboard lotus background, boxed pre-meditation layout, and correct time scrubber behavior",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Increase the Dashboard page’s canvas-based background lotus and particle visibility/strength by ~20% compared to the current dashboard appearance, while keeping the background fully animated and non-interactive (pointer-events disabled).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "Background lotus with background particles which are both animated with canvas"
        ]
      },
      "acceptanceCriteria": [
        "On /dashboard, the lotus + particle canvas background appears ~20% more visible/intense than before (both lotus glow/petals and particles).",
        "The lotus/particles remain animated via canvas rendering, and the canvas remains non-interactive (does not block clicks/scroll)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the Pre-meditation setup UI (/pre-meditation, setup phase), group the ambient sound picker, the duration selector, and the primary actions (Begin and Save Ritual buttons) into a single clearly visible boxed container (card-style with background/border/shadow) that holds this content together.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "Ye, the ambient sound picker with duration selector and begin/save ritual buttons, should be in a single container."
        ]
      },
      "acceptanceCriteria": [
        "In setup phase on /pre-meditation, ambient sound selection + duration selection + Begin/Save Ritual actions are visually contained within one card/boxed container.",
        "The container is clearly distinguishable from the background (e.g., uses a surface/background color plus border and/or shadow)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "On the Pre-meditation setup UI (/pre-meditation, setup phase), place the meditation guide content into its own separate clearly visible boxed container, and add a bottom-centered button labeled \"More details\" that navigates to the Knowledge page for the currently selected meditation type (deep-linking to that technique’s content).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "and then meditation guide also should be in a single boxxed container where there is a button at the bottom center with more details which redirects to specific knowledge page."
        ]
      },
      "acceptanceCriteria": [
        "In setup phase on /pre-meditation, the meditation guide is inside a distinct card/boxed container separate from the ambient/duration/actions container.",
        "A bottom-centered button with English label \"More details\" is present within the guide container.",
        "Clicking \"More details\" navigates to /knowledge with the category corresponding to the current meditation type and triggers the existing deep-link scroll behavior to the content section."
      ]
    },
    {
      "id": "REQ-4",
      "text": "In the active meditation session UI (the active phase on /pre-meditation), update the play/pause control so the button is round (circular) rather than square/rectangular, while keeping the icon and action behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "meditation page, has a pause/play button which looks like a square, it should be round instead"
        ]
      },
      "acceptanceCriteria": [
        "During an active meditation session, the play/pause button renders with a circular shape (equal width/height and fully rounded corners).",
        "Tapping the button still correctly toggles between pause and play behavior."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Fix the active meditation time scrubber so it behaves like a standard media scrubber: dragging the thumb from right to left decreases the remaining time and dragging left to right increases the remaining time; updates must be immediately reactive (thumb position and displayed time update consistently) and allow controlling minutes+seconds at any moment during the session (paused or playing).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "drag from right to left, it decreases time. Let's say user has selected 15 minutes, he can manage at any point meditation those 15 minutes and seconds. It's similar to how youtube player works, you can control time with range input."
        ]
      },
      "acceptanceCriteria": [
        "In active phase, the time scrubber direction is correct: moving the thumb left reduces remaining time; moving it right increases remaining time.",
        "The displayed remaining time (mm:ss) and the scrubber thumb stay in sync while dragging (no reversed visual behavior).",
        "Seeking works while the timer is running and while paused, and updates the session state immediately (remaining time and progress visuals update accordingly)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose these components instead).",
    "Keep the backend as a single Motoko actor; no backend changes are required for these UI-only adjustments."
  ],
  "nonGoals": [
    "Do not add new authentication providers or external services.",
    "Do not introduce new routes beyond using the existing /knowledge deep-linking behavior.",
    "Do not redesign unrelated pages (Landing/Journal/Progress/Books) beyond the specified UI changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}