{
  "kind": "build_request",
  "title": "Adjust in-session volume/time input labels & padding; move pre-meditation guide to page bottom",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the in-session meditation view (PreMeditationPage when phase is \"active\"), update the Volume and Time/Seek slider sections so their labels render at the top-left outside the slider container and use a larger font size (in pixels) than the current label styling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Input that controls volume of the picked ambient sound, and input that controls time"
        ]
      },
      "acceptanceCriteria": [
        "When phase === \"active\", the Volume control label is positioned at the top-left outside the visual container that wraps the volume slider.",
        "When phase === \"active\", the Time/Seek control label is positioned at the top-left outside the visual container that wraps the time/seek slider.",
        "Both labels have a visibly larger font size than before and are set using a Tailwind px-based text size utility (e.g., text-[...]px).",
        "No changes to slider behavior (value changes, timer seek, audio volume) are introduced."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the in-session meditation view (PreMeditationPage when phase is \"active\"), update the container elements that hold the Volume and Time/Seek inputs to use Tailwind classes \"px-6 py-5\" and remove the \"premed-slider-container\" class from those containers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Basically add these classes for those containers that hold those inputs  px-6 py-5 , and remove this class premed-slider-container"
        ]
      },
      "acceptanceCriteria": [
        "In PreMeditationPage active-phase UI, the wrapper/container for the volume input includes \"px-6 py-5\".",
        "In PreMeditationPage active-phase UI, the wrapper/container for the time/seek input includes \"px-6 py-5\".",
        "In PreMeditationPage active-phase UI, neither container includes the \"premed-slider-container\" class.",
        "Layout reflects reduced vertical padding compared to the previous container styling while preserving consistent horizontal padding."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove or retire the \"premed-slider-container\" styling so it is no longer used by the Volume/Time containers after the class removal, ensuring there are no remaining references for these two controls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "remove this class premed-slider-container"
        ]
      },
      "acceptanceCriteria": [
        "There are no remaining \"premed-slider-container\" className usages for the in-session Volume and Time/Seek containers.",
        "If the CSS utility class block for \".premed-slider-container\" remains in frontend/src/index.css, it is not required by the in-session Volume/Time controls; alternatively, the unused CSS block is removed without causing visual regressions elsewhere."
      ]
    },
    {
      "id": "REQ-4",
      "text": "On the pre-meditation setup view (PreMeditationPage when phase is \"setup\"), move the meditation guide container (the guide/stepper content shown before starting a session) to be the last container in the page hierarchy (bottom of the setup page), below all other setup controls/sections.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Yes, pretty much"
        ]
      },
      "acceptanceCriteria": [
        "When phase === \"setup\", the meditation guide container renders after all other setup sections (e.g., meditation type info, duration/time selection, ambient sound selection, mood/energy selections, etc.).",
        "The guide container appears visually at the bottom of the setup page content (last section before the page ends), without overlapping other content.",
        "All existing guide functionality (step navigation, “More Details” button behavior if present) continues to work."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Keep all backend logic in the existing single Motoko actor (no new backend services)."
  ],
  "nonGoals": [
    "Do not change meditation timer logic, seek behavior, audio playback behavior, or state management beyond layout/styling changes needed for labels and padding.",
    "Do not redesign unrelated controls or pages outside PreMeditationPage active/setup phases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}