{
  "kind": "build_request",
  "title": "Fix Meditation page timer controls and alignment regression",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the Meditation page (the pre-meditation flow at route \"/pre-meditation\"), replace the unexpected timer control buttons with a time range input UI (as it previously existed) so the user can set the session duration via input fields instead of those buttons.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In meditation page, they should be replaced with input time range. Like previously it was."
        ]
      },
      "acceptanceCriteria": [
        "In the \"/pre-meditation\" page, the timer duration can be set using a time range input UI (two inputs for start/end or equivalent range selector), not via the current unexpected buttons.",
        "No extra/unintended control buttons are shown where the time range input is expected."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Center-align the meditation timer display on the Meditation page so the timer (ring + time text) is visually centered horizontally (and not slightly left) across common viewport sizes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Adjust timer to be in center position, because it is slightly to the left in meditation page."
        ]
      },
      "acceptanceCriteria": [
        "On the active meditation view in \"/pre-meditation\", the timer ring and time readout are centered within the page container (visually aligned with the page’s horizontal center).",
        "Center alignment remains correct on mobile and desktop breakpoints."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Limit changes to only what is necessary to restore the Meditation page’s previous duration input behavior and fix timer centering; avoid unrelated UI/behavior changes elsewhere in the app.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I don't understand why you keep changing things I didn't request?"
        ]
      },
      "acceptanceCriteria": [
        "No unrelated UI changes are introduced outside the Meditation page as part of this fix.",
        "Existing meditation session flow (start, pause/resume, completion -> reflection/save) continues to work after the UI regression fix."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep backend architecture as a single Motoko actor; do not introduce new backend services."
  ],
  "nonGoals": [
    "Redesigning the overall Meditation experience beyond restoring the time range input and fixing centering.",
    "Adding new meditation types, new audio content, or new backend persistence features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}