{
  "kind": "build_request",
  "title": "Fix Journal filters layout: always-column container with responsive mood/energy row and fixed date row",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the selected Journal filters container (/html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[2]/div[1]/div[1]) in frontend/src/components/JournalFiltersDropdown.tsx so the filter controls layout is always a column (not sm:flex-row), while preserving existing controls, styling theme, and behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "make filter container column, instead of row",
          "It should always be column container"
        ]
      },
      "acceptanceCriteria": [
        "On all viewport widths, the filter controls container stacks its child sections vertically (column layout).",
        "No filter control is laid out in a single horizontal row at any breakpoint (i.e., remove/avoid sm:flex-row behavior on the selected container)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Within the selected Journal filters container, group the Mood and Energy dropdown triggers into a single shared row that shows as two columns by default, and stacks to two rows only below 540px screen width (mood above energy).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0",
          "msg-1"
        ],
        "quotes": [
          "mood and energy dropdowns should share single row, and only separate, to 2 rows on lower than 540px width screens.",
          "3. Yes"
        ]
      },
      "acceptanceCriteria": [
        "At widths >= 540px, Mood and Energy controls render side-by-side on the same row.",
        "At widths < 540px, Mood renders above Energy (two rows) with no horizontal overflow.",
        "Both controls remain usable (buttons fully visible/tappable) at narrow widths (e.g., 360px)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Within the selected Journal filters container, ensure the Date From and Date To inputs always share a single row with two columns regardless of screen width (including below 540px), without stacking vertically.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0",
          "msg-1"
        ],
        "quotes": [
          "Date inputs, should share single row as well(in 2 columns), but do not separate on lower widths regardless.",
          "And date from-to, should also share same row/2 columns regardless of width"
        ]
      },
      "acceptanceCriteria": [
        "At all widths, the date inputs remain on the same row in two columns (From on the left, To on the right).",
        "The date row does not switch to a vertical stack at any breakpoint.",
        "The date inputs do not overflow the container on small screens."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Prevent horizontal overflow of filter controls (notably the search input and Clear button) on small screens by adjusting sizing/wrapping rules inside the selected container while keeping the existing controls and order.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0",
          "msg-1"
        ],
        "quotes": [
          "I also see couple elements, like search input, and clear button ... overflows off the screen on lower screens.",
          "in row, I see clear btn overflow"
        ]
      },
      "acceptanceCriteria": [
        "At narrow widths (e.g., 360–430px), no horizontal scrollbar appears due to the filter controls container.",
        "The Search input and Clear button remain fully visible within the container bounds when activeFilterCount > 0.",
        "Favorites checkbox label and Clear button do not push other controls off-screen."
      ]
    }
  ],
  "constraints": [
    "Apply layout changes ONLY to the selected element located at /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[2]/div[1]/div[1] (the filter controls container in frontend/src/components/JournalFiltersDropdown.tsx).",
    "Do not edit any files under frontend/src/components/ui or any path listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Do not change filtering logic/state management or backend behavior.",
    "Do not change the set of available filter controls (moods, energy, date range, search, favorites, clear).",
    "Do not redesign unrelated Journal page layout outside the selected filter container."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}