{
  "kind": "build_request",
  "title": "Revert UI theming to Draft 94 (fix mismatched colors and backgrounds)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Restore the application’s color system to match Draft 94 by reverting any Draft 95 changes that altered theme tokens (backgrounds, foreground/text colors, card/popover colors, border/input/ring, accent/secondary/muted, destructive) so that the UI no longer shows mismatched backgrounds and inconsistent text colors across pages and components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can you revert to draft 94, everything is bugged in terms of colors, backgrounds do not match, text colors are different.",
          "Almost all colors are different and backgrounds changes"
        ]
      },
      "acceptanceCriteria": [
        "In both light and dark mode, background, card, and popover surfaces visually match each other as intended (no unexpected shifts between sections of the same page).",
        "Text colors (default, muted, and on-primary/on-accent) are consistent across Landing, Dashboard, Pre-meditation, Progress, Journal, and Books pages.",
        "No UI element renders with unreadable contrast due to incorrect token values (e.g., light text on light background or dark text on dark background)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Eliminate theme-token drift by ensuring there is a single authoritative source of global CSS theme variables used by Tailwind (OKLCH tokens), and prevent unused/duplicate token files from inadvertently affecting builds (e.g., ensure the app imports and relies on only the intended theme token file and that token naming matches what Tailwind expects).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "everything is bugged in terms of colors, backgrounds do not match, text colors are different"
        ]
      },
      "acceptanceCriteria": [
        "Only one global theme token definition is effectively applied at runtime (no conflicting :root/.dark variable sets).",
        "Tailwind color utilities resolve to the expected CSS variables for background/foreground/card/popover/primary/secondary/muted/accent/destructive/border/input/ring.",
        "Switching themes (dark/light) updates the same set of tokens consistently without leaving components in mixed theme states."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Audit key UI surfaces to ensure they exclusively use the shared theme tokens (e.g., bg-background, text-foreground, bg-card, text-muted-foreground) rather than hardcoded colors that could cause Draft 95-style inconsistencies; update any offending styles so component backgrounds and text colors remain consistent with the restored Draft 94 theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "backgrounds do not match, text colors are different"
        ]
      },
      "acceptanceCriteria": [
        "No core page container or major card-like surface uses hardcoded colors that diverge from theme tokens.",
        "After the fixes, the same component looks consistent when rendered on different pages (no different background/text coloring due to local overrides)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (compose with them as-is).",
    "Do not edit immutable hook files listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add new features (e.g., onboarding, weekly summary, ritual limit changes) as part of this request.",
    "Do not change backend logic or data models; this is a theming regression fix only."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}