{
  "kind": "build_request",
  "title": "Make meditation active controls more compact and centered (play/pause, timer, sliders)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the meditation page, center the entire selected active-session UI block as a single group within the viewport (do not center each element independently). Apply this only to the selected elements identified by these XPaths:\n- Canvas: /html[1]/body[1]/div[1]/div[1]/div[2]/div[1]/div[1]/div[1]/canvas[1]\n- Canvas container: /html[1]/body[1]/div[1]/div[1]/div[2]/div[1]/div[1]/div[1]/div[1]\n- Controls container: /html[1]/body[1]/div[1]/div[1]/div[2]/div[1]/div[1]/div[2]/div[1]\n- Timer element: /html[1]/body[1]/div[1]/div[1]/div[2]/div[1]/div[1]/div[2]/div[2]",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "1. As a whole group",
          "...position elements to the center of screen."
        ]
      },
      "acceptanceCriteria": [
        "When viewing the meditation active-session area, the selected canvas + timer + sliders + play/pause controls appear visually centered as one grouped block (not individually centered within separate columns).",
        "No other non-selected page sections change alignment/position as a side effect."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Reduce the play/pause button container size to be at least 2× smaller (width/height or padding), while keeping the play/pause icon size unchanged. Apply only to the selected button element:\n- /html[1]/body[1]/div[1]/div[1]/div[2]/div[1]/div[1]/div[2]/button[1]",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The pause/play button should be at least 2x smaller, but the icon inside the play/pause button can stay the same, it is just the container that is too big."
        ]
      },
      "acceptanceCriteria": [
        "The clickable container of the play/pause button is visibly at least 2× smaller than before (e.g., reduced padding and/or fixed dimensions), but the icon glyph renders at the same size as before.",
        "The button remains fully functional and accessible (still clickable/tappable; focus styles remain visible).",
        "Only the selected play/pause button element is resized; other buttons/icons elsewhere are unaffected."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the timer display slightly smaller (modest reduction only). Apply only to the selected timer element:\n- /html[1]/body[1]/div[1]/div[1]/div[2]/div[1]/div[1]/div[2]/div[2]",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "and timer should be  a bit smaller only."
        ]
      },
      "acceptanceCriteria": [
        "The timer text/visual is reduced slightly (not dramatically) compared to the current UI, maintaining readability and hierarchy.",
        "No other text elements outside the selected timer element change size."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Moderately reduce vertical spacing/gaps within the selected controls container so the time input range and volume input range are closer together (more compact, but not tightly stacked). Apply only to the selected controls container:\n- /html[1]/body[1]/div[1]/div[1]/div[2]/div[1]/div[1]/div[2]/div[1]",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "...with less gaps, especially between the time input range and volume input range, they are too far apart...",
          "3. moderately reduced"
        ]
      },
      "acceptanceCriteria": [
        "The vertical gap between the time slider area and the volume slider area inside the selected controls container is reduced to a moderate, visually compact spacing (clearly smaller than before, but not cramped).",
        "Spacing reductions are limited to the selected controls container; spacing elsewhere on the page is unchanged."
      ]
    }
  ],
  "constraints": [
    "Apply the requested UI changes ONLY to the elements identified by the provided XPaths; do not refactor unrelated layout or styling.",
    "Do not change the play/pause icon size—only reduce the container sizing around it.",
    "Do not edit files under frontend/src/components/ui or other paths listed as immutable by the system."
  ],
  "nonGoals": [
    "No changes to meditation timer logic, audio behavior, or session recording.",
    "No redesign of the setup or reflection sections beyond the selected elements.",
    "No new features, routes, or backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}