{
  "kind": "build_request",
  "title": "Fix authenticated (online) ritual deletion in backend",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Motoko backend so authenticated users can delete a saved ritual online using the existing frontend call actor.deleteRitual(ritual), without any frontend changes. Deletion must match the same fields used by guest/local deletion: meditationType, duration, ambientSound, and ambientSoundVolume (ignore timestamp).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you allow rituals to be deleted for online? Do not change anything on front-end. Just allow deletion of rituals, like locally it works, but also online it should work(because it doesn't).",
          "So duration, meditation type, and ambient sound and its volume.",
          "return actor.deleteRitual(ritual);"
        ]
      },
      "acceptanceCriteria": [
        "When authenticated, calling deleteRitual with a Ritual that exists in the caller’s rituals list removes the matching ritual(s) from that caller’s stored rituals.",
        "Matching is performed on meditationType, duration, ambientSound, ambientSoundVolume exactly; timestamp differences do not prevent deletion.",
        "If the specified ritual is not found for that caller, the backend returns an error (trap) consistent with current behavior (e.g., RitualNotFound), and the stored rituals remain unchanged.",
        "After successful deletion, listCallerRituals for the same caller no longer includes the deleted ritual(s)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the backend persistently updates ritualsStore when deleting rituals (i.e., the updated filtered list replaces the previous value for the caller key), so the change is visible to subsequent listCallerRituals calls and survives within the canister state as expected.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "var ritualsStore = Map.empty<Principal, List.List<Ritual>>();",
          "ritualsStore.add(caller, filteredRituals);"
        ]
      },
      "acceptanceCriteria": [
        "After deleteRitual returns successfully, a subsequent listCallerRituals call in the same session returns the updated list (with deletions reflected).",
        "No changes are required in the frontend React Query invalidation logic; the existing invalidateQueries({ queryKey: ['rituals'] }) flow results in the UI reflecting the deletion for authenticated users."
      ]
    }
  ],
  "constraints": [
    "Do not modify any frontend code.",
    "Keep the existing deleteRitual method name and parameter shape compatible with the current frontend call actor.deleteRitual(ritual).",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Use English for any user-facing text in the build request (no new UI text is requested)."
  ],
  "nonGoals": [
    "Adding a new Ritual ID field or changing the Ritual type schema.",
    "Changing how rituals are displayed, selected, or confirmed in the UI.",
    "Implementing new authentication methods beyond Internet Identity.",
    "Adding external databases or services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}