{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Pre-meditation UI polish: guide button reposition, larger slider hit areas, themed play/pause restyle",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Reposition the \"More Details\" button to be horizontally centered at the bottom of the meditation guide container during setup phase.",
      "acceptanceCriteria": [
        "When viewing the pre-meditation page in setup phase, the \"More Details\" button is visually located at the bottom edge of the guide container.",
        "The \"More Details\" button is horizontally centered within the guide container.",
        "The \"More Details\" button still triggers the existing navigation behavior (to the Knowledge page with the current meditation type)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Update the setup-phase layout for the meditation guide container so the existing \"More Details\" Button is rendered in a bottom-aligned, horizontally centered area (instead of top-right positioning) while preserving the current click handler/navigation. Use the shadcn-ui Button component for consistent styling (verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Increase the size of the volume and seek/time slider control containers during active phase to improve usability while keeping standard slider inputs and behavior.",
      "acceptanceCriteria": [
        "In active phase, both the volume and seek/time slider areas have noticeably larger hit/visual area than before (increased padding and/or container sizing).",
        "Both controls remain standard slider inputs (no knob/dial replacement).",
        "Changing the volume slider still updates ambient audio volume as before.",
        "Changing the seek/time slider still adjusts the session time as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Adjust the active-phase UI around the two existing Slider controls (volume and seek/time) to increase container height/padding (and optionally add min-height) for a larger touch target, without changing slider type or handlers. Continue using the shadcn-ui Slider component (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If needed to achieve consistent larger hit areas across themes, add a small, scoped utility/class for the pre-meditation active-phase slider container sizing (padding/min-height) and apply it from PreMeditationPage."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Restyle the active-phase play/pause button to better match the app theme and update its sizing/shape while preserving toggle behavior and icon switching.",
      "acceptanceCriteria": [
        "In active phase, the play/pause control has updated visual styling consistent with the app’s existing meditation theme (typography/colors/shadows consistent with other themed elements on the page).",
        "The play/pause control’s size and/or shape is changed (e.g., larger touch target and updated proportions), not just a color tweak.",
        "The button continues to toggle pause/resume exactly as before, including correctly switching the Play vs Pause icon."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Update the active-phase play/pause Button styling to a more theme-consistent treatment (e.g., revised shape/proportions, enhanced shadows/rings, updated sizing) while keeping the existing onClick (togglePause) logic and Play/Pause icon switching intact. Use the existing shadcn-ui Button component (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add any additional scoped utility/class needed for the updated play/pause control styling (e.g., consistent glow/ring across light/dark modes) and keep it limited to the pre-meditation active-phase control to avoid global regressions."
        }
      ]
    }
  ]
}