{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Pre-Meditation button label overflow fix and active meditation controls UI adjustments",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Shorten the Pre-Meditation \"More Details\" button label to exactly \"More Details\" without changing navigation behavior.",
      "acceptanceCriteria": [
        "In the Pre-Meditation page UI, the button text reads exactly \"More Details\".",
        "Clicking the button navigates to the same destination as before (Knowledge page deep link behavior remains unchanged).",
        "On small/mobile widths, the button label no longer overflows its container."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Update the existing \"More Details\" action button to display the label text exactly \"More Details\" (English) while reusing the existing click handler/navigation logic (keep the same destination/behavior). If the button uses shadcn-ui Button, keep it and only adjust displayed label (and any minimal layout classes needed to avoid overflow). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the active session Play/Pause control a circular icon button.",
      "acceptanceCriteria": [
        "The Play/Pause button is visually circular (equal width/height with fully rounded corners).",
        "The Play/Pause icon remains centered within the circular button across responsive breakpoints."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "In the active meditation session UI (the in-session/\"active\" phase view), change the Play/Pause control styling to a true circular icon button (equal width/height + fully rounded), ensuring the icon remains centered. If implemented with shadcn-ui Button, keep using it and adjust size/shape via className/props only. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Left-align the Volume and Adjusting Time labels above their respective controls in the active session view.",
      "acceptanceCriteria": [
        "The Volume label is positioned above its control container and its left edge aligns with the container's left edge.",
        "The Adjusting Time label is positioned above its control container and its left edge aligns with the container's left edge.",
        "Label alignment remains correct on small screens and larger screens (no drift/misalignment)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "In the active meditation session UI, adjust the layout for the Volume control and Adjusting Time control so each label is placed above-left and left-aligned to the same left edge as its control container (use consistent container structure and text alignment utilities). If labels are rendered with shadcn-ui Label, keep the component and update only layout/alignment classes. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix the Adjusting Time slider so thumb and track fill move left-to-right with value.",
      "acceptanceCriteria": [
        "Dragging the Adjusting Time slider thumb to the left moves the thumb visually left and results in a smaller time value.",
        "Dragging the Adjusting Time slider thumb to the right moves the thumb visually right and results in a larger time value.",
        "No inverted/RTL visual behavior remains (thumb position and filled track correspond to the selected value)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "In the active meditation session UI, correct the Adjusting Time slider so the visual direction and filled track correspond to the value in a standard LTR manner (left = less time, right = more time). Ensure no direction/transform styling is causing inversion and keep the existing behavior for changing the time value. If implemented with shadcn-ui Slider, continue using it and adjust configuration/styling to remove inverted behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "If the inversion is caused by global styles (e.g., direction/transform rules affecting slider track/thumb), add a minimal, scoped CSS fix to ensure the Adjusting Time slider renders LTR (thumb and range fill) without impacting unrelated sliders elsewhere in the app."
        }
      ]
    }
  ]
}