{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore pre-meditation duration range inputs and fix timer centering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace unexpected timer control buttons with a duration time range input UI on /pre-meditation.",
      "acceptanceCriteria": [
        "In the \"/pre-meditation\" page, the timer duration can be set using a time range input UI (two inputs for start/end or equivalent range selector), not via the current unexpected buttons.",
        "No extra/unintended control buttons are shown where the time range input is expected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DurationRangeInput.tsx",
          "operation": "create",
          "description": "Create a small, self-contained duration range input component (two inputs representing a range, e.g., start/end in minutes) that validates/clamps values and emits the computed session duration back to the parent without relying on any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Update the /pre-meditation setup UI to use the new DurationRangeInput for setting session duration (two-input range UI) and remove the currently shown unexpected timer control buttons from the duration-setting area so only the intended range inputs are presented. Keep the existing session start and save/ritual logic intact. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Center-align the active meditation timer ring + time readout on /pre-meditation across breakpoints.",
      "acceptanceCriteria": [
        "On the active meditation view in \"/pre-meditation\", the timer ring and time readout are centered within the page container (visually aligned with the page’s horizontal center).",
        "Center alignment remains correct on mobile and desktop breakpoints."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Adjust the active phase layout wrappers around the timer visualization so the timer container is horizontally centered (e.g., ensure full-width centering with flex/grid and consistent max-width + auto margins) and the overlay time text remains centered over the ring. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/MeditationWaveFillIndicator.tsx",
          "operation": "modify",
          "description": "Ensure the canvas element is rendered in a way that centers reliably within its parent (e.g., make it a block-level element and allow auto horizontal margins via className) so the ring is not visually shifted left. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Constrain the fix to the Meditation page only and preserve the existing meditation session flow behavior.",
      "acceptanceCriteria": [
        "No unrelated UI changes are introduced outside the Meditation page as part of this fix.",
        "Existing meditation session flow (start, pause/resume, completion -> reflection/save) continues to work after the UI regression fix."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Audit changes to ensure they are limited to restoring the previous duration-input behavior and fixing centering: keep existing state transitions (setup -> active -> reflection), timer start/pause/resume behavior via useMeditationTimer, and completion handling unchanged aside from wiring the new duration input values. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}