{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Meditation UI refinements for dashboard background, pre-meditation layout, and active-session controls",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Increase Dashboard lotus/particle canvas background visibility by ~20% while keeping it animated and non-interactive.",
      "acceptanceCriteria": [
        "On /dashboard, the lotus + particle canvas background appears ~20% more visible/intense than before (both lotus glow/petals and particles).",
        "The lotus/particles remain animated via canvas rendering, and the canvas remains non-interactive (does not block clicks/scroll)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Increase the PageBackgroundShell/LotusCanvas intensity used on the Dashboard by ~20% (e.g., adjust the intensity prop) without changing animation behavior; ensure the background remains click-through (canvas has pointer-events disabled)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Box the pre-meditation setup controls (ambient sound, duration, Begin/Save Ritual) into a single card-style container.",
      "acceptanceCriteria": [
        "In setup phase on /pre-meditation, ambient sound selection + duration selection + Begin/Save Ritual actions are visually contained within one card/boxed container.",
        "The container is clearly distinguishable from the background (e.g., uses a surface/background color plus border and/or shadow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "In the setup phase layout, wrap the AmbientMusicCarousel, DurationRangeInput, and the primary action buttons (Begin and Save Ritual) inside a single visually distinct boxed container (card styling via Tailwind and/or existing shadcn-ui primitives such as Card if available). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Box the meditation guide into its own container and add a bottom-centered 'More details' button that deep-links to the matching Knowledge technique section.",
      "acceptanceCriteria": [
        "In setup phase on /pre-meditation, the meditation guide is inside a distinct card/boxed container separate from the ambient/duration/actions container.",
        "A bottom-centered button with English label \"More details\" is present within the guide container.",
        "Clicking \"More details\" navigates to /knowledge with the category corresponding to the current meditation type and triggers the existing deep-link scroll behavior to the content section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Update the setup phase layout to place the MeditationGuideStepper and related guide content into a separate boxed container; add a bottom-centered Button labeled \"More details\" wired to the existing navigation logic (category=selectedType and scrollToContent enabled) so KnowledgePage deep-link scroll triggers. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make the active-session play/pause control circular while preserving its icon and behavior.",
      "acceptanceCriteria": [
        "During an active meditation session, the play/pause button renders with a circular shape (equal width/height and fully rounded corners).",
        "Tapping the button still correctly toggles between pause and play behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "In the active phase UI controls, adjust the play/pause Button styling to be circular (equal width/height with fully rounded corners) while keeping the same icon and click handler behavior (togglePause) unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Fix the active-session time scrubber to behave like a standard media scrubber with correct direction, immediate reactivity, and seeking while paused or playing.",
      "acceptanceCriteria": [
        "In active phase, the time scrubber direction is correct: moving the thumb left reduces remaining time; moving it right increases remaining time.",
        "The displayed remaining time (mm:ss) and the scrubber thumb stay in sync while dragging (no reversed visual behavior).",
        "Seeking works while the timer is running and while paused, and updates the session state immediately (remaining time and progress visuals update accordingly)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Rebind the active-session scrubber control (Slider/range) so its value directly represents timeRemaining (min=0, max=totalTime, value=timeRemaining) and on drag calls seekTime(newRemainingSeconds); ensure the displayed mm:ss uses the same timeRemaining state and that progress visuals update consistently while dragging, whether paused or playing. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}