{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Pre-meditation in-session label/padding adjustments and setup guide repositioning",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "In active-phase PreMeditationPage, move Volume and Time/Seek labels to top-left outside their slider containers and increase label font size using Tailwind px-based text utilities, without changing slider behavior.",
      "acceptanceCriteria": [
        "When phase === \"active\", the Volume control label is positioned at the top-left outside the visual container that wraps the volume slider.",
        "When phase === \"active\", the Time/Seek control label is positioned at the top-left outside the visual container that wraps the time/seek slider.",
        "Both labels have a visibly larger font size than before and are set using a Tailwind px-based text size utility (e.g., text-[...]px).",
        "No changes to slider behavior (value changes, timer seek, audio volume) are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Adjust the active-phase JSX for the Volume and Time/Seek slider sections so each label renders above (outside) the slider container and aligns top-left (e.g., remove centered label styling and apply Tailwind px-based text sizing like text-[14px]/text-[16px], plus left alignment). Keep existing Slider props and handlers intact to avoid behavioral changes. Note: this uses existing shadcn-ui Label/Slider components—verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "In active-phase PreMeditationPage, update Volume and Time/Seek slider wrapper containers to use Tailwind px-6 py-5 and remove the premed-slider-container class.",
      "acceptanceCriteria": [
        "In PreMeditationPage active-phase UI, the wrapper/container for the volume input includes \"px-6 py-5\".",
        "In PreMeditationPage active-phase UI, the wrapper/container for the time/seek input includes \"px-6 py-5\".",
        "In PreMeditationPage active-phase UI, neither container includes the \"premed-slider-container\" class.",
        "Layout reflects reduced vertical padding compared to the previous container styling while preserving consistent horizontal padding."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Update the active-phase container className values that wrap the Volume Slider and the Time/Seek Slider to include Tailwind \"px-6 py-5\" and remove the \"premed-slider-container\" class from both. Preserve all other structural/layout classes needed for backgrounds/borders and keep slider wiring unchanged. Note: this uses the existing shadcn-ui Slider component—verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Retire the premed-slider-container styling so it is no longer required after removing the class from the in-session Volume/Time controls, ensuring no remaining references for those two controls.",
      "acceptanceCriteria": [
        "There are no remaining \"premed-slider-container\" className usages for the in-session Volume and Time/Seek containers.",
        "If the CSS utility class block for \".premed-slider-container\" remains in frontend/src/index.css, it is not required by the in-session Volume/Time controls; alternatively, the unused CSS block is removed without causing visual regressions elsewhere."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Remove the \".premed-slider-container\" utility styling block (and its hover block) if it is no longer used anywhere after the PreMeditationPage updates, or otherwise ensure it is not relied upon by the active-phase Volume/Time slider containers. Validate there are no remaining references for those two controls."
        },
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Verify the Volume and Time/Seek containers no longer reference the \"premed-slider-container\" class, and that replacement Tailwind classes fully cover required spacing/structure for the two controls."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "In setup-phase PreMeditationPage, move the meditation guide (guide/stepper) container to the bottom of the page content hierarchy, after all setup controls.",
      "acceptanceCriteria": [
        "When phase === \"setup\", the meditation guide container renders after all other setup sections (e.g., meditation type info, duration/time selection, ambient sound selection, mood/energy selections, etc.).",
        "The guide container appears visually at the bottom of the setup page content (last section before the page ends), without overlapping other content.",
        "All existing guide functionality (step navigation, “More Details” button behavior if present) continues to work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Reorder the setup-phase JSX so the MeditationGuideStepper (guide container) renders last within the setup page's main content, below all other setup controls/sections. Keep the guide props/handlers (including any “More Details” behavior) unchanged to preserve existing functionality. Note: this uses the existing MeditationGuideStepper component—verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}