{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Journal filters layout fix: column container with responsive mood/energy row, fixed date row, and no small-screen overflow",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the selected Journal filters container always use a vertical (column) layout across all breakpoints while preserving existing controls and styling.",
      "acceptanceCriteria": [
        "On all viewport widths, the filter controls container stacks its child sections vertically (column layout).",
        "No filter control is laid out in a single horizontal row at any breakpoint (i.e., remove/avoid sm:flex-row behavior on the selected container)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/JournalFiltersDropdown.tsx",
          "operation": "modify",
          "description": "Update ONLY the selected filter controls container (the div currently using `flex flex-col sm:flex-row ...`) so it is always a column layout (remove `sm:flex-row`/`sm:items-center` behavior), keeping the same controls, order, theme classes, and behavior intact."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Group Mood and Energy dropdown triggers into one shared responsive row: two columns by default, stacking only below 540px (Mood above Energy).",
      "acceptanceCriteria": [
        "At widths >= 540px, Mood and Energy controls render side-by-side on the same row.",
        "At widths < 540px, Mood renders above Energy (two rows) with no horizontal overflow.",
        "Both controls remain usable (buttons fully visible/tappable) at narrow widths (e.g., 360px)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/JournalFiltersDropdown.tsx",
          "operation": "modify",
          "description": "Within the selected container, wrap the Mood and Energy Popover triggers into a shared row container that uses a 2-column layout at >=540px and a 1-column stack below 540px (Mood first). Adjust trigger sizing (e.g., prefer `w-full`/`min-w-0` over fixed `min-w-[140px]`) to avoid overflow while preserving existing styles."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Keep Date From and Date To inputs permanently in a single two-column row at all screen widths, including below 540px.",
      "acceptanceCriteria": [
        "At all widths, the date inputs remain on the same row in two columns (From on the left, To on the right).",
        "The date row does not switch to a vertical stack at any breakpoint.",
        "The date inputs do not overflow the container on small screens."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/JournalFiltersDropdown.tsx",
          "operation": "modify",
          "description": "Within the selected container, place Date From and Date To into their own dedicated date row that is always two columns (never stacks). Ensure the inputs can shrink to fit small screens (e.g., remove overly large min-widths and apply `min-w-0` where needed) while preserving existing input styling."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Eliminate horizontal overflow on small screens for the Search input and Clear button by adjusting sizing and wrapping rules inside the selected container (no control/order changes).",
      "acceptanceCriteria": [
        "At narrow widths (e.g., 360–430px), no horizontal scrollbar appears due to the filter controls container.",
        "The Search input and Clear button remain fully visible within the container bounds when activeFilterCount > 0.",
        "Favorites checkbox label and Clear button do not push other controls off-screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/JournalFiltersDropdown.tsx",
          "operation": "modify",
          "description": "Within the selected container, adjust layout of the Search input, Favorites checkbox, and conditional Clear button to prevent overflow at narrow widths (e.g., allow wrapping with `flex-wrap`, ensure the search input can shrink with `min-w-0`, and keep Clear visible when rendered via appropriate wrapping/sizing). Maintain existing control order and behavior."
        }
      ]
    }
  ]
}