{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Pre‑Meditation UI tweaks: move “More Details” button and adjust “Begin Meditation” button height on small screens",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Move the “More Details” button from the Meditation Guide header to the bottom of the guide container while keeping its label and navigation behavior unchanged.",
      "acceptanceCriteria": [
        "On PreMeditationPage (setup phase), the “More Details” button no longer appears next to the “Meditation Guide” heading.",
        "The “More Details” button appears after the guide content (below the MeditationGuideStepper) within the same guide container card.",
        "Clicking “More Details” still navigates to /knowledge with search params { category: selectedType, scrollToContent: true }.",
        "No other buttons or text in the guide container are modified beyond what is required to reposition this selected button."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Update only the user-selected “More Details” Button currently rendered in the Meditation Guide header row: remove it from the header layout and re-render the same Button (same onClick handler, label, icon, variant/size, and className) after <MeditationGuideStepper /> within the same Meditation Guide section/card so it appears at the bottom of the guide container. Ensure navigation remains exactly navigate({ to: '/knowledge', search: { category: selectedType, scrollToContent: true } })."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Increase the “Begin Meditation” button height only in the small-screen stacked action-buttons layout without changing its width or behavior.",
      "acceptanceCriteria": [
        "When the action buttons stack into a single column on small screens, the “Begin Meditation” button has increased height (e.g., via responsive min-height/padding) and no longer appears thinner than “Save as Ritual.”",
        "On larger screens where the buttons remain side-by-side, the “Begin Meditation” button height remains unchanged from current desktop/tablet styling.",
        "The “Begin Meditation” button continues to trigger the existing begin-meditation behavior (no logic changes).",
        "No other elements besides the selected “Begin Meditation” button are restyled as part of this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Locate the action buttons area that switches from stacked (flex-col) on small screens to side-by-side (sm:flex-row). Update only the user-selected “Begin Meditation” Button within this area to add responsive height styling that applies on small screens only (e.g., a base min-height and/or padding increase paired with an sm: override that preserves the current desktop/tablet height). Do not change its click handler, variant, width-related classes, or any other element styling."
        }
      ]
    }
  ]
}