{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Meditation setup/active/reflection UX updates and standardized page navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the meditation type carousel selector from the Pre-Meditation setup flow while keeping setup usable.",
      "acceptanceCriteria": [
        "PreMeditationPage no longer renders the MeditationCarousel component in the setup UI.",
        "Meditation setup remains usable (user can still proceed into a meditation session without the type carousel being shown)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Remove MeditationCarousel import and any rendering/selection UI that uses the carousel in the setup view, keeping the rest of the setup flow functional (duration, ambient sound, ritual selection, and begin-meditation action remain accessible)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore step-by-step meditation guide in Pre-Meditation setup and add a dismissible \"More details\" expanded guide view.",
      "acceptanceCriteria": [
        "PreMeditationPage setup includes a step guide UI (using the existing MeditationGuideStepper) for the currently selected meditation type.",
        "A \"More details\" button is present near the step guide and, when activated, shows expanded guide information (not just a tooltip) and is dismissible.",
        "The step guide and \"More details\" feature work on both mobile and desktop layouts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Ensure the setup view renders the existing MeditationGuideStepper for the currently selected meditation type, and add a clearly placed \"More details\" control that opens an expanded, dismissible view (e.g., a shadcn/ui Dialog or Drawer). Use shadcn-ui components to provide the expanded view and dismissal behavior; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Standardize Back button and theme toggle across specified pages by replacing page-specific controls with StandardPageNav.",
      "acceptanceCriteria": [
        "PreMeditationPage uses StandardPageNav and does not render DashboardBackButton or its own theme toggle button.",
        "JournalPage uses StandardPageNav and does not render DashboardBackButton or its own theme toggle button.",
        "ProgressPage uses StandardPageNav and does not render DashboardBackButton or its own theme toggle button.",
        "Back navigation goes to /dashboard (matching StandardPageNav behavior) and theme toggle behavior matches StandardPageNav.",
        "No duplicate back/theme controls appear on any of the affected pages in either mobile or desktop breakpoints."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Remove page-specific back/theme/session controls (including DashboardBackButton and any inline Moon/Sun, SessionIndicator, HamburgerMenu usage) and render StandardPageNav instead so setup/active/reflection views share the same nav behavior as Book/Knowledge pages."
        },
        {
          "path": "frontend/src/pages/JournalPage.tsx",
          "operation": "modify",
          "description": "Replace DashboardBackButton and the page-specific theme toggle/session/hamburger UI with StandardPageNav, ensuring only one set of back/theme controls is rendered at all breakpoints."
        },
        {
          "path": "frontend/src/pages/ProgressPage.tsx",
          "operation": "modify",
          "description": "Replace DashboardBackButton and the page-specific theme toggle/session/hamburger UI with StandardPageNav, ensuring only one set of back/theme controls is rendered at all breakpoints."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Use the existing circular timer ring during active meditation instead of the square/wave-fill timer.",
      "acceptanceCriteria": [
        "During active meditation, the timer display is circular (ring) rather than square/wave-fill.",
        "The timer continues to reflect the countdown correctly (time remaining and progress) and responds to pause/resume as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "In the active meditation view, replace the current MeditationTimerWaveFill-based timer UI with the existing MeditationTimerRing component, keeping time remaining text/progress/pause-resume behavior consistent with the existing timer state from useMeditationTimer."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Convert post-meditation reflection into a sequential, step-based flow (mood → energy → note/favorite/save) with required-step validation.",
      "acceptanceCriteria": [
        "After the meditation completes, the UI shows a step-based reflection flow where mood selection is shown first, energy selection second, and note/favorite/save last.",
        "User cannot advance past mood selection without selecting at least one mood.",
        "User cannot advance past energy selection without selecting an energy level.",
        "The note field is optional and can be left empty while still allowing save.",
        "Favorite can be toggled during the final step before saving.",
        "Saving creates the journal entry using the existing create flow and navigates to /dashboard on success (maintaining existing behavior), with errors surfaced via existing toast/error handling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Refactor the reflection view UI into three sequential steps: (1) mood selection (required), (2) energy selection (required), (3) optional note + favorite toggle + save. Add step navigation (next/back) and step-level validation that only blocks advancing when mood/energy are missing, while reusing the existing createJournalEntry save behavior, toasts, and /dashboard navigation."
        }
      ]
    }
  ]
}