{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Active meditation back navigation + bottom-to-top wave fill timer indicator",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an accessible back button on the in-session (active) meditation view that navigates to /pre-meditation via TanStack Router.",
      "acceptanceCriteria": [
        "When the user is in the active meditation view, a visible back button is present.",
        "Clicking/tapping the back button navigates to `/pre-meditation` using TanStack Router navigation.",
        "The back button has an accessible label in English (e.g., \"Back to setup\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "In the active (in-session) UI branch, add a visible back button that calls TanStack Router navigate({ to: '/pre-meditation', ... }) and resets the local in-page state back to the setup view (so the user actually returns to the pre-meditation setup screen). Ensure the button has an English aria-label such as \"Back to setup\"."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace the active meditation ring timer visualization with a calm animated wave fill indicator that fills bottom-to-top based on session progress.",
      "acceptanceCriteria": [
        "The indicator fill level is driven by the meditation session progress (0.0 at start, 1.0 at completion / 0 seconds remaining).",
        "The wave surface animates in a smooth, continuous loop (calm motion; no jitter or stutter under normal use).",
        "At 15 minutes chosen: session start renders empty; at 7:30 remaining renders ~50% filled; at 0:00 remaining renders 100% filled.",
        "The old ring-style timer visualization is no longer shown on the active meditation view."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MeditationWaveFillIndicator.tsx",
          "operation": "create",
          "description": "Create a new visualization component that renders a bottom-to-top fill container with a smoothly looping wave surface. The component should accept session progress (0..1) and draw a calm animated wave at the current fill height (e.g., via canvas or SVG), starting empty and becoming fully filled at progress=1."
        },
        {
          "path": "frontend/src/pages/PreMeditationPage.tsx",
          "operation": "modify",
          "description": "Update the active (in-session) meditation view to use the new MeditationWaveFillIndicator driven by the timer's progress, and remove/hide the MeditationTimerRing from the active view so the ring visualization is no longer shown during the session."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Animate wave fill level changes with an ease-in-out transition when remaining time/duration is adjusted (seeking), without interrupting the wave loop animation.",
      "acceptanceCriteria": [
        "If the user adjusts the time (seek), the fill level transitions smoothly to the new level using an ease-in-out feel.",
        "The wave animation continues seamlessly during and after the fill-level transition."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MeditationWaveFillIndicator.tsx",
          "operation": "modify",
          "description": "Implement a displayed fill level that eases toward the incoming target progress (from props) using an ease-in-out transition over a short duration, while keeping the wave surface animation running continuously (e.g., separate wave phase time from fill interpolation). Ensure this handles both normal ticking and sudden seek jumps smoothly."
        }
      ]
    }
  ]
}