{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Enable backend support so authenticated/online users can delete rituals (cloud sync) without any frontend changes; match local deletion behavior.",
  "architectural_notes": [
    "Rituals are stored in Motoko as `var ritualsStore = Map.empty<Principal, List.List<Ritual>>()` keyed by caller Principal.",
    "Backend `deleteRitual(ritualToDelete : Ritual)` identifies rituals by matching meditationType, duration, ambientSound, and ambientSoundVolume (not timestamp/id)."
  ],
  "known_issues": [
    "Online/authenticated ritual deletion currently does not work (local/guest deletion works)."
  ],
  "isFixRequest": true,
  "existing_features": [],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix/enable online (authenticated) ritual deletion in backend canister without frontend changes; deletion matches by meditationType, duration, ambientSound, ambientSoundVolume.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Update the Motoko backend so authenticated users can delete a saved ritual online using the existing frontend call actor.deleteRitual(ritual), without any frontend changes. Deletion must match the same fields used by guest/local deletion: meditationType, duration, ambientSound, and ambientSoundVolume (ignore timestamp).",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Ensure the backend persistently updates ritualsStore when deleting rituals (i.e., the updated filtered list replaces the previous value for the caller key), so the change is visible to subsequent listCallerRituals calls and survives within the canister state as expected.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix authenticated (online) ritual deletion in backend",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}